[
  {
    "title": "Rollups",
    "ingredients": [
      "4 skinless, boneless chicken breast halves",
      "1 (8 ounce) package cream cheese with chives",
      "2 tablespoons melted butter"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Pound meat to between 1/4 and 1/8 inch thick.\nSpread about a tablespoon of seasoned cream cheese on the bottom of each breast half. Roll up, and place in a casserole dish. Drizzle melted butter over rollups.\nBake in the preheated oven for about 30 minutes, or until chicken is cooked through and juices run clear.\nMelt extra cream cheese with chives in the microwave, and use as sauce for the chicken.\n",
    "embedding_ingredients": "skinless, boneless chicken breast halves, package cream cheese with chives, melted butter",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Quick Polynesian Chicken",
    "ingredients": [
      "6 chicken thighs",
      "1 (15.25 ounce) can fruit cocktail"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nRinse and pat dry the chicken pieces. If you wish, remove the skins (not mandatory). Place chicken in a 9x13 inch baking dish.\nPour the fruit cocktail and juices evenly over the chicken and bake in the preheated oven for 1 hour (no turning or basting needed). Let cool and serve.\n",
    "embedding_ingredients": "hicken thighs, can fruit cocktail",
    "features": {
      "preparation_time": "medium",
      "prep_time": 60,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Buttermilk Oatmeal Bread",
    "ingredients": [
      "1 cup rolled oats",
      "1 cup buttermilk",
      "1/2 cup vegetable oil",
      "1 egg",
      "1/2 cup packed brown sugar",
      "1 cup all-purpose flour",
      "1 teaspoon baking powder",
      "1/2 teaspoon baking soda",
      "1/2 teaspoon salt"
    ],
    "instructions": "Mix oats with buttermilk. Let stand for 1/2 hour.\nStir oil, egg, and brown sugar into oat mixture. Stir together flour, baking powder, soda, and salt: mix into oat mixture. Pour batter into a greased and floured 8 1/2 x 4 1/2 inch loaf pan.\nBake at 350 degrees F (175 degrees C) for 55 to 60 minutes, or until done.\n",
    "embedding_ingredients": "rolled oats, buttermilk, vegetable oil, egg, packed brown sugar, all-purpose flour, baking powder, baking soda, alt",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "French Chocolate Cake",
    "ingredients": [
      "1/2 cup white sugar",
      "10 (1 ounce) squares semi-sweet chocolate",
      "3/4 cup unsalted butter, cubed",
      "2 teaspoons vanilla extract",
      "5 eggs, separated",
      "1/4 cup sifted all-purpose flour",
      "1 dash cream of tartar",
      "salt to taste",
      "confectioners' sugar, for dusting (optional)"
    ],
    "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Generously grease a 9-inch springform cake tin. Dust with a little sugar, and tap out the excess.\nSet aside 3 tablespoons of the sugar. Place the chocolate, butter, and remaining sugar in a large, heavy-based pan. Cook over moderate heat until the chocolate and butter have melted, and the sugar has dissolved. Remove the pan from heat. Stir in the vanilla, and leave the mixture to cool slightly.\nBeat the egg yolks into the chocolate mixture one at a time, beating well after each addition. Stir in the flour.\nIn a large bowl, scrupulously clean and grease-free, beat the egg whites until foamy. Add the cream of tartar and salt, and beat to stiff peaks. Sprinkle reserved sugar over egg whites, and beat until stiff and glossy. Use a whisk or spatula to fold 1/3 of the egg whites into the chocolate mixture, then carefully fold in the remaining whites. Carefully pour batter into the prepared tin, and tap the tin gently to release air bubbles.\nBake until well risen and a skewer inserted into the center of the cake comes out clean, for about 45 minutes to 1 hour. Check the cake after 30 minutes: if the cake appears to rise unevenly, rotate after 30 to 35 minutes. If the cake starts to crack or become too brown, place a piece of foil lightly over the top. Transfer the cake to a wire cooling rack, and remove the sides of the springform tin. Cool completely, and then remove the base. Do not attempt to remove the cake before it's completely cooled as this cake is very fragile.\n",
    "embedding_ingredients": "white sugar, squares semi-sweet chocolate, unsalted butter, cubed, vanilla extract, eggs, separated, ifted all-purpose flour, dash cream of tartar, salt to taste, confectioners' sugar, for dusting",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Mock Angel Food Cake",
    "ingredients": [
      "4 1/2 cups cake flour",
      "4 cups white sugar",
      "2 teaspoons salt",
      "2 cups boiling water",
      "16 egg whites",
      "2 tablespoons baking powder",
      "2 teaspoons cream of tartar",
      "2 teaspoons vanilla extract",
      "1 teaspoon almond extract"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSift cake flour, sugar, and salt three times then stir in the boiling water. Let cool.\nBeat egg whites, cream of tartar, baking powder, vanilla and almond flavorings until stiff peaks form. Fold into the flour mixture and pour batter into one ungreased 12x18 inch baking pan.\nBake at 350 degrees F (175 degrees C) for 35 minutes. Cool cake inverted in pan, laying a tea towel underneath the cake to absorb the steam. Frost as desired once the cake is cooled.\n",
    "embedding_ingredients": "cake flour, white sugar, salt, boiling water, egg whites, baking powder, cream of tartar, vanilla extract, almond extract",
    "features": {
      "preparation_time": "medium",
      "prep_time": 35,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Bourbon Whipped Cream",
    "ingredients": [
      "1 cup heavy whipping cream",
      "2 tablespoons white sugar",
      "1 1/2 tablespoons premium bourbon"
    ],
    "instructions": "In a medium bowl, whip cream until soft mounds form. Gradually add sugar, whipping until cream forms stiff peaks. Gently fold in bourbon. Chill until ready to serve.\n",
    "embedding_ingredients": "heavy whipping cream, white sugar, premium bourbon",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Ginger Crinkles",
    "ingredients": [
      "2/3 cup vegetable oil",
      "1 cup white sugar",
      "1 egg",
      "1/4 cup molasses",
      "2 cups all-purpose flour",
      "2 teaspoons baking soda",
      "1 teaspoon ground cinnamon",
      "1 teaspoon ground ginger",
      "1/4 cup white sugar",
      "1/2 teaspoon salt"
    ],
    "instructions": "Mix oil and sugar thoroughly with electric mixer. Add egg and mix well. Pour in molasses. Sift and add dry ingredients until incorporated.\nRoll teaspoonful of dough into ball, drop into sugar to coat.\nPlace on ungreased cookie sheet. Bake at 350 degrees F (175 degrees C) for 15 minutes.\n",
    "embedding_ingredients": "vegetable oil, white sugar, egg, molasses, all-purpose flour, baking soda, cinnamon, ginger, white sugar, alt",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "Asian",
      "complexity": "medium"
    }
  },
  {
    "title": "Lavender Cookies",
    "ingredients": [
      "5/8 cup butter",
      "1/2 cup white sugar",
      "1 egg",
      "1 tablespoon lavender flowers",
      "1 1/2 cups all-purpose flour",
      "1/2 cup colored sugar for decoration (optional)",
      "1 tablespoon lavender flowers"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nCream together the butter and sugar. Beat the egg, and blend into the butter and sugar. Mix in the lavender flowers and the flour. Drop batter by teaspoonfuls onto cookie sheets.\nBake 15 to 20 minutes, or until golden. Remove cookies to cooling racks, and sprinkle with decorative sugar and additional lavender flowers if desired.\n",
    "embedding_ingredients": "butter, white sugar, egg, lavender flowers, all-purpose flour, colored sugar for decoration, lavender flowers",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Scalloped Corn III",
    "ingredients": [
      "1 (15 ounce) can whole kernel corn, drained",
      "1 (15 ounce) can creamed corn",
      "2 eggs, beaten",
      "1 cup milk",
      "75 buttery round crackers, crushed fine",
      "1/2 cup chopped green onions"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly butter casserole dish and set aside.\nIn a large mixing bowl, combine the whole corn, creamed corn, eggs, milk, crackers and green onion; mix well.\nPour mixture into prepared casserole dish.\nBake at 350 degrees F (175 degrees C) for 50 minutes.\n",
    "embedding_ingredients": "can whole kernel corn, drained, can creamed corn, eggs, beaten, milk, buttery round crackers, fine, green onions",
    "features": {
      "preparation_time": "medium",
      "prep_time": 50,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Lemon Filling",
    "ingredients": [
      "3/4 cup white sugar",
      "2 tablespoons all-purpose flour",
      "2 tablespoons grated orange zest",
      "1/2 cup orange juice",
      "2 tablespoons fresh lemon juice",
      "1 egg",
      "1 cup whipped cream"
    ],
    "instructions": "In a saucepan over medium heat mix the white sugar, flour, orange juice, orange zest, lemon juice and the egg. Cook until thickened. Remove from heat and let cool completely before folding in the whipped cream. Makes enough to fill one 2 layer 9 inch round layer cake.\n",
    "embedding_ingredients": "white sugar, all-purpose flour, orange zest, orange juice, fresh lemon juice, egg, whipped cream",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Cranberry Oatmeal Cookies",
    "ingredients": [
      "10 tablespoons butter",
      "2/3 cup packed dark brown sugar",
      "1 teaspoon vanilla extract",
      "2 eggs",
      "1 1/2 teaspoons baking soda",
      "1 pinch salt",
      "1 2/3 cups whole wheat flour",
      "1 cup rolled oats",
      "2 cups chopped cranberries",
      "3/4 cup chopped walnuts"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBlend butter and sugar until fluffy. Add eggs and vanilla and mix well. In a separate bowl sift flour, baking soda, and salt together. Stir into butter mixture. Stir in the oats. Fold in nuts and cranberries. Drop spoonfuls of cookie dough onto ungreased cookie sheets, spaced at least 2 inches apart. These cookies spread.\nBake 8 to 10 minutes in the preheated oven, until the edges are crisp and the centers appear dry. Cool on wire racks and enjoy.\n",
    "embedding_ingredients": "butter, packed dark brown sugar, vanilla extract, eggs, baking soda, pinch salt, whole wheat flour, rolled oats, cranberries, walnuts",
    "features": {
      "preparation_time": "medium",
      "prep_time": 10,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Stuffed Mushrooms Casino",
    "ingredients": [
      "24 large fresh mushrooms",
      "1/2 cup butter",
      "1 tablespoon all-purpose flour",
      "1/3 cup chopped green onions",
      "1/3 cup sherry",
      "1 (16 ounce) can minced clams, drained with juice reserved",
      "3 cloves garlic, peeled and minced",
      "1/2 cup seasoned bread crumbs",
      "ground black pepper to taste",
      "1 teaspoon Italian-style seasoning",
      "1/2 cup bacon bits",
      "1/3 cup grated Romano cheese",
      "1/2 cup butter, melted",
      "1 lemon - cut into wedges, for garnish"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking sheet.\nRemove stems from mushrooms. Reserve and chop approximately 1/2. Arrange mushroom caps in a single layer on the prepared baking sheet so that the edges of the caps touch one another. Set aside.\nIn a small saucepan over medium heat, melt 1/2 cup butter. Place reserved, chopped mushroom stems in the pan, and slowly cook and stir until soft. Stir in the flour to coat mushroom stems. Mix in green onions, sherry, minced clams and 1/2 their reserved juice (discard remainder), garlic, bread crumbs, pepper, Italian-style seasoning and bacon bits. Continue cooking approximately 3 minutes, until all ingredients are well mixed. Remove from heat and stir in Romano cheese. Allow mixture to cool approximately 5 minutes.\nFill the mushroom caps generously with the mixture. Drizzle with melted butter.\nBake in the preheated oven 20 to 25 minutes, until lightly browned. Serve with lemon wedges.\n",
    "embedding_ingredients": "large fresh mushrooms, butter, all-purpose flour, green onions, herry, can clams, drained with juice reserved, loves garlic, and, easoned bread crumbs, black pepper to taste, italian-style seasoning, bacon bits, romano cheese, butter, melted, lemon - cut into wedges, for garnish",
    "features": {
      "preparation_time": "medium",
      "prep_time": 33,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Garlic Pickled Eggs",
    "ingredients": [
      "12 eggs",
      "1 onion, sliced into rings",
      "1 cup distilled white vinegar",
      "1 cup water",
      "1/4 cup white sugar",
      "10 cloves garlic, peeled"
    ],
    "instructions": "Place eggs in a medium saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool and peel.\nPlace the eggs in a 1 quart jar with the onion rings.\nIn a medium saucepan, bring to a boil the vinegar, water, sugar and garlic. Remove from heat and allow to cool approximately 15 minutes.\nPour the vinegar mixture over the eggs and cover. Refrigerate 1 week before serving.\n",
    "embedding_ingredients": "eggs, onion, into rings, distilled white vinegar, water, white sugar, loves garlic,",
    "features": {
      "preparation_time": "medium",
      "prep_time": 27,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Spicy Vegetable Beef Soup",
    "ingredients": [
      "1 pound rump roast",
      "2 tablespoons vegetable oil",
      "1 onion, chopped",
      "2 cloves garlic, minced",
      "1 (14 ounce) can beef broth",
      "1 (14 ounce) can stewed tomatoes",
      "1 quart water",
      "1 (16 ounce) package frozen mixed vegetables, thawed",
      "4 mushrooms, sliced",
      "2 stalks celery, chopped",
      "1/2 teaspoon dried oregano",
      "1/2 teaspoon dried thyme",
      "1/2 teaspoon dried basil",
      "1/2 teaspoon dried parsley",
      "1/4 teaspoon ground cayenne pepper",
      "6 ounces rotelle pasta"
    ],
    "instructions": "Trim fat from roast and cut into 1 inch cubes. Place meat in a large pot over medium heat with oil, onion and garlic and cook, stirring, until meat is browned and onion is tender. Pour in broth, tomatoes and water. Stir in mixed vegetables, mushrooms and celery. Season with oregano, thyme, basil, parsley and cayenne. Bring to a boil, then reduce heat, cover and simmer 75 minutes.\nStir in pasta and cook 10 minutes more, until pasta is tender.\n",
    "embedding_ingredients": "rump roast, vegetable oil, onion,, loves garlic,, can beef broth, can stewed tomatoes, quart water, package frozen mixed vegetables, thawed, mushrooms,, stalks celery,, dried oregano, dried thyme, dried basil, dried parsley, cayenne pepper, rotelle pasta",
    "features": {
      "preparation_time": "long",
      "prep_time": 85,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Old-Fashioned Vegetable Soup",
    "ingredients": [
      "3 tablespoons butter",
      "1 onion, diced",
      "2 large carrots, diced",
      "3 stalks celery, diced",
      "1 (28 ounce) can whole peeled tomatoes, chopped, juice reserved",
      "1 teaspoon salt",
      "1/2 teaspoon ground black pepper",
      "1 teaspoon dried parsley",
      "3 tablespoons soy sauce",
      "1 tablespoon Worcestershire sauce",
      "1 teaspoon paprika",
      "2 quarts beef broth"
    ],
    "instructions": "In a large pot over medium heat, melt butter. Cook onion, carrots and celery until onion is translucent. Stir in tomatoes with their juice, salt, pepper, parsley, soy sauce, Worcestershire and paprika. Pour in beef broth. Bring to a boil, then reduce heat and simmer 30 minutes, until vegetables are tender and flavors are well blended.\n",
    "embedding_ingredients": "butter, onion,, large carrots,, stalks celery,, can whole tomatoes, , juice reserved, alt, black pepper, dried parsley, soy sauce, worcestershire sauce, paprika, quarts beef broth",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Gourmet Cheese Potatoes",
    "ingredients": [
      "10 pounds potatoes, quartered",
      "1/2 onion, grated",
      "2 (10.75 ounce) cans condensed Cheddar cheese soup",
      "1 1/2 cups milk",
      "2 1/2 cups sour cream",
      "1 pound processed cheese, cubed",
      "2 tablespoons butter, diced",
      "1/2 cup shredded Cheddar cheese"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and chop.\nPlace potatoes and onions in a 9x13 inch casserole dish.\nIn a medium saucepan combine soup, milk, sour cream and processed cheese; heat until cheese is melted. Pour over potatoes. Dot with butter and covered with shredded cheese.\nBake in preheated oven for 1 hour.\n",
    "embedding_ingredients": "potatoes, quartered, onion,, cans condensed cheddar cheese soup, milk, sour cream, processed cheese, cubed, butter,, hredded cheddar cheese",
    "features": {
      "preparation_time": "long",
      "prep_time": 75,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Lemon Chiffon Pudding",
    "ingredients": [
      "3 1/2 tablespoons all-purpose flour",
      "2/3 cup sugar",
      "2 tablespoons butter, softened",
      "3 tablespoons lemon juice",
      "2 egg yolks, beaten",
      "2/3 cup milk",
      "2 egg whites"
    ],
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, stir together the flour and sugar until well blended. Stir in butter until smooth. Gradually beat in the egg yolks, lemon juice and milk. In a clean glass or metal bowl, whip egg whites with an electric mixer until stiff but flexible peaks form. Fold egg whites into the lemon mixture. Transfer to a casserole dish.\nBake for 35 minutes in the preheated oven, or until set. Serve warm or chilled.\n",
    "embedding_ingredients": "all-purpose flour, ugar, butter, softened, lemon juice, egg yolks, beaten, milk, egg whites",
    "features": {
      "preparation_time": "medium",
      "prep_time": 35,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Chocolate Shell Sauce",
    "ingredients": [
      "3 tablespoons butter",
      "2/3 cup semisweet chocolate chips"
    ],
    "instructions": "Melt butter and chocolate in a small saucepan over medium heat, or in the microwave. Stirring frequently. Serve over ice cream.\n",
    "embedding_ingredients": "butter, emisweet chocolate chips",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Thai Hot and Sour Soup",
    "ingredients": [
      "3 cups chicken stock",
      "1 tablespoon tom yum paste",
      "1/2 clove garlic, finely chopped",
      "3 stalks lemon grass, chopped",
      "2 kaffir lime leaves",
      "2 skinless, boneless chicken breast halves - shredded",
      "4 ounces fresh mushrooms, thinly sliced",
      "1 tablespoon fish sauce",
      "1 tablespoon lime juice",
      "1 teaspoon chopped green chile pepper",
      "1 bunch fresh coriander, chopped",
      "1 sprig fresh basil, chopped"
    ],
    "instructions": "In a large saucepan, bring the chicken stock to a boil. Stir in the tom yum paste and garlic, and cook for about 2 minutes. Stir in the lemon grass and kaffir lime leaves. Place the chicken in the saucepan, and cook 5 minutes, or until no longer pink and juices run clear.\nMix in the mushrooms. Add the fish sauce, lime juice, and green chile pepper. Continue cooking until well blended. Remove from heat, and serve warm with the coriander and basil.\n",
    "embedding_ingredients": "chicken stock, tom yum paste, love garlic, finely, stalks lemon grass,, kaffir lime leaves, skinless, boneless chicken breast halves - shredded, fresh mushrooms, thinly, fish sauce, lime juice, green chile pepper, bunch fresh coriander,, sprig fresh basil,",
    "features": {
      "preparation_time": "medium",
      "prep_time": 7,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Lemon Thyme Chicken Tenders",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 clove garlic, minced",
      "6 sprigs fresh thyme, leaves stripped and chopped",
      "1 tablespoon lemon zest",
      "1/4 cup lemon juice",
      "salt and pepper to taste",
      "1 pound chicken breast tenders",
      "olive oil-flavored cooking spray"
    ],
    "instructions": "Combine the olive oil, garlic, chopped thyme, lemon zest, and lemon juice in a large mixing bowl. Season the chicken tenders with salt and pepper. Toss chicken with the olive oil mixture; allow to marinate for 5 minutes.\nSpray a non-stick skillet with cooking spray, and place over medium-high heat. Cook chicken tenders in the hot pan until lightly browned and cooked through, about 4 minutes per side.\n",
    "embedding_ingredients": "olive oil, love garlic,, sprigs fresh thyme, leaves stripped and, lemon zest, lemon juice, salt and pepper to taste, chicken breast tenders, olive oil-flavored cooking spray",
    "features": {
      "preparation_time": "medium",
      "prep_time": 9,
      "cuisine": "Mediterranean",
      "complexity": "medium"
    }
  },
  {
    "title": "S'More Bars II",
    "ingredients": [
      "1 1/2 cups butter, melted",
      "4 cups graham cracker crumbs",
      "6 (1.5 ounce) bars milk chocolate candy bars",
      "2 cups miniature marshmallows"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl, mix together the melted butter and graham cracker crumbs. Press half of the graham cracker mixture into the bottom of the prepared pan. In the microwave or in a metal bowl over a pan of simmering water, melt chocolate chips, stirring frequently until smooth. Remove from heat and spread over the graham cracker layer. For easier spreading, refrigerate the crust while the chocolate is melting. Make a layer of marshmallows over the chocolate and top with the remaining graham cracker crumbs.\nBake for 15 minutes in the preheated oven, cool and cut into squares.\n",
    "embedding_ingredients": "butter, melted, graham cracker crumbs, bars milk chocolate candy bars, miniature marshmallows",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Carne Con Chilies",
    "ingredients": [
      "4 large boneless pork chops, fat trimmed and reserved",
      "1/4 teaspoon ground black pepper, or to taste",
      "1/2 teaspoon garlic powder, or to taste",
      "1/2 teaspoon seasoning salt, or to taste",
      "1 lime, cut into 4 wedges",
      "10 tomatillos, husked and cut in half",
      "1 tomato, quartered",
      "2 jalapeno peppers, seeded and halved",
      "3 dried red chile peppers, chopped",
      "1 clove garlic",
      "1/2 teaspoon salt, or to taste"
    ],
    "instructions": "Slice pork chops into strips, and season with pepper, garlic powder and seasoning salt. Squeeze lime juice over pieces.\nHeat a skillet over medium heat. Add fat, and cook, stirring until pan is coated. Remove fat, and put the seasoned meat in the pan. Fry until browned, about 5 minutes.\nAt the same time, make the green sauce. Combine the tomatillos, tomato, jalapenos, and dried chilies in a saucepan. Bring to a boil, and cook until soft. Drain excess liquid, and transfer to a blender or food processor along with the garlic and salt. Blend until smooth.\nPour sauce over the meat in the pan, and simmer for 15 minutes to blend all of the flavors. Taste, and adjust salt and pepper if necessary.\n",
    "embedding_ingredients": "large boneless pork chops, fat trimmed and reserved, black pepper, or to taste, garlic powder, or to taste, easoning salt, or to taste, lime, cut into wedges, tomatillos, husked and cut in half, tomato, quartered, jalapeno peppers, seeded and halved, dried red chile peppers,, love garlic, alt, or to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Easter Basket Cake",
    "ingredients": [
      "1 (18.25 ounce) package white cake mix",
      "1 (16 ounce) can white frosting",
      "2 drops green food coloring",
      "1/2 teaspoon water",
      "2 cups flaked coconut",
      "1 (14 ounce) package candy-coated chocolate pieces"
    ],
    "instructions": "Prepare the cake mix and bake the cake in two 8 inch rounds according to package directions. Cool completely.\nCut a circle out of the center of one of the layers, leaving a ring that measures 1 1/2 inches from the outer to the inner edge. Place the uncut layer on a serving platter and frost the top. Place the ring layer on top of the frosted layer, and frost the sides and top of the basket. Decorate the sides and top by pressing candy pieces into the frosting.\nTo tint the coconut, combine water and green food coloring in a medium bowl. Stir in coconut with a fork until evenly tinted. Place green coconut grass in center of cake basket.\nTo make a handle, cut a piece of aluminum foil 8x16 inches. Fold in half lengthwise 4 times. Wrap with ribbon, securing the ends with tape. Insert ends of the handle into the cake top. Fill basket with Easter candy and goodies, if desired.\n",
    "embedding_ingredients": "package white cake mix, can white frosting, drops green food coloring, water, flaked coconut, package candy-coated chocolate pieces",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Quick Shrimp Scampi Pasta",
    "ingredients": [
      "8 ounces uncooked spaghetti",
      "1/2 cup butter",
      "2 cups dry white wine",
      "2 pounds large shrimp, peeled and deveined",
      "1 teaspoon dried basil"
    ],
    "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large saucepan, melt butter and add white wine. Over medium heat, add shrimp and basil. Cook until pink all over; about 3 to 5 minutes. Serve over pasta.\n",
    "embedding_ingredients": "uncooked spaghetti, butter, dry white wine, large shrimp, and deveined, dried basil",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "Italian",
      "complexity": "low"
    }
  },
  {
    "title": "Almond Buttercrunch Candy I",
    "ingredients": [
      "2 (11.5 ounce) packages milk chocolate chips, divided",
      "2 cups butter",
      "1 pound brown sugar",
      "1 cup blanched slivered almonds, divided"
    ],
    "instructions": "Preheat oven to 200 degrees F (95 degrees C). Grease a 14 x 18 inch cookie sheet.\nSprinkle one package of chocolate chips on prepared pan. Place in warm oven until chips melt, about 5 minutes. Remove from oven, and spread melted chocolate over bottom of pan; set aside.\nIn a large heavy saucepan over medium-high heat, combine butter and brown sugar. Stirring constantly, heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads. Immediately remove from heat. Stir in 3/4 cup slivered almonds and pour onto pan with melted chocolate; spread mixture evenly.\nSprinkle remaining package of chocolate chips over the almond layer. The heat from the almond layer will melt the chocolate chips; spread melted chocolate evenly. Sprinkle remaining 1/4 cup almonds over chocolate.\nCut into squares, or allow to harden in a solid sheet and break it apart like brittle. Cool completely before removing from pan.\n",
    "embedding_ingredients": "packages milk chocolate chips, divided, butter, brown sugar, blanched slivered almonds, divided",
    "features": {
      "preparation_time": "medium",
      "prep_time": 5,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "New York System Hot Wiener Sauce I",
    "ingredients": [
      "3 pounds ground beef",
      "2 teaspoons chili powder",
      "2 teaspoons dry mustard",
      "1/2 teaspoon ground allspice",
      "1/2 teaspoon ground nutmeg",
      "1/2 teaspoon onion salt",
      "1/2 teaspoon garlic salt",
      "1/2 teaspoon celery salt",
      "1/4 teaspoon minced fresh ginger root",
      "1 teaspoon ground cumin",
      "1/2 teaspoon Worcestershire sauce",
      "1 teaspoon soy sauce",
      "10 ounces ketchup"
    ],
    "instructions": "Place ground beef in a large, deep skillet. Cook over medium high heat until evenly brown; drain.\nMix the chili powder, dry mustard, allspice, nutmeg, onion salt, garlic salt, celery salt, ginger root, cumin, Worcestershire sauce, soy sauce and ketchup into the skillet. Simmer at least 1 hour, until a desirable consistency has been attained. Serve hot.\n",
    "embedding_ingredients": "beef, chili powder, dry mustard, allspice, nutmeg, onion salt, garlic salt, celery salt, fresh ginger root, cumin, worcestershire sauce, oy sauce, ketchup",
    "features": {
      "preparation_time": "medium",
      "prep_time": 60,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Quick and Easy Chicken and Tomato Pasta",
    "ingredients": [
      "1/2 (16 ounce) package angel hair pasta",
      "olive oil",
      "2 skinless, boneless chicken breast halves - chopped",
      "2 teaspoons garlic and herb seasoning blend",
      "1 (6 ounce) can sliced black olives, drained",
      "1 (8 ounce) can sliced mushrooms, drained",
      "2 (16 ounce) cans diced tomatoes",
      "freshly grated Parmesan cheese"
    ],
    "instructions": "Bring a large pot of lightly salted water to a boil. Boil pasta for 8 to 10 minutes, or until al dente. Drain.\nHeat olive oil in a large skillet over medium high heat. Sprinkle chicken with seasoned salt, and cook for 2 to 3 minutes. Stir in drained black olives and mushrooms. Continue cooking, stirring occasionally, until chicken is golden brown. Strain chicken juices from pan, and reduce heat to low. Stir in tomatoes, cover, and simmer for 15 minutes.\nToss the pasta and chicken mixture together, sprinkle with Parmesan cheese, and serve.\n",
    "embedding_ingredients": "package angel hair pasta, olive oil, skinless, boneless chicken breast halves -, garlic and herb seasoning blend, can black olives, drained, can mushrooms, drained, cans tomatoes, freshly parmesan cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 28,
      "cuisine": "Italian",
      "complexity": "medium"
    }
  },
  {
    "title": "Apple Radish BBQ Ribs",
    "ingredients": [
      "4 pounds pork spareribs",
      "2 quarts apple juice",
      "3 cups barbecue sauce",
      "1/2 cup prepared horseradish",
      "3 tablespoons Worcestershire sauce",
      "1 teaspoon garlic salt"
    ],
    "instructions": "Place ribs in a stock pot, and cover with apple juice. Bring to a boil, reduce heat, and simmer for 1 to 2 hours. Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together barbecue sauce, horseradish, Worcestershire sauce, and garlic salt. Stir in 3 tablespoons of the apple juice from the ribs.\nBrush underside of ribs with 1/3 of the sauce. Turn them over, and place in roasting pan. Brush tops with remaining sauce.\nBake in preheated oven for 25 to 35 minutes, brushing occasionally with sauce.\n",
    "embedding_ingredients": "pork spareribs, quarts apple juice, barbecue sauce, prepared horseradish, worcestershire sauce, garlic salt",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Squash with Tomato and Feta Cheese",
    "ingredients": [
      "2 cups peeled and cubed acorn squash",
      "2 eggs",
      "1/3 cup heavy cream",
      "2 green onions, chopped",
      "1/4 green bell pepper, diced",
      "1 cup dry bread stuffing mix",
      "1/4 cup grated Parmesan cheese",
      "1 teaspoon salt",
      "1/2 teaspoon cracked black peppercorns",
      "1 sprig fresh rosemary",
      "2 tablespoons crumbled feta cheese",
      "2 roma (plum) tomatoes, thinly sliced",
      "cracked black pepper to taste"
    ],
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a medium casserole dish.\nIn a steamer basket over boiling water, steam the squash 10 minutes, or until tender. Remove from heat, and mash with a fork.\nIn a medium bowl, blend the eggs and heavy cream. Mix in the squash, 3/4 of the green onions, green bell pepper, dry stuffing mix, and Parmesan cheese. Season with salt and pepper. Transfer to the prepared casserole dish. Press the rosemary sprig into the center of the mixture. Top with feta cheese, tomato slices, and remaining green onions. Season with pepper.\nBake 45 minutes in the preheated oven, until lightly browned. Discard rosemary sprig before serving.\n",
    "embedding_ingredients": "and cubed acorn squash, eggs, heavy cream, reen onions,, reen bell pepper,, dry bread stuffing mix, parmesan cheese, alt, cracked black peppercorns, sprig fresh rosemary, crumbled feta cheese, roma tomatoes, thinly, cracked black pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 55,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Butternut Squash Sweet Potato Soup",
    "ingredients": [
      "1/4 cup butter",
      "1 butternut squash - peeled, seeded, and cut into chunks",
      "1 sweet potato, peeled and cut into chunks",
      "1 carrot, peeled and chopped",
      "1 stalk celery, chopped",
      "1 sweet onion, chopped",
      "2 cloves garlic, minced, or more to taste",
      "4 cups chicken stock, or as needed",
      "3 small sweet bell peppers, chopped",
      "salt and ground black pepper to taste"
    ],
    "instructions": "Melt butter in a large pot over medium-high heat. Cook and stir butternut squash, sweet potato, carrot, celery, onion, and garlic in hot butter until lightly browned, about 5 minutes.\nPour chicken stock and sweet bell peppers into butternut squash mixture; bring to a boil. Reduce heat to low, cover, and simmer until squash and potato are tender, about 40 minutes.\nPour squash mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth.\nReturn pureed soup to pot and season with salt and black pepper.\n",
    "embedding_ingredients": "butter, butternut squash - , seeded, and cut into chunks, sweet potato, and cut into chunks, arrot, and, stalk celery,, sweet onion,, loves garlic, , or more to taste, chicken stock, or as needed, small sweet bell peppers,, salt and black pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Slow Simmer Beef Stew",
    "ingredients": [
      "2 pounds beef stew meat, cut into cubes",
      "1/2 cup all-purpose flour, or more as needed",
      "1/4 cup butter",
      "1/4 cup olive oil",
      "1 teaspoon seasoned salt",
      "1 onion, chopped",
      "8 cups beef broth, divided",
      "6 cups sliced carrots",
      "6 cups diced potatoes",
      "3 cups chopped celery",
      "2 tablespoons balsamic vinegar",
      "1 tablespoon Worcestershire sauce",
      "1 teaspoon dried parsley",
      "1 teaspoon dried basil",
      "1/2 teaspoon paprika",
      "1/2 teaspoon garlic powder"
    ],
    "instructions": "Combine beef stew meat and flour in a resealable plastic bag; seal bag and shake to coat beef.\nMelt butter with olive oil in a large pot over high heat; add beef and season with seasoned salt. Cook and stir beef until seared on all sides 5 to 7 minutes. Stir onion into the beef; cook and stir until the onion is browned, about 5 minutes more.\nPour enough of the beef broth into the pot to cover the bottom; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add remainder of the beef broth; bring to a simmer before adding carrots, potatoes, celery, balsamic vinegar, Worcestershire sauce, parsley, basil, paprika, and garlic powder.\nBring liquid to a boil, reduce heat to low, and cook stew at a simmer until the meat and vegetables are very tender, 3 to 4 hours.\n",
    "embedding_ingredients": "beef stew meat, cut into cubes, all-purpose flour, or more as needed, butter, olive oil, easoned salt, onion,, beef broth, divided, carrots, potatoes, celery, balsamic vinegar, worcestershire sauce, dried parsley, dried basil, paprika, garlic powder",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Mediterranean",
      "complexity": "high"
    }
  },
  {
    "title": "Southern Style Collard Greens",
    "ingredients": [
      "2 sweet onions, finely chopped",
      "2 smoked ham hocks",
      "4 cloves garlic, finely chopped",
      "3 (32 ounce) containers chicken broth",
      "3 (1 pound) packages collard greens, trimmed",
      "1/3 cup vinegar",
      "2 tablespoons white sugar",
      "1 1/2 teaspoons salt, or to taste",
      "3/4 teaspoon ground black pepper, or to taste"
    ],
    "instructions": "Combine onions, ham hocks, and garlic in a stockpot; add chicken broth. Cook mixture over medium heat until meat is falling off the bone, about 2 hours.\nStir collard greens, vinegar, sugar, salt, and pepper into the broth mixture; cook until greens have reached desired tenderness, about 2 more hours.\n",
    "embedding_ingredients": "sweet onions, finely, smoked ham hocks, loves garlic, finely, containers chicken broth, packages collard greens, trimmed, vinegar, white sugar, salt, or to taste, black pepper, or to taste",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Easy 7-Up® Biscuits",
    "ingredients": [
      "1/2 cup butter",
      "4 1/2 cups baking mix (such as Bisquick ®)",
      "1 cup lemon-lime soda (such as 7-Up®)",
      "1 cup sour cream"
    ],
    "instructions": "Preheat oven to 425 degrees F (220 degrees C). Put butter in a 9x13-inch baking dish and place dish in the preheating oven until butter is melted.\nMix baking mix, lemon-lime soda, and sour cream together in a bowl until dough holds together and is sticky. Turn dough onto a floured work surface and roll into 1-inch thick circle. Cut circles out of dough using a cookie cutter or the rim of a wine glass and place in the melted butter.\nBake in the preheated oven until biscuits are golden brown, 10 to 12 minutes. Remove dish from oven and let stand until biscuits have absorbed all the butter.\n",
    "embedding_ingredients": "butter, baking mix, lemon-lime soda, our cream",
    "features": {
      "preparation_time": "medium",
      "prep_time": 12,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Peanut Butter Blossoms",
    "ingredients": [
      "1 1/2 cups peanut butter",
      "1 cup shortening",
      "2/3 cup white sugar",
      "2/3 cup brown sugar",
      "1/4 cup milk",
      "2 eggs",
      "2 teaspoons vanilla extract",
      "3 cups flour",
      "2 teaspoons baking soda",
      "1 teaspoon salt",
      "1/4 cup white sugar, or as needed",
      "2 (12 ounce) bags milk chocolate candy kisses (such as Hershey's Kisses®), unwrapped"
    ],
    "instructions": "Beat peanut butter, shortening, 2/3 cup white sugar, brown sugar, milk, eggs, and vanilla extract together with an electric mixer in a large bowl until creamy and smooth.\nSift flour, baking soda, and salt together in a bowl. Gradually fold flour mixture into peanut butter mixture to form a smooth dough. Cover bowl with plastic wrap and refrigerate until chilled, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nPour 1/4 cup white sugar into a shallow bowl. Scoop dough into 1-inch balls, roll balls in sugar, and place 1 1/2 inches apart on baking sheets.\nBake cookies in the preheated oven for 6 minutes; rotate cookie sheets and continue baking for another 3 minutes. Press a chocolate kiss about halfway down in the center of each cookie. Bake for until chocolate begins to melt and lose form, another 2 to 3 minutes. Cool on wire racks until chocolate hardens, at least 3 hours.\n",
    "embedding_ingredients": "peanut butter, hortening, white sugar, brown sugar, milk, eggs, vanilla extract, flour, baking soda, alt, white sugar, or as needed, bags milk chocolate candy kisses , unwrapped",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Leftover Pizza Breakfast Casserole",
    "ingredients": [
      "cooking spray",
      "3 slices leftover pizza, cut into 3/4-inch squares",
      "4 eggs, beaten",
      "1 cup milk",
      "1 (8 ounce) package shredded mozzarella cheese",
      "1/3 cup chopped onion",
      "3 tablespoons butter, melted",
      "1 clove garlic, minced",
      "1 teaspoon dried oregano",
      "1/2 teaspoon salt",
      "1/4 cup grated Parmesan cheese, or to taste",
      "1/4 teaspoon red pepper flakes, or to taste"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x9-inch baking dish with cooking spray.\nArrange pizza squares in the prepared baking dish. Mix eggs, milk, mozzarella cheese, onion, butter, garlic, oregano, and salt together in a large bowl; pour over pizza pieces. Top with Parmesan cheese and red pepper flakes. Cover dish with aluminum foil.\nBake in the preheated oven for 45 minutes. Remove foil and continue baking until eggs are set and Parmesan cheese is melted, about 20 more minutes.\n",
    "embedding_ingredients": "cooking spray, slices leftover pizza, cut into -inch squares, eggs, beaten, milk, package shredded mozzarella cheese, onion, butter, melted, love garlic,, dried oregano, alt, parmesan cheese, or to taste, red pepper flakes, or to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Taco Bell® Seasoning Copycat",
    "ingredients": [
      "1 tablespoon dried onion flakes",
      "1 teaspoon all-purpose flour",
      "1 teaspoon beef bouillon granules",
      "1 teaspoon garlic salt",
      "1 teaspoon ground cumin",
      "1 teaspoon paprika",
      "1 teaspoon chili powder",
      "1/4 teaspoon cayenne pepper",
      "1/4 teaspoon white sugar"
    ],
    "instructions": "Whisk onion flakes, flour, beef bouillon, garlic salt, cumin, paprika, chili powder, cayenne pepper, and sugar together in a bowl.\n",
    "embedding_ingredients": "dried onion flakes, all-purpose flour, beef bouillon granules, garlic salt, cumin, paprika, chili powder, cayenne pepper, white sugar",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "Indian",
      "complexity": "medium"
    }
  },
  {
    "title": "Broccoli Cornbread with Cheese",
    "ingredients": [
      "1 cup cottage cheese",
      "3/4 cup butter, melted",
      "4 eggs",
      "2 (8.5 ounce) packages corn bread/muffin mix",
      "1 (10 ounce) package frozen chopped broccoli, thawed",
      "1 large onion, chopped",
      "1 1/2 cups shredded Cheddar cheese, divided"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nBeat cottage cheese, butter, and eggs in a large bowl. Stir corn bread mixes into butter mixture until just moistened. Fold in broccoli, onion, and 1 cup Cheddar cheese. Pour batter into prepared baking dish and sprinkle with remaining 1/2 cup Cheddar cheese.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Cool in the baking dish for 10 minutes before slicing and serving warm.\n",
    "embedding_ingredients": "cottage cheese, butter, melted, eggs, packages corn bread/muffin mix, package frozen broccoli, thawed, large onion,, shredded cheddar cheese, divided",
    "features": {
      "preparation_time": "medium",
      "prep_time": 50,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Cashew Chicken Stir Fry",
    "ingredients": [
      "4 skinless, boneless chicken breast halves, cut into bite-size pieces",
      "1 tablespoon Cajun seasoning blend (such as Tony Chachere's®), or to taste",
      "1 1/4 cups chicken broth",
      "1 tablespoon cornstarch",
      "4 teaspoons soy sauce, divided",
      "2 tablespoons olive oil, divided",
      "2 cups shredded cabbage",
      "25 sugar snap peas, chopped",
      "10 small spears fresh asparagus, trimmed and cut into bite-size pieces",
      "3 stalks celery, chopped",
      "1/2 red bell pepper, cut into thin strips",
      "2 green onions, chopped",
      "1 (8 ounce) can sliced bamboo shoots, drained",
      "1/2 cup cashews",
      "1 pinch paprika, or to taste (optional)"
    ],
    "instructions": "Sprinkle chicken pieces with Cajun seasoning.\nWhisk chicken broth, cornstarch, and 3 teaspoons soy sauce together in a bowl until completely blended.\nHeat 1 tablespoon olive oil in a deep frying pan or wok over high heat. Cook and stir chicken in hot oil until cooked through, 6 to 10 minutes. Remove chicken from pan and drain any accumulated liquids.\nHeat remaining 1 tablespoon olive oil in the frying pan or wok over high heat. Stir fry cabbage, snap peas, asparagus, celery, red bell pepper, green onions, and bamboo shoots for 1 minute. Stir in 1 teaspoon soy sauce. Continue cooking until vegetables are tender but still crisp, about 3 minutes.\nStir chicken into cabbage mixture. Pour chicken broth mixture over chicken mixture, reduce heat to medium, and simmer until sauce thickens, about 1 minute. Reduce heat to low; add cashews and cook until heated through, 1 minute. Sprinkle with paprika.\n",
    "embedding_ingredients": "skinless, boneless chicken breast halves, cut into bite-size pieces, cajun seasoning blend , or to taste, chicken broth, cornstarch, soy sauce, divided, olive oil, divided, shredded cabbage, sugar snap peas,, small spears fresh asparagus, trimmed and cut into bite-size pieces, stalks celery,, red bell pepper, cut into thin strips, reen onions,, can bamboo shoots, drained, cashews, pinch paprika, or to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 16,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Easy Lemon Pepper Chicken Wings",
    "ingredients": [
      "2 cups oil, or as needed",
      "2 tablespoons extra-virgin olive oil",
      "1 tablespoon lemon pepper seasoning (such as McCormick®)",
      "12 chicken wings"
    ],
    "instructions": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nStir olive oil and lemon pepper together in a bowl.\nFry the chicken wings in hot oil until no longer pink at the bone and the juices run clear, about 8 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nToss hot wings with olive oil mixture to coat.\n",
    "embedding_ingredients": "oil, or as needed, extra-virgin olive oil, lemon pepper seasoning, hicken wings",
    "features": {
      "preparation_time": "medium",
      "prep_time": 8,
      "cuisine": "Mediterranean",
      "complexity": "low"
    }
  },
  {
    "title": "Banana Nut Coconut Cake",
    "ingredients": [
      "Banana Nut Coconut Cake:",
      "1 1/2 cups white sugar",
      "1/2 cup butter, softened",
      "2 eggs",
      "3 ripe bananas, mashed",
      "2 cups all-purpose flour",
      "1 teaspoon baking soda",
      "1/4 cup buttermilk",
      "1 teaspoon vanilla extract",
      "1 cup chopped pecans",
      "1 cup shredded coconut",
      "Banana Nut Frosting:",
      "1/2 cup butter, softened",
      "4 cups confectioners' sugar",
      "1 ripe banana, mashed",
      "1 cup chopped pecans",
      "1 cup shredded coconut",
      "1 teaspoon vanilla extract"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round cake pans or one 9x13-inch pan.\nIn a medium bowl, cream together white sugar and 1/2 cup butter. Mix in eggs and 3 mashed bananas.\nSift together flour and baking soda in a separate bowl. Add to the creamed mixture alternately with buttermilk, mixing well after each addition. Blend in 1 teaspoon vanilla extract. Fold in 1 cup of pecans and 1 cup coconut. Pour batter into prepared pans.\nBake in the preheated oven until a tester inserted in the center comes out clean, about 45 minutes. Cool completely on wire racks.\nTo Make Frosting: Cream together 1/2 cup butter and confectioners' sugar until light and fluffy. Mix in 1 medium mashed banana, 1 cup pecans, 1 cup coconut and 1 teaspoon vanilla.\n",
    "embedding_ingredients": "banana nut coconut cake:, white sugar, butter, softened, eggs, ripe bananas, mashed, all-purpose flour, baking soda, buttermilk, vanilla extract, pecans, hredded coconut, banana nut frosting:, butter, softened, confectioners' sugar, ripe banana, mashed, pecans, hredded coconut, vanilla extract",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Porketta Roast",
    "ingredients": [
      "1 tablespoon dill seed",
      "1 tablespoon fennel seed",
      "1 teaspoon dried oregano",
      "1 teaspoon lemon pepper",
      "1/4 teaspoon onion powder",
      "1/4 teaspoon garlic powder",
      "4 pounds boneless pork roast"
    ],
    "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a small bowl, combine the dill seed, fennel seed, oregano, lemon pepper, onion powder and garlic powder. Mix well and apply to the roast. Place roast in a 10x15 inch roasting pan.\nBake at 325 degrees F (165 degrees C) for 1 to 1 1/2 hours, or until internal pork temperature reaches 145 degrees F (63 degrees C).\n",
    "embedding_ingredients": "dill seed, fennel seed, dried oregano, lemon pepper, onion powder, garlic powder, boneless pork roast",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Mediterranean",
      "complexity": "medium"
    }
  },
  {
    "title": "Stuffed Brie",
    "ingredients": [
      "3 tablespoons butter",
      "1 onion, chopped",
      "2 cups fresh sliced mushrooms",
      "1/2 cup dates, pitted and chopped",
      "1 (8 ounce) wheel Brie cheese"
    ],
    "instructions": "In a medium skillet over medium heat, melt butter and caramelize onions and mushrooms; add dates and warm mixture for about 2 minutes.\nSlice the Brie wheel in half down the center so that there is a top and a bottom; fill with the onion mixture. Replace the top of the Brie.\nMicrowave Brie for 1 to 3 minutes or until bubbly; serve.\n",
    "embedding_ingredients": "butter, onion,, fresh mushrooms, dates, pitted and, wheel brie cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 5,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Chicken Risotto",
    "ingredients": [
      "2 cups uncooked white rice",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "2 cups chicken broth",
      "1 cup fresh mushrooms, sliced",
      "2 tablespoons chopped green bell pepper",
      "3 tablespoons chopped fresh basil",
      "1 tablespoon dried minced onion",
      "1 teaspoon dried oregano",
      "3 cloves garlic, minced",
      "1/4 teaspoon ground black pepper",
      "1/4 cup grated Parmesan cheese",
      "4 chicken thighs",
      "3 tablespoons Italian-style dry bread crumbs",
      "2 tablespoons grated Parmesan cheese"
    ],
    "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a large bowl, combine the rice, mushroom soup, chicken broth, mushrooms, green bell pepper, basil, onion, oregano, garlic, ground black pepper and 1/4 cup cheese. Stir until all ingredients are well mixed.\nPour this mixture into a 9x13 inch baking dish. Place the chicken on top of the mixture and cover with foil. In a separate small bowl, combine the bread crumbs and remaining cheese and set aside.\nBake at 325 degrees F (165 degrees C) for 1 hour, remove from oven, uncover and sprinkle with the reserved bread crumb mixture. Return to oven and bake, uncovered, for 20 more minutes, or until golden brown.\n",
    "embedding_ingredients": "uncooked white rice, can condensed cream of mushroom soup, chicken broth, fresh mushrooms,, green bell pepper, fresh basil, dried onion, dried oregano, loves garlic,, black pepper, parmesan cheese, hicken thighs, italian-style dry bread crumbs, parmesan cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 60,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Baked Pretzels",
    "ingredients": [
      "1 cup beer",
      "1 tablespoon margarine",
      "2 tablespoons white sugar",
      "1 teaspoon salt",
      "3 cups all-purpose flour",
      "3/4 teaspoon active dry yeast",
      "1 egg",
      "1 tablespoon warm water (110 degrees F/45 degrees C)",
      "2 tablespoons kosher salt"
    ],
    "instructions": "Measure first 6 ingredients in order listed into baking pan. Select: Dough/Pasta Setting and press start.\nWhen the cycle is complete remove dough to a lightly floured surface. If necessary, knead in enough flour to make dough easy to handle. Roll into a 14X9 inch rectangle. With a sharp knife, cut into eighteen 14X1/2 inch strips. Gently pull each strip into a rope 16 inches long. To shape into pretzels: Curve ends of each rope to make a circle; cross ends at top. Twist ends once and lay over bottom of circle. Place on greased baking sheets. DO NOT LET RISE.\nCombine lightly beaten egg and 1tablespoon water; brush on pretzels. Sprinkle with kosher salt. Bake in a preheated 350 degrees F (175 degrees C) oven for 18-20 minutes or until done. Remove from sheets and let pretzels cool on wire rack. Enjoy!\n",
    "embedding_ingredients": "beer, margarine, white sugar, alt, all-purpose flour, active dry yeast, egg, warm water, kosher salt",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Coney Sauce",
    "ingredients": [
      "1/2 pound ground beef",
      "1/4 cup water",
      "1/4 cup chopped onion",
      "1 clove garlic, minced",
      "1 cup tomato sauce",
      "1/2 teaspoon chili powder",
      "1/2 teaspoon monosodium glutamate (MSG)",
      "1/2 teaspoon salt"
    ],
    "instructions": "In a medium skillet over medium high heat, saute the ground beef for 10 to 15 minutes, or until well browned. Break up with a fork until fine. Add the water, onion, garlic, tomato sauce, chili powder, monosodium glutamate and salt. Allow to simmer for 10 minutes, or until heated thoroughly.\n",
    "embedding_ingredients": "beef, water, onion, love garlic,, tomato sauce, chili powder, monosodium glutamate, alt",
    "features": {
      "preparation_time": "medium",
      "prep_time": 25,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "No Fuss Chicken",
    "ingredients": [
      "4 skinless, boneless chicken breasts",
      "1 cup mayonnaise",
      "2 tablespoons prepared mustard",
      "1/4 cup grated Parmesan cheese",
      "1 cup crushed cornflakes cereal"
    ],
    "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nRinse chicken and pat dry. In a small bowl mix together the mayonnaise, mustard and cheese. Brush mixture onto chicken pieces to coat; refrigerate any leftover mixture for dipping.\nPlace cereal crumbs in a shallow dish or bowl; roll chicken in crumbs to coat and place coated chicken in a lightly greased 9x13 inch baking dish.\nBake at 400 degrees F (200 degrees C) for 20 to 25 minutes or until chicken is cooked through and juices run clear.\n",
    "embedding_ingredients": "skinless, boneless chicken breasts, mayonnaise, prepared mustard, parmesan cheese, cornflakes cereal",
    "features": {
      "preparation_time": "medium",
      "prep_time": 25,
      "cuisine": "Italian",
      "complexity": "low"
    }
  },
  {
    "title": "Maple Walnut Muffins",
    "ingredients": [
      "2 cups all-purpose flour",
      "1 tablespoon baking powder",
      "1 teaspoon salt",
      "1/2 cup butter, softened",
      "1/2 cup packed brown sugar",
      "1/2 cup real maple syrup",
      "2 eggs",
      "3/4 cup milk",
      "1/2 cup chopped walnuts"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line muffin pan with paper baking cups.\nSift the flour, baking powder, and salt together and set aside.\nCream the butter and sugar together until light and fluffy. Stir in the maple syrup and the eggs and beat until well blended. Add the flour mixture alternately with the milk and beat until well blended. Stir in the walnuts. Spoon the batter into the muffin tins filling each about 3/4 full.\nBake at 375 degrees F (190 degrees C) for 20 minutes or until toothpick inserted in center comes out clean. Remove to wire rack to cool completely.\n",
    "embedding_ingredients": "all-purpose flour, baking powder, alt, butter, softened, packed brown sugar, real maple syrup, eggs, milk, walnuts",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Chinese Chicken Casserole Surprise",
    "ingredients": [
      "2 skinless, boneless chicken breasts - cooked and cubed",
      "1 cup chicken broth",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "1 (5 ounce) can evaporated milk",
      "1 cup sliced almonds",
      "1 (4.5 ounce) can sliced mushrooms, drained",
      "1 (8 ounce) can water chestnuts, drained and minced",
      "1 (5 ounce) can crispy chow mein noodles",
      "2/3 cup shredded Cheddar cheese",
      "1 cup diced celery (optional)"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a lightly greased 9x13 inch baking dish, combine the chicken, broth, soup, milk, almonds, mushroom pieces, water chestnuts, noodles, cheese and celery (if using). Mix well and make sure mixture is spread evenly in the dish.\nBake in preheated oven for 45 minutes.\n",
    "embedding_ingredients": "skinless, boneless chicken breasts - cooked and cubed, chicken broth, can condensed cream of mushroom soup, can evaporated milk, liced almonds, can mushrooms, drained, can water chestnuts, drained and, can crispy chow mein noodles, hredded cheddar cheese, celery",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "Asian",
      "complexity": "medium"
    }
  },
  {
    "title": "Best Cocktail Meatballs",
    "ingredients": [
      "1 pound lean ground beef",
      "2/3 cup evaporated milk",
      "2 (1 ounce) packages dry onion soup mix",
      "1/4 cup Worcestershire sauce",
      "1 cup ketchup",
      "1/2 cup packed brown sugar"
    ],
    "instructions": "Preheat oven to broil.\nIn a medium-sized mixing bowl, combine hamburger, milk, onion soup mix, and Worcestershire sauce. Roll the mixture into small balls. Arrange meatballs on a cookie sheet. Broil for 10 minutes, or until cooked through.\nIn a small bowl, mix ketchup and brown sugar. Transfer mixture to a slow cooker. Add the meatballs to the slow cooker.\nCook meatballs on high for approximately 30 minutes.\n",
    "embedding_ingredients": "lean beef, evaporated milk, packages dry onion soup mix, worcestershire sauce, ketchup, packed brown sugar",
    "features": {
      "preparation_time": "medium",
      "prep_time": 40,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Plum Pie",
    "ingredients": [
      "3 cups all-purpose flour",
      "3/4 cup white sugar",
      "2 1/2 teaspoons baking powder",
      "1/8 teaspoon salt",
      "2/3 cup butter",
      "2 eggs",
      "1 teaspoon vanilla extract",
      "3 tablespoons milk",
      "1/2 teaspoon lemon zest",
      "1/2 cup all-purpose flour",
      "1/4 cup packed brown sugar",
      "1/2 teaspoon ground cinnamon",
      "1/4 teaspoon salt",
      "1/3 cup chopped hazelnuts",
      "1 teaspoon lemon zest",
      "3 tablespoons butter",
      "5 cups plums, pitted and sliced",
      "1 cup white sugar",
      "1/4 cup all-purpose flour",
      "1 teaspoon ground cinnamon",
      "1/2 teaspoon ground nutmeg"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nTo Make Crust: In a large bowl combine 3 cups flour, 3/4 cups white sugar, baking powder, and 1/8 teaspoon salt. Mix thoroughly, then cut in 2/3 cup butter or margarine with a pastry blender, until pieces are the size of small peas. Stir in eggs, vanilla extract, milk and lemon zest. Mix just until all ingredients are combined. Allow dough to rest in refrigerator.\nTo Make Streusel Topping: In a medium bowl mix 1/2 cup flour, brown sugar, 1/2 teaspoon cinnamon, 1/4 teaspoon salt, chopped nuts, and grated lemon zest. Work in butter or margarine with fingers until all ingredients are well combined. Set aside.\nTo Make Fruit Filling: Place pitted and sliced fruit in a large bowl. In a small bowl, mix remaining sugar, flour, cinnamon, and nutmeg until thoroughly combined. Pour over fruit and stir gently until all fruit is evenly coated.\nRoll out pie crust and place in a 9 inch pie pan. Trim and flute edges, then pour in fruit filling. Evenly cover fruit with streusel topping and bake in preheated oven for 45 to 55 minutes. Serve warm, or at room temperature.\n",
    "embedding_ingredients": "all-purpose flour, white sugar, baking powder, alt, butter, eggs, vanilla extract, milk, lemon zest, all-purpose flour, packed brown sugar, cinnamon, alt, hazelnuts, lemon zest, butter, plums, pitted and, white sugar, all-purpose flour, cinnamon, nutmeg",
    "features": {
      "preparation_time": "medium",
      "prep_time": 55,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Valentine's Pie",
    "ingredients": [
      "1 (8 ounce) package cream cheese",
      "1 cup confectioners' sugar",
      "1 teaspoon vanilla extract",
      "1 (8 ounce) container frozen whipped topping, thawed",
      "1 (9 inch) prepared graham cracker crust",
      "1 (16 ounce) can cherry pie filling"
    ],
    "instructions": "In an electric mixer, beat the cream cheese and the powdered sugar until combined. Add vanilla and beat 2 minutes. Gently fold in whipped topping.\nTransfer mixture into the pie crust. Top the filling with the cherries. Refrigerate for at least one hour before serving.\n",
    "embedding_ingredients": "package cream cheese, confectioners' sugar, vanilla extract, container frozen whipped topping, thawed, prepared graham cracker crust, can cherry pie filling",
    "features": {
      "preparation_time": "medium",
      "prep_time": 2,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Banana Split Cake IV",
    "ingredients": [
      "2 cups graham cracker crumbs",
      "1/2 cup butter, melted",
      "1 (8 ounce) package cream cheese",
      "1/4 cup butter, softened",
      "3 cups confectioners' sugar",
      "4 bananas",
      "1 (20 ounce) can crushed pineapple, drained",
      "1 quart strawberries, stemmed and quartered",
      "1 1/2 cups sugar free strawberry glaze",
      "1 (12 ounce) container lite frozen whipped topping, thawed",
      "1 (10 ounce) jar maraschino cherries, drained and quartered"
    ],
    "instructions": "In a medium bowl, mix together the graham cracker crumbs and melted butter. Press into the bottom of a 9x13 inch baking pan. Chill to set.\nIn a large bowl, mix together the cream cheese, butter and confectioners' sugar until smooth and creamy. Spread over the chilled graham cracker crust. Arrange the sliced bananas over the cream cheese mixture. Then cover with the drained crushed pineapple. Place strawberries cut side down over the pineapple layer, then coat with the strawberry glaze. Spread the whipped topping over the strawberry layer, decorate with maraschino cherries and sprinkle with chopped nuts.\nRefrigerate at least 4 hours before serving.\n",
    "embedding_ingredients": "graham cracker crumbs, butter, melted, package cream cheese, butter, softened, confectioners' sugar, bananas, can pineapple, drained, quart strawberries, stemmed and quartered, sugar free strawberry glaze, container lite frozen whipped topping, thawed, jar maraschino cherries, drained and quartered",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Butterscotch Cake I",
    "ingredients": [
      "1 (18.25 ounce) package yellow cake mix",
      "2 eggs",
      "1 1/2 cups butterscotch pudding",
      "1 cup butterscotch chips",
      "3 tablespoons white sugar",
      "1/2 cup blanched slivered almonds"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 15 1/2 x 10 1/2 x 1 inch jelly roll pan.\nCombine the cake mix, eggs, and butterscotch pudding. Spread the batter into the prepared pan and sprinkle with the butterscotch chips, white sugar, and slivered almonds.\nBake at 350 degrees F (175 degrees C) for 20 minutes. Enjoy!\n",
    "embedding_ingredients": "package yellow cake mix, eggs, butterscotch pudding, butterscotch chips, white sugar, blanched slivered almonds",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Slow Cooker Escalloped Chicken",
    "ingredients": [
      "4 skinless, boneless chicken breast halves - boiled",
      "1 cup chopped onion",
      "1 cup butter",
      "13 cups white bread cubes, baked until slightly dry",
      "1 teaspoon poultry seasoning",
      "1 1/4 teaspoons salt",
      "1/2 teaspoon dried sage",
      "1/2 teaspoon ground black pepper",
      "2 1/2 cups reserved cooking liquid from chicken",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "1 cup chopped celery"
    ],
    "instructions": "FOR DRESSING: Combine the onion, butter or margarine, bread cubes, poultry seasoning, salt, sage, pepper, reserved cooking liquid, mushroom soup and celery. Mix well.\nIn a slow cooker, layer the cooked chicken and dressing mixture. Cook on low for 4 to 8 hours. Serve.\n",
    "embedding_ingredients": "skinless, boneless chicken breast halves - boiled, onion, butter, white bread cubes, baked until slightly dry, poultry seasoning, salt, dried sage, black pepper, reserved cooking liquid from chicken, can condensed cream of mushroom soup, celery",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Broccoli and Cheese Casserole",
    "ingredients": [
      "3 cups water",
      "1 (10 ounce) package yellow rice",
      "1 (16 ounce) package frozen chopped broccoli",
      "1 (16 ounce) jar process cheese sauce"
    ],
    "instructions": "In a saucepan bring water to a boil. Add rice, reduce heat, cover and simmer for 20 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nWhile the rice is cooking, place frozen broccoli in large skillet. Heat stove to low-medium and defrost broccoli When the broccoli is 90% defrosted add processed cheese sauce to the broccoli and let melt. When rice has completed cooking add broccoli-cheese mixture and rice to 9x13 baking dish and mix well.\nPlace casserole in the preheated 400 degrees F (200 degrees C) oven for 10 minutes; or until heated through.\n",
    "embedding_ingredients": "water, package yellow rice, package frozen broccoli, jar process cheese sauce",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Banana Split Cake I",
    "ingredients": [
      "2 cups graham cracker crumbs",
      "1/2 cup melted butter",
      "2 cups confectioners' sugar",
      "2 eggs",
      "1 cup butter, softened",
      "6 bananas, peeled and halved lengthwise",
      "1 (20 ounce) can crushed pineapple, drained",
      "1 quart fresh strawberries, halved",
      "1 (16 ounce) package frozen whipped topping, thawed",
      "1 cup chopped walnuts"
    ],
    "instructions": "Combine cracker crumbs and melted butter or margarine thoroughly and press into bottom of 9x12 inch baking pan. Chill in freezer for at least 15 minutes.\nIn the medium bowl of an electric mixer combine confectioners sugar, eggs, and softened butter or margarine; beat at medium speed for 20 minutes. (This step is important, so don't try to save time).\nSpread buttercream mixture evenly over chilled crust. Place bananas, cut side down, evenly on top of buttercream and spoon crushed pineapple evenly over top of bananas. Distribute strawberries over pineapple and spread the whipped topping evenly all over. Sprinkle with walnuts and refrigerate for at least 3 hours or overnight before serving.\n",
    "embedding_ingredients": "graham cracker crumbs, melted butter, confectioners' sugar, eggs, butter, softened, bananas, and halved lengthwise, can pineapple, drained, quart fresh strawberries, halved, package frozen whipped topping, thawed, walnuts",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Golden Lasagna",
    "ingredients": [
      "6 lasagna noodles",
      "1/4 cup chopped onion",
      "1 (4.5 ounce) can sliced mushrooms, drained",
      "3 tablespoons chicken broth",
      "1 (10.75 ounce) can condensed cream of chicken soup",
      "1/3 cup milk",
      "1/2 teaspoon dried basil",
      "2 cups diced chicken breast meat",
      "1 pound ricotta cheese",
      "1 1/2 cups shredded Cheddar cheese",
      "1/8 cup grated Parmesan cheese"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Add noodles and cook for 8 to 10 minutes or until al dente; drain.\nIn a small saucepan, saute onion and mushrooms in chicken broth. Remove from heat. Stir in soup, milk and basil. Mix well. Set aside.\nIn a lightly greased 9x13 inch baking dish, arrange 3 cooked lasagna noodles. Layer as follows: 1/2 the chicken, 1/2 the ricotta cheese, 1/2 the Cheddar cheese, 1/2 the Parmesan cheese and 1/2 the mushroom/soup mixture. Add the other 3 lasagna noodles and repeat layers. Bake uncovered in the preheated oven for approximately 50 minutes.\n",
    "embedding_ingredients": "lasagna noodles, onion, can mushrooms, drained, chicken broth, can condensed cream of chicken soup, milk, dried basil, chicken breast meat, ricotta cheese, shredded cheddar cheese, parmesan cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 60,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Mystery Chocolate Cake",
    "ingredients": [
      "1 1/2 cups well-drained, mashed, cooked beets",
      "1/2 teaspoon vanilla extract",
      "1 1/2 cups white sugar",
      "1 cup vegetable oil",
      "3 eggs",
      "1 3/4 cups all-purpose flour",
      "1 1/2 teaspoons baking soda",
      "1/4 teaspoon salt",
      "6 tablespoons unsweetened cocoa powder"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9 x 13 inch pan.\nIn a large bowl, combine beets, eggs, vanilla, oil, and sugar. Mix with an electric mixer on low speed until well combined.\nIn a separate bowl, mix together flour, soda, salt, and cocoa. Add to the creamed mixture, beating together well. Pour batter into prepared pan.\nBake for 25 to 30 minutes until done. Cool and frost with your favorite icing.\n",
    "embedding_ingredients": "well-drained, mashed, cooked beets, vanilla extract, white sugar, vegetable oil, eggs, all-purpose flour, baking soda, alt, unsweetened cocoa powder",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Fresh Tomato Sauce",
    "ingredients": [
      "1/4 cup olive oil",
      "6 tomatoes, chopped",
      "3 onions, minced",
      "2 green bell peppers, minced",
      "4 cloves garlic, minced",
      "3 tablespoons white wine",
      "salt and pepper to taste"
    ],
    "instructions": "In a large saucepan, heat oil over medium heat; add tomatoes, onions, green bell peppers, garlic, white wine and salt and pepper to taste.\nMix ingredients well; cover and simmer for 30 minutes. Serve.\n",
    "embedding_ingredients": "olive oil, tomatoes,, onions,, reen bell peppers,, loves garlic,, white wine, salt and pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Mediterranean",
      "complexity": "medium"
    }
  },
  {
    "title": "Romesco Sauce",
    "ingredients": [
      "6 roma (plum) tomatoes, halved",
      "1 large red bell pepper, quartered",
      "12 cloves garlic",
      "2/3 cup olive oil",
      "kosher salt to taste",
      "1 slice bread",
      "1/2 cup toasted whole almonds",
      "1/2 cup red wine vinegar",
      "1/2 teaspoon Spanish paprika",
      "1 pinch crushed red pepper flakes, or to taste"
    ],
    "instructions": "Preheat an oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil.\nPlace the tomatoes, bell pepper, and garlic cloves onto the prepared baking sheet. Brush the vegetables with some of the olive oil, then sprinkle with kosher salt. Bake in the preheated oven until the garlic has turned golden brown, 15 to 20 minutes. Remove from the oven, and allow to cool for 10 minutes. While the vegetables are cooling, bake the bread slice on one of the oven racks until golden brown. Remove and allow to cool.\nScrape the vegetables and any juices from the pan into a food processor or blender. Break the bread into pieces, and add to the food processor along with the toasted almonds, vinegar, paprika, and red pepper flakes. Puree until finely ground, then drizzle in the remaining olive oil with the machine running. Season to taste with additional salt if necessary.\n",
    "embedding_ingredients": "roma tomatoes, halved, large red bell pepper, quartered, loves garlic, olive oil, kosher salt to taste, slice bread, toasted whole almonds, red wine vinegar, panish paprika, pinch red pepper flakes, or to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Mediterranean",
      "complexity": "medium"
    }
  },
  {
    "title": "Cauliflower Side Dish",
    "ingredients": [
      "1 head cauliflower, quartered",
      "1 tablespoon butter",
      "1 cup minced onion",
      "3 tablespoons butter",
      "1/2 cup Italian-seasoned dry bread crumbs",
      "salt and black pepper to taste"
    ],
    "instructions": "Place the cauliflower into a large pot and cover with water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until fork-tender, 5 to 7 minutes. Drain and allow to steam dry for a minute or two; chop into bite-size pieces.\nMelt 1 tablespoon butter in a skillet over medium-high heat. Cook the onion in the butter until the onion is browned, about 5 minutes. Add 3 tablespoons of butter and cook until the butter is melted. Stir in the bread crumbs and cook until the mixture bubbles. Mix the cauliflower into the skillet and cook until the cauliflower is warm, 3 to 5 minutes. Season with salt and black pepper; serve hot.\n",
    "embedding_ingredients": "head cauliflower, quartered, butter, onion, butter, italian-seasoned dry bread crumbs, salt and black pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 17,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Roasted Beet and Potato Soup",
    "ingredients": [
      "2 cups diced potatoes",
      "2 cups diced peeled beets",
      "olive oil, divided",
      "salt and ground black pepper to taste",
      "1 stalk celery, diced",
      "1 onion, diced",
      "1 clove garlic, minced",
      "4 cups chicken broth",
      "1/2 teaspoon dried thyme",
      "1 bay leaf",
      "1 1/2 cups whole milk",
      "1 tablespoon lemon juice"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C). Place the potatoes and beets into a baking dish, and drizzle with 1 tablespoon olive oil; season with salt and black pepper.\nRoast in the preheated oven until tender, about 1 hour; allow to cool.\nHeat 2 tablespoons of olive oil in a large soup pot over medium heat, and stir in the celery, onion, and garlic. Cook, stirring often, until the onion is translucent, about 5 minutes. Mix in the cooked vegetables, chicken broth, thyme, and bay leaf, bring to a boil, and reduce heat. Simmer until the celery is very tender, about 45 minutes.\nRemove from heat, and discard the bay leaf. Puree the mixture in the pot with an immersion blender until very well blended; stir in the milk and lemon juice to serve.\n",
    "embedding_ingredients": "potatoes, beets, olive oil, divided, salt and black pepper to taste, stalk celery,, onion,, love garlic,, chicken broth, dried thyme, bay leaf, whole milk, lemon juice",
    "features": {
      "preparation_time": "long",
      "prep_time": 110,
      "cuisine": "Mediterranean",
      "complexity": "high"
    }
  },
  {
    "title": "Mexican Fiesta Pasta Salad",
    "ingredients": [
      "1 (16 ounce) package dried rotini pasta",
      "1 1/2 cups medium chunky salsa",
      "1 cup mayonnaise",
      "1/2 cup sour cream",
      "1 (16 ounce) can black beans, rinsed and drained",
      "1 (11 ounce) can Mexican-style corn with red and green peppers, drained",
      "1/2 cup chopped red bell pepper",
      "2 green onions, sliced thin",
      "1 (4.25 ounce) can sliced black olives, drained",
      "1/2 teaspoon garlic powder",
      "1/2 teaspoon ground cumin, or to taste",
      "1/2 teaspoon dried cilantro, or to taste",
      "1 teaspoon salt",
      "ground black pepper to taste"
    ],
    "instructions": "Bring a large pot of lightly salted water to a rolling boil; cook the rotini in the boiling water until the pasta is cooked through yet firm to the bite, about 8 minutes. Drain. Rinse under cold running water until completely cooled; drain thoroughly.\nWhisk the salsa, mayonnaise, sour cream, black beans, Mexican-style corn, red bell pepper, green onions, black olives, garlic powder, cumin, cilantro, salt, and pepper together in a large bowl; add the cooled pasta and stir to coat evenly. Cover the bowl with plastic wrap and refrigerate 2 hours to overnight before serving.\n",
    "embedding_ingredients": "package dried rotini pasta, medium chunky salsa, mayonnaise, our cream, can black beans, rinsed and drained, can mexican-style corn with red and green peppers, drained, red bell pepper, reen onions, thin, can black olives, drained, garlic powder, cumin, or to taste, dried cilantro, or to taste, alt, black pepper to taste",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Daddy's Whisker Soup",
    "ingredients": [
      "12 potatoes, peeled and diced",
      "1 yellow onion, diced",
      "1 tablespoon salt",
      "1 tablespoon pepper",
      "5 cups milk",
      "1 (1 pound) loaf processed cheese food (such as Velveeta®), cubed",
      "1 teaspoon dried dill weed",
      "salt and pepper to taste"
    ],
    "instructions": "Combine potatoes, onion, 1 tablespoon salt, and 1 tablespoon pepper in a large soup pot. Cover with water; bring to a boil over high heat. Cook until the potatoes are very tender, 10 to 15 minutes. Drain potatoes, and return to pot.\nStir the milk and cubed cheese into the potatoes. Season with dill, salt, and pepper. Cook and stir over low heat until the cheese is melted, about 10 minutes.\n",
    "embedding_ingredients": "potatoes, and, yellow onion,, alt, pepper, milk, loaf processed cheese food , cubed, dried dill weed, salt and pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 25,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Maritime Blueberry Buckle",
    "ingredients": [
      "1 cup all-purpose flour",
      "1 1/2 teaspoons baking powder",
      "1/4 teaspoon salt",
      "1/4 cup shortening",
      "1/2 cup white sugar",
      "1 egg",
      "1/3 cup milk",
      "2 cups fresh blueberries",
      "1/2 cup white sugar",
      "1/3 cup all-purpose flour",
      "1/2 teaspoon ground cinnamon",
      "1/4 cup softened butter"
    ],
    "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch square baking dish. Whisk 1 cup flour, the baking powder, and salt together in a mixing bowl.\nBeat the shortening and 1/2 cup sugar with an electric mixer in a large bowl until light and fluffy. Beat in the egg. Pour in the flour mixture alternately with the milk, mixing until just incorporated. Pour the batter into prepared pan, then sprinkle evenly with blueberries. Combine 1/2 cup sugar, 1/3 cup flour, cinnamon, and butter in a bowl with a fork until crumbly and evenly mixed. Sprinkle evenly over the blueberries.\nBake in the preheated oven until a toothpick inserted into the buckle comes out clean, about 35 minutes. Allow to cool before serving warm.\n",
    "embedding_ingredients": "all-purpose flour, baking powder, alt, hortening, white sugar, egg, milk, fresh blueberries, white sugar, all-purpose flour, cinnamon, oftened butter",
    "features": {
      "preparation_time": "medium",
      "prep_time": 35,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Mom's Hearty Beef Stew with Dumplings",
    "ingredients": [
      "1 tablespoon extra-virgin olive oil",
      "1 onion, coarsely chopped",
      "2 pounds cubed beef stew meat",
      "2 teaspoons steak seasoning (such as Montreal Steak Seasoning®), divided",
      "2 stalks celery, each cut into 4 pieces",
      "2 cups water, or to cover",
      "4 (.85 ounce) packages dry brown gravy mix",
      "4 cups water",
      "1 small turnip, peeled and quartered",
      "4 carrots, peeled and quartered",
      "7 potatoes, peeled and quartered",
      "1 1/2 cups all-purpose flour",
      "2 teaspoons baking powder",
      "3/4 teaspoon salt",
      "3 tablespoons shortening",
      "3/4 cup milk"
    ],
    "instructions": "Heat the olive oil in a large heavy pot or Dutch oven over medium-high heat until the oil is shimmering, and place the onion and beef into the hot oil. Sprinkle with 1 teaspoon of the steak seasoning, stir the meat and onions well, and sprinkle with 1 more teaspoon of seasoning. Add the celery, and cook and stir until the meat is browned, about 10 minutes.\nPour in 2 cups of water to just cover the meat, onion, and celery, bring to a boil, and stir and scrape the browned bits of flavor from the bottom of the pan. Cover, reduce heat, and simmer until the beef is very tender, about 2 hours. Remove the meat and celery pieces from the pan, set the meat aside, and discard the celery.\nIn a bowl, whisk together the gravy mix with 4 cups of water. Add the mixture to the juices in the pot, bring to a boil, and stir the meat back into the gravy mixture. Stir in the turnip and carrots, cover, and simmer for 20 minutes. Stir in the potatoes, cover, and simmer an additional 20 minutes.\nTo make dumplings, mix the flour, baking powder, and salt in a bowl. Cut the shortening into the flour mixture with a pastry cutter or two knives until the mixture looks crumbly. Pour in the milk, and lightly stir the mixture just until it combines to form a dough.\nRemove 2 cups of gravy from the pot, and reserve. Drop the dumplings by heaping tablespoon onto the meat and vegetables in the pot, cover, and simmer for 20 minutes. Do not peek until the time is up. Pour the reserved gravy back over the dumplings, stir lightly, and serve.\n",
    "embedding_ingredients": "extra-virgin olive oil, onion, coarsely, cubed beef stew meat, steak seasoning , divided, stalks celery, each cut into pieces, water, or to cover, packages dry brown gravy mix, water, small turnip, and quartered, arrots, and quartered, potatoes, and quartered, all-purpose flour, baking powder, alt, shortening, milk",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Mediterranean",
      "complexity": "high"
    }
  },
  {
    "title": "Creamy White Chicken and Artichoke Lasagna",
    "ingredients": [
      "2 cups boneless skinless chicken breast, cooked and shredded",
      "1 (14 ounce) can artichoke hearts, chopped",
      "1/2 cup chopped sun-dried tomatoes",
      "1 (8 ounce) package KRAFT Shredded Mozzarella Cheese with a Touch of PHILADELPHIA, divided",
      "1/2 cup KRAFT Grated Parmesan Cheese",
      "2 (8 ounce) packages PHILADELPHIA Cream Cheese, softened",
      "1 cup milk",
      "1/2 teaspoon garlic powder",
      "1/4 cup basil, chopped",
      "12 lasagna noodles, cooked"
    ],
    "instructions": "Heat oven to 350 degrees F.\nCombine chicken, artichokes, tomatoes, 1 cup mozzarella and Parmesan. Beat cream cheese, milk, and garlic powder with mixer until well blended; stir in 2 tablespoons basil. Mix half with the chicken mixture.\nSpread half of the remaining cream cheese sauce onto bottom of 13x9-inch baking dish; cover with 3 noodles and 1/3 of the chicken mixture. Repeat layers of noodles and chicken mixture twice. Top with remaining cheese sauce and mozzarella; cover.\nBake 25 min. or until heated through. Sprinkle with remaining basil. Let stand 5 min. before cutting to serve.\n",
    "embedding_ingredients": "boneless skinless chicken breast, cooked and shredded, can artichoke hearts,, sun-dried tomatoes, package kraft shredded mozzarella cheese with a touch of philadelphia, divided, kraft parmesan cheese, packages philadelphia cream cheese, softened, milk, garlic powder, basil,, lasagna noodles, cooked",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Italian",
      "complexity": "medium"
    }
  },
  {
    "title": "Blueberry Orange Bran Muffin",
    "ingredients": [
      "1/2 cup oat bran",
      "1 cup wheat bran",
      "1/2 cup sour cream",
      "1/2 cup milk",
      "1 cup all-purpose flour",
      "1 teaspoon baking powder",
      "1 teaspoon baking soda",
      "2/3 cup brown sugar",
      "1/2 teaspoon salt",
      "1 cup fresh blueberries",
      "1/3 cup vegetable oil",
      "1 orange, juiced and zested",
      "1 egg",
      "1 teaspoon vanilla extract"
    ],
    "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease 12 muffin cups, or line with paper muffin liners.\nCombine the oat bran and wheat bran in a large bowl. Stir in sour cream and milk. Allow mixture to stand for 10 minutes. Combine flour, baking powder, baking soda, brown sugar, and salt in a separate bowl. Gently stir blueberries into the flour mixture, carefully coating all the blueberries with flour. Stir vegetable oil, orange juice and zest, egg, and vanilla extract into the bran mixture. Combine flour mixture with the wet ingredients until just blended. Drop batter into lined muffin cups.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 15 to 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
    "embedding_ingredients": "oat bran, wheat bran, our cream, milk, all-purpose flour, baking powder, baking soda, brown sugar, alt, fresh blueberries, vegetable oil, orange, juiced and zested, egg, vanilla extract",
    "features": {
      "preparation_time": "medium",
      "prep_time": 40,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Steamed Tuna Fish",
    "ingredients": [
      "2 pounds fresh tuna steaks",
      "1/2 cup soy sauce",
      "1/2 cup sherry",
      "1/2 cup vegetable oil",
      "1 bunch green onions, finely chopped",
      "1/2 cup minced fresh ginger root",
      "3 cloves garlic, minced",
      "1 teaspoon salt",
      "1 teaspoon ground black pepper"
    ],
    "instructions": "Place tuna steaks in a steamer over 1 inch of boiling water, and cover. Cook 6 to 8 minutes, or until fish flakes easily with a fork.\nMeanwhile, in a medium saucepan, combine soy sauce, sherry, vegetable oil, green onions, ginger, garlic, salt, and black pepper. Bring to a boil.\nRemove tuna steaks from steamer, and place in a serving dish. Pour sauce over tuna steaks, and serve immediately.\n",
    "embedding_ingredients": "fresh tuna steaks, oy sauce, herry, vegetable oil, bunch green onions, finely, fresh ginger root, loves garlic,, alt, black pepper",
    "features": {
      "preparation_time": "medium",
      "prep_time": 8,
      "cuisine": "Asian",
      "complexity": "medium"
    }
  },
  {
    "title": "Mediterranean Lamb and Lentil Stew",
    "ingredients": [
      "1 tablespoon olive oil",
      "1 1/2 pounds lamb shoulder arm chops, cubed, round bones reserved",
      "1 teaspoon salt",
      "1/2 teaspoon ground black pepper",
      "1 onion, chopped",
      "4 cloves garlic, minced",
      "1 cup lentils, picked over and rinsed",
      "2 cups chicken broth, or more as needed",
      "1 (14 ounce) can diced tomatoes",
      "3 carrots, peeled and sliced",
      "1/2 teaspoon dried thyme",
      "1/2 teaspoon dried sage",
      "1/2 teaspoon dried basil",
      "2 cups coarsely chopped fresh spinach",
      "1 lemon, juiced and zested",
      "1/2 cup ricotta salata cheese, crumbled"
    ],
    "instructions": "Heat oil in a heavy pot over medium-high heat. Add the lamb cubes and bones and brown on all sides, about 3 minutes. Sprinkle with salt and pepper. Add onion and garlic and continue cooking about 2 minutes, stirring frequently.\nStir in the lentils, 2 cups of the chicken broth, tomatoes, carrots and the thyme, sage and basil. Bring to a boil, reduce the heat to low and simmer, covered, until the lentils are tender but not quite done, stirring occasionally. Depending on the type and freshness of the lentils, this will take from 15 to 30 minutes. If the stew seems dry, add more broth (up to one cup additional). Discard the lamb bones.\nAdd the spinach and cook 5 minutes more. Stir in the lemon zest and juice. Garnish individual servings with some of the crumbled cheese.\n",
    "embedding_ingredients": "olive oil, lamb shoulder arm chops, cubed, round bones reserved, alt, black pepper, onion,, loves garlic,, lentils, picked over and rinsed, chicken broth, or more as needed, can tomatoes, arrots, and, dried thyme, dried sage, dried basil, coarsely fresh spinach, lemon, juiced and zested, ricotta salata cheese, crumbled",
    "features": {
      "preparation_time": "medium",
      "prep_time": 40,
      "cuisine": "Mediterranean",
      "complexity": "high"
    }
  },
  {
    "title": "Butterscotch Fudge",
    "ingredients": [
      "1 (14 ounce) can sweetened condensed milk",
      "1 (11 ounce) package butterscotch chips",
      "1/2 (11 ounce) package white chocolate chips",
      "1 teaspoon butter flavored extract",
      "1 teaspoon rum flavored extract"
    ],
    "instructions": "In a medium sauce pan over medium heat, combine condensed milk, butterscotch chips and white chocolate chips. Stir constantly until melted and smooth. Remove from heat and stir in butter and rum flavorings. Pour into a 9x13 inch dish, cover and refrigerate until firm, 30 minutes. Cut and serve.\n",
    "embedding_ingredients": "can sweetened condensed milk, package butterscotch chips, package white chocolate chips, butter flavored extract, rum flavored extract",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Masala Chai Brownies",
    "ingredients": [
      "2 tablespoons unsweetened cocoa powder",
      "1/3 cup unsweetened shredded coconut",
      "1 cup all-purpose flour",
      "1 cup white sugar",
      "1/4 cup unsweetened cocoa powder",
      "1/2 teaspoon baking powder",
      "1/2 teaspoon salt",
      "1/2 cup very strongly brewed masala chai",
      "1/2 cup canola oil",
      "1/2 teaspoon vanilla extract"
    ],
    "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Spray an 8x8 inch baking pan with cooking spray, and dust lightly with the 2 tablespoons cocoa powder. Place the coconut in the jar of a blender, and pulse to mince; set aside.\nWhisk together the flour, sugar, 1/4 cup cocoa powder, baking powder, and salt. Stir in the brewed chai, canola oil, and vanilla extract, just until all ingredients are moistened. Fold in the coconut. Spread the batter in the prepared pan.\nBake in the preheated oven until the top is no longer shiny, about 20 minutes. Allow to cool for 1 hour before cutting.\n",
    "embedding_ingredients": "unsweetened cocoa powder, unsweetened shredded coconut, all-purpose flour, white sugar, unsweetened cocoa powder, baking powder, alt, very strongly brewed masala chai, canola oil, vanilla extract",
    "features": {
      "preparation_time": "long",
      "prep_time": 80,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Fresh Strawberry-Oatmeal Cookies",
    "ingredients": [
      "2 cups finely chopped fresh strawberries",
      "1/4 cup white sugar",
      "1 1/2 cups all-purpose flour",
      "1 teaspoon baking soda",
      "1 teaspoon ground cinnamon",
      "1 cup regular rolled oats",
      "1/2 cup butter, softened",
      "3/4 cup packed brown sugar",
      "1/4 cup white sugar",
      "1 egg",
      "1/4 cup milk",
      "1 teaspoon vanilla extract"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine the strawberries with 1/4 cup sugar in a medium bowl. Toss gently to blend, and set aside.\nCombine the flour, baking soda, and cinnamon in a large bowl. Stir in the rolled oats and blend evenly; set aside.\nBeat the butter, brown sugar, and white sugar in the large mixing bowl of an electric mixer at medium speed until fluffy. Add the egg, milk, and vanilla, and continue beating until smooth. Stir in the flour mixture, and mix well to blend. Combine the strawberries with the flour mixture, and stir to blend. Drop by teaspoonfuls onto ungreased baking sheets.\nBake in preheated oven until slightly brown, about 8 minutes. Cool on baking sheets. Store in an airtight container.\n",
    "embedding_ingredients": "finely fresh strawberries, white sugar, all-purpose flour, baking soda, cinnamon, regular rolled oats, butter, softened, packed brown sugar, white sugar, egg, milk, vanilla extract",
    "features": {
      "preparation_time": "medium",
      "prep_time": 8,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Valentine Night Strawberries",
    "ingredients": [
      "20 fresh strawberries",
      "1 (3 ounce) package cream cheese, softened",
      "2 tablespoons chopped walnuts",
      "1 1/2 tablespoons confectioners' sugar"
    ],
    "instructions": "Dice two strawberries and set aside. Cut the stems off of each of the remaining strawberries, forming a base for strawberries to stand on. Starting at the pointed ends and cutting most of the way, but not completely through the stem end, slice each strawberry into four wedges.\nBeat the cream cheese until fluffy; stir in the diced strawberries, walnuts, and powdered sugar. Spoon or pipe about a teaspoon of mix into each strawberry.\n",
    "embedding_ingredients": "fresh strawberries, package cream cheese, softened, walnuts, confectioners' sugar",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Easy Indian-Style Chicken",
    "ingredients": [
      "2 tablespoons vegetable oil",
      "1 teaspoon cumin seed",
      "1 onion, finely chopped",
      "1/4 cup tomato paste",
      "1/4 cup water",
      "1 pound skinless, boneless chicken breast halves - cubed",
      "1/2 (14 ounce) can coconut milk",
      "1/2 teaspoon brown sugar",
      "1/2 teaspoon hot chile paste (optional)",
      "1 pinch cayenne pepper (optional)",
      "3/4 teaspoon ground turmeric",
      "salt and pepper to taste",
      "1/2 cup chopped cilantro"
    ],
    "instructions": "Heat the vegetable oil in a large skillet over medium heat. Add cumin seeds, and fry for a few minutes until they become fragrant and begin to pop. Stir in chopped onion, and cook until the onion has softened and turned translucent, 3 to 4 minutes.\nStir together tomato paste and water, and pour into skillet. Stir in chicken, and cook until it has firmed and turned white, about 5 minutes. Add coconut milk, brown sugar, chile paste, cayenne pepper, turmeric, salt, and pepper.\nBring mixture to a simmer, then reduce heat to medium-low, cover, and continue to simmer until the chicken is tender and no longer pink in the center, about 15 minutes. Sprinkle with chopped cilantro before serving.\n",
    "embedding_ingredients": "vegetable oil, cumin seed, onion, finely, tomato paste, water, kinless, boneless chicken breast halves - cubed, can coconut milk, brown sugar, hot chile paste, pinch cayenne pepper, turmeric, salt and pepper to taste, cilantro",
    "features": {
      "preparation_time": "medium",
      "prep_time": 24,
      "cuisine": "Indian",
      "complexity": "high"
    }
  },
  {
    "title": "Tuscan Sausage Ragu",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 pound bulk sweet Italian sausage",
      "1 pound bulk hot Italian sausage",
      "1 large red onion, diced",
      "2 ribs celery, diced",
      "3 cloves garlic, minced",
      "1/2 cup dry red wine",
      "1 (28 ounce) can Italian-style diced tomatoes, undrained",
      "1 (28 ounce) can tomato sauce",
      "salt to taste",
      "1 cup heavy cream"
    ],
    "instructions": "Heat the olive oil in a large skillet over medium heat. Cook and stir the sweet and hot Italian sausage until browned, about 10 minutes. Break the meat up into crumbles as it cooks. Stir in the onion, celery, and garlic; cook and stir until the onion is translucent, about 8 more minutes. Pour the mixture into a slow cooker. Pour red wine into the skillet, and stir to dissolve the brown flavor bits from the bottom of the skillet. Pour the wine into the slow cooker. Add the diced tomatoes, tomato sauce, and salt to taste. Mix well.\nCover the slow cooker, set to Low, and cook for 5 hours. Pour in the cream, stir, cover, and cook for 1 more hour. Adjust salt again if necessary, and serve.\n",
    "embedding_ingredients": "olive oil, bulk sweet italian sausage, bulk hot italian sausage, large red onion,, ribs celery,, loves garlic,, dry red wine, can italian-style tomatoes, undrained, can tomato sauce, salt to taste, heavy cream",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Mediterranean",
      "complexity": "high"
    }
  },
  {
    "title": "Easy Tomato Sauce",
    "ingredients": [
      "4 tablespoons olive oil",
      "1 onion, chopped",
      "3 tomatoes, chopped",
      "1 tablespoon tomato puree",
      "salt and pepper to taste"
    ],
    "instructions": "In a large skillet over medium heat, cook onion in olive oil until translucent. Stir in tomatoes, cook until juice begins to thicken. Stir in puree, salt and pepper. Reduce heat and simmer 15 minutes more, until rich and thick.\n",
    "embedding_ingredients": "olive oil, onion,, tomatoes,, tomato puree, salt and pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "Mediterranean",
      "complexity": "low"
    }
  },
  {
    "title": "Refreshing Cucumber Lemonade",
    "ingredients": [
      "1 cup water",
      "1/2 cup white sugar",
      "1 cucumber, sliced",
      "6 lemons, juiced"
    ],
    "instructions": "Make a simple syrup by stirring the water and sugar together in a saucepan over medium heat; heat until just about to boil and the sugar has dissolved. Place in refrigerator 30 minutes, or until cool.\nPlace the cucumber slices in a blender or food processor; blend until mashed into a pulp. Pour the cucumber pulp into a fine mesh strainer place over a bowl to catch the liquid; allow to sit until you have about 2/3 cup of liquid from the cucumber, about 15 minutes.\nStir the simple syrup, cucumber liquid, and lemon juice together in a pitcher. Serve cold.\n",
    "embedding_ingredients": "water, white sugar, ucumber,, lemons, juiced",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Firecracker Scallops",
    "ingredients": [
      "5 slices bacon",
      "1 tablespoon bacon drippings",
      "2 tablespoons butter",
      "2 1/4 teaspoons garlic salt",
      "1 pound sea scallops",
      "2 tablespoons horseradish sauce"
    ],
    "instructions": "Cook the bacon in a large, deep skillet over medium-high heat until crisp, about 10 minutes. Drain on a paper towel-lined plate, reserving about 1 tablespoon of the bacon drippings. Crumble the bacon once cool to the touch.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nHeat the reserved bacon drippings in a separate skillet over medium heat. Stir the butter and garlic salt into the bacon drippings; allow the butter to melt completely. Cook the scallops in the butter mixture until there is a light brown coating on each side, about 4 minutes per side. Transfer the scallops to a baking dish. Spoon the butter sauce over the scallops. Drizzle the horseradish sauce over the scallops and sprinkle with the crumbled bacon.\nBake the scallops under the preheated broiler until the sauce begins to bubble, about 1 minute.\n",
    "embedding_ingredients": "slices bacon, bacon drippings, butter, garlic salt, ea scallops, horseradish sauce",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Peri Peri African Chicken",
    "ingredients": [
      "1/4 cup paprika",
      "2 tablespoons hot chili powder",
      "1 cup fresh lemon juice",
      "3 cloves garlic, minced",
      "1 1/2 teaspoons chopped fresh ginger",
      "1 1/2 teaspoons salt",
      "4 bone-in chicken breast halves"
    ],
    "instructions": "In a large bowl, stir together the paprika, chili powder, lemon juice, garlic, ginger and salt. Rub chicken with the mixture, place in a dish, and marinate for 3 hours.\nPreheat a grill for medium heat.\nPlace chicken onto the grill and discard the marinade. Cook for about 30 minutes, turning occasionally, until the skin is slightly charred and juices run clear.\n",
    "embedding_ingredients": "paprika, hot chili powder, fresh lemon juice, loves garlic,, fresh ginger, salt, bone-in chicken breast halves",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Asian",
      "complexity": "medium"
    }
  },
  {
    "title": "Butterscotch Sauce II",
    "ingredients": [
      "1 cup packed brown sugar",
      "1/4 cup milk",
      "2 tablespoons light corn syrup",
      "3 tablespoons butter"
    ],
    "instructions": "In a small saucepan, stir together the brown sugar, milk, corn syrup and butter. Warm over low heat until smooth and butter is melted. Do not boil.\n",
    "embedding_ingredients": "packed brown sugar, milk, light corn syrup, butter",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Shrimp Kisses",
    "ingredients": [
      "1 (8 ounce) package Monterey Jack cheese, cut into strips",
      "40 large shrimp - peeled, deveined and butterflied",
      "20 slices bacon, cut in half"
    ],
    "instructions": "Preheat the oven to 450 degrees F (220 degrees C).\nPlace a small piece of cheese into the butterflied opening of each shrimp. Wrap half of a slice of bacon around each one to conceal the cheese, securing with toothpicks. Place on a cookie sheet.\nBake for 10 to 15 minutes in the preheated oven, until bacon is browned.\n",
    "embedding_ingredients": "package monterey jack cheese, cut into strips, large shrimp - , deveined and butterflied, slices bacon, cut in half",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Best Lactose Free Blueberry Muffins",
    "ingredients": [
      "1/2 cup margarine",
      "1 1/4 cups white sugar",
      "1 teaspoon salt",
      "2 eggs",
      "2 cups all-purpose flour",
      "2 teaspoons baking powder",
      "2 cups fresh blueberries",
      "1/2 cup soy milk",
      "1 tablespoon vanilla extract",
      "1 tablespoon lime juice",
      "1 tablespoon white sugar for decoration"
    ],
    "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Line muffin pans with paper liners, and spray the tops with cooking spray.\nIn a large bowl, mix together the margarine, 1 1/4 cups of sugar, and salt until smooth. Beat in the eggs one at a time until well blended. In a separate bowl, stir together the flour and baking powder. Spoon some of this mixture onto the blueberries, and toss to coat. This will keep them from sinking to the bottom. Stir the remaining flour mixture into the bowl with the eggs, alternating with the soy milk, vanilla extract, and lime juice. Gently fold in the blueberries. Spoon the batter into the muffin cups, filling to the top. Sprinkle a little sugar over the tops of the muffins.\nBake for 25 minutes in the preheated oven, or until muffin tops are golden brown, and the tops spring back when pressed lightly. Cool for at least 10 minutes before removing from pan.\n",
    "embedding_ingredients": "margarine, white sugar, alt, eggs, all-purpose flour, baking powder, fresh blueberries, oy milk, vanilla extract, lime juice, white sugar for decoration",
    "features": {
      "preparation_time": "medium",
      "prep_time": 35,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Skillet Apple Chicken",
    "ingredients": [
      "2 1/2 tablespoons olive oil",
      "2 boneless skinless chicken breasts, cut into 1/4-inch strips",
      "1 sweet apple - peeled, cored and thinly sliced",
      "1 1/2 tablespoons garlic salt",
      "1 tablespoon cracked black pepper",
      "1 teaspoon pumpkin pie spice",
      "1 1/2 teaspoons chopped dried tarragon"
    ],
    "instructions": "Heat the olive oil in a large skillet over medium heat, and cook the chicken 5 minutes.\nGradually stir the apples into the skillet, and continue cooking 15 minutes, or until chicken juices run clear and apples are tender. Thoroughly mix in the garlic salt, pepper, pumpkin pie spice, and tarragon.\n",
    "embedding_ingredients": "olive oil, boneless skinless chicken breasts, cut into -inch strips, sweet apple - , cored and thinly, garlic salt, cracked black pepper, pumpkin pie spice, dried tarragon",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "Mediterranean",
      "complexity": "medium"
    }
  },
  {
    "title": "Pecan Chewies",
    "ingredients": [
      "3/4 cup butter",
      "3 cups packed light brown sugar",
      "3 eggs, beaten",
      "1 1/2 teaspoons vanilla extract",
      "3 cups chopped pecans",
      "3 cups self-rising flour"
    ],
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan, or for thinner bars, use a 10x15 inch jellyroll pan.\nMelt butter in a saucepan over medium heat. Stir in brown sugar until smooth. Remove from heat and let cool slightly.\nStir the eggs and vanilla into the brown sugar and butter. Mix in the chopped pecans, and then the flour. Spread evenly in the prepared pan.\nBake for 25 minutes in the preheated oven, or until golden brown. Allow to cool before cutting into bars.\n",
    "embedding_ingredients": "butter, packed light brown sugar, eggs, beaten, vanilla extract, pecans, self-rising flour",
    "features": {
      "preparation_time": "medium",
      "prep_time": 25,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Nat's Buttery Cashew Crunch",
    "ingredients": [
      "1 cup unsalted butter",
      "1 1/4 cups white sugar",
      "1/4 teaspoon salt",
      "1 tablespoon light corn syrup",
      "10 ounces cashews"
    ],
    "instructions": "Generously butter or grease a large baking sheet, and set aside.\nIn a saucepan over medium heat, combine the butter, sugar, salt and corn syrup. Cook, stirring until butter is melted. Stir in the cashews, and increase the heat to high. Heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads. Stir occasionally with a long handled wooden spoon so the cashews do not burn.\nPour onto a greased baking sheet, and allow to cool for about 10 minutes. Break into pieces, and store in an airtight container lined with waxed paper.\n",
    "embedding_ingredients": "unsalted butter, white sugar, alt, light corn syrup, cashews",
    "features": {
      "preparation_time": "medium",
      "prep_time": 10,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Tia and David's Deep Fried Tortellini",
    "ingredients": [
      "1 (16 ounce) package refrigerated or fresh cheese tortellini",
      "1/4 cup bread crumbs",
      "1/4 cup cornflake crumbs",
      "salt and pepper to taste",
      "dried parsley, to taste",
      "oil for deep frying",
      "2 eggs, lightly beaten"
    ],
    "instructions": "Cook tortellini according to package directions. Rinse under cool water, and allow to cool slightly.\nIn a large resealable plastic bag, combine bread crumbs, cornflake crumbs, salt, pepper, and parsley.\nHeat oil in a deep fryer or deep skillet over medium heat. In small batches, dip the tortellini in egg, and place in resealable bag. Shake to coat, and set aside on a plate until the oil is hot.\nIn batches, deep fry breaded tortellini until golden brown. Serve with tomato sauce for dipping.\n",
    "embedding_ingredients": "package refrigerated or fresh cheese tortellini, bread crumbs, cornflake crumbs, salt and pepper to taste, dried parsley, to taste, oil for deep frying, eggs, lightly beaten",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Spicy Peach Chutney",
    "ingredients": [
      "4 pounds sliced peeled peaches",
      "1 cup raisins",
      "2 cloves garlic, minced",
      "1/2 cup chopped onion",
      "5 ounces chopped preserved ginger",
      "1 1/2 tablespoons chili powder",
      "1 tablespoon mustard seed",
      "1 teaspoon curry powder",
      "4 cups packed brown sugar",
      "4 cups apple cider vinegar",
      "1/4 cup pickling spice"
    ],
    "instructions": "In a large heavy pot, stir together the peaches, raisins, garlic, onion, preserved ginger, chili powder, mustard seed, curry powder, brown sugar and cider vinegar. Wrap the pickling spice in a cheesecloth bag, and place in the pot.\nBring to a boil, and cook over medium heat uncovered until the mixture reaches your desired consistency. It will take about 1 1/2 hours to get a good thick sauce. Stir frequently to prevent scorching on the bottom.\nRemove the spice bag, and ladle into hot sterilized jars. Wipe the rims with a clean moist cloth. Seal with lids and rings, and process in a barely simmering water bath for 10 minutes, or the time recommended by your local extension for your area. The water should cover the jars completely.\n",
    "embedding_ingredients": "peaches, raisins, loves garlic,, onion, preserved ginger, chili powder, mustard seed, curry powder, packed brown sugar, apple cider vinegar, pickling spice",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Broccoli Buffet Salad",
    "ingredients": [
      "3 cups broccoli florets",
      "1/2 cup chopped red onion",
      "1/4 cup sunflower seeds",
      "1/2 cup chopped raisins",
      "1/2 cup crumbled feta cheese",
      "1/2 cup plain low-fat yogurt",
      "1/4 cup light mayonnaise",
      "2 tablespoons white sugar",
      "1 tablespoon lemon juice",
      "salt and pepper to taste"
    ],
    "instructions": "In a measuring cup, mix together yogurt, mayonnaise, sugar, and lemon juice.\nIn a salad bowl, stir together broccoli, red onion, sunflower seeds, raisins, and crumbled feta cheese. Toss with yogurt dressing, and season with salt and pepper to taste. Cover, and refrigerate for 2 hours.\n",
    "embedding_ingredients": "broccoli florets, red onion, unflower seeds, raisins, crumbled feta cheese, plain low-fat yogurt, light mayonnaise, white sugar, lemon juice, salt and pepper to taste",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Mediterranean",
      "complexity": "medium"
    }
  },
  {
    "title": "Lemon Dill Rice",
    "ingredients": [
      "3 tablespoons butter",
      "1 large onion, minced",
      "2 cups long-grain white rice",
      "4 cups water",
      "1/4 cup fresh lemon juice",
      "2 tablespoons salt",
      "2 tablespoons dill seed",
      "1/2 teaspoon grated lemon zest",
      "1 teaspoon chopped fresh parsley for garnish"
    ],
    "instructions": "Preheat the oven to 325 degrees F (165 degrees C).\nMelt butter in a heavy skillet over medium heat. Add the onion and rice; cook and stir until lightly toasted. Stir in the water and lemon juice, and season with salt and dill seed. Bring to a boil. Pour the rice mixture into a 3 quart casserole dish.\nBake for 1 hour, covered, in the preheated oven. Garnish with lemon zest and chopped parsley.\n",
    "embedding_ingredients": "butter, large onion,, long-grain white rice, water, fresh lemon juice, salt, dill seed, lemon zest, fresh parsley for garnish",
    "features": {
      "preparation_time": "medium",
      "prep_time": 60,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Cucumber Salad",
    "ingredients": [
      "4 medium cucumbers, peeled and diced",
      "1 (8 ounce) container vanilla low-fat yogurt",
      "1 (8 ounce) container reduced-fat sour cream",
      "1/2 cup diced onion",
      "2 cloves garlic, minced",
      "1 tablespoon dried dill weed",
      "salt and pepper to taste"
    ],
    "instructions": "Drain cucumbers for a few minutes on paper towels. In a serving dish, stir together the yogurt, sour cream, onion, garlic, and dill. Add cucumbers, and gently mix to coat. Season with salt and pepper. Refrigerate for a couple of hours before serving for best flavor.\n",
    "embedding_ingredients": "medium cucumbers, and, container vanilla low-fat yogurt, container reduced-fat sour cream, onion, loves garlic,, dried dill weed, salt and pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Sweet Dijon Salad Dressing",
    "ingredients": [
      "1/4 cup apple cider vinegar",
      "1/4 cup Dijon mustard",
      "1/4 cup olive oil",
      "4 (1 gram) packets granular sucrolose sweetener (such as Splenda®)"
    ],
    "instructions": "Place the cider vinegar, Dijon mustard, olive oil and sugar substitute into a jar with a tight fitting lid. Close the jar, and shake vigorously to blend. Refrigerate until chilled before using.\n",
    "embedding_ingredients": "apple cider vinegar, dijon mustard, olive oil, packets granular sucrolose sweetener",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "Mediterranean",
      "complexity": "low"
    }
  },
  {
    "title": "Moist Garlic Chicken",
    "ingredients": [
      "2 cups water",
      "2 cubes chicken bouillon",
      "1/2 cup butter",
      "1 tablespoon dried Italian seasoning (optional)",
      "1/2 teaspoon dried dill weed (optional)",
      "1 teaspoon garlic salt, or to taste",
      "4 skinless, boneless chicken breast halves"
    ],
    "instructions": "Pour the water into a microwave-safe casserole dish, and place in the microwave. Heat until boiling, about 2 minutes. Stir in bouillon cubes, butter, italian seasoning, dill, and garlic salt.\nPierce the chicken breasts with a fork on one side, and place the pierced side down in the casserole dish. The chicken should be almost covered by the liquid, if not completely covered.\nCover the dish, and cook in the microwave for 10 minutes, or until chicken is no longer pink, and juices run clear. If the chicken is not done after the 10 minutes, continue to cook at 1 1/2 minute intervals.\n",
    "embedding_ingredients": "water, ubes chicken bouillon, butter, dried italian seasoning, dried dill weed, garlic salt, or to taste, skinless, boneless chicken breast halves",
    "features": {
      "preparation_time": "medium",
      "prep_time": 24,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Broccoli Cheese Pie",
    "ingredients": [
      "1 head fresh broccoli, chopped",
      "1 cup shredded Cheddar cheese",
      "3/4 cup all-purpose flour",
      "1/2 teaspoon salt",
      "1/4 teaspoon dry mustard",
      "1/4 cup butter, melted",
      "1 tablespoon butter",
      "1 onion, chopped",
      "1/4 pound fresh mushrooms, sliced",
      "2 tablespoons all-purpose flour",
      "1 cup half-and-half cream",
      "1 teaspoon salt",
      "1/4 teaspoon ground nutmeg",
      "3 eggs, beaten"
    ],
    "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBring about 1 inch water to a boil in a pot. Place the chopped broccoli in a steamer basket over boiling water, and steam 5 minutes, or until tender but firm.\nIn a bowl, mix the Cheddar cheese, 3/4 cup flour, 1/2 teaspoon salt, and mustard. Mix in 1/4 cup butter until evenly moist. Press into the bottom and sides of an 8 inch pie dish.\nMelt the 1 tablespoon butter in a skillet over medium heat, and saute the onion and mushrooms until tender. Stir in 2 tablespoons flour, half and half, 1 teaspoon salt, and nutmeg. Bring to a boil, and cook 1 minute. Remove from heat. Mix in steamed broccoli. Gradually stir in eggs. Transfer to the pie crust.\nBake 15 minutes in the preheated oven. Reduce heat to 375 degrees F (190 degrees C), and continue baking 20 minutes, until a knife inserted in the center comes out clean.\n",
    "embedding_ingredients": "head fresh broccoli,, hredded cheddar cheese, all-purpose flour, alt, dry mustard, butter, melted, butter, onion,, fresh mushrooms,, all-purpose flour, half-and-half cream, alt, nutmeg, eggs, beaten",
    "features": {
      "preparation_time": "medium",
      "prep_time": 41,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Jelly Roll",
    "ingredients": [
      "1 cup sifted cake flour",
      "1 1/2 teaspoons baking powder",
      "1/4 teaspoon salt",
      "2 eggs",
      "3/4 cup white sugar",
      "1/2 teaspoon vanilla extract",
      "2 tablespoons 2% milk",
      "1/2 cup confectioners' sugar for dusting",
      "1 cup strawberry jam"
    ],
    "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Line a 10x15 inch jellyroll pan with parchment paper.\nSift together the flour, baking powder and salt. Set aside. In a large bowl, beat eggs and sugar with an electric mixer until thick and pale, about 5 minutes. Stir in the vanilla and milk. Stir in the dry ingredients gradually. The batter will be thin. Pour into the prepared pan.\nBake for 8 to 10 minutes in the preheated oven, until the center springs back when pressed lightly. Don't over bake, or it may crack.\nGenerously dust a clean dish towel with confectioners' sugar. Turn the cake out onto the towel, and peel off the parchment paper. Gently roll up the cake using the towel, and let cool for about 10 minutes.\nUnroll the cake, and spread an even coating of jam onto the top. Roll the cake back up into a tight spiral, and remove the towel. Dust with confectioners' sugar before serving.\n",
    "embedding_ingredients": "ifted cake flour, baking powder, alt, eggs, white sugar, vanilla extract, % milk, confectioners' sugar for dusting, trawberry jam",
    "features": {
      "preparation_time": "medium",
      "prep_time": 25,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Creamy Garlic Sauce",
    "ingredients": [
      "1/2 cup water, divided",
      "2 tablespoons chopped garlic",
      "1 teaspoon garlic powder",
      "2 cups heavy cream",
      "1 tablespoon chopped fresh parsley",
      "salt and pepper to taste",
      "2 tablespoons cornstarch"
    ],
    "instructions": "Pour half of the water into a saucepan, and bring to a boil over medium heat. Add the garlic and garlic powder, and boil until the water has almost evaporated, about 5 minutes. Stir in the heavy cream, parsley, salt, and pepper. Mix the cornstarch with the remaining water, and stir into the sauce. Cook, stirring constantly, until thickened, about 3 minutes.\n",
    "embedding_ingredients": "water, divided, garlic, garlic powder, heavy cream, fresh parsley, salt and pepper to taste, cornstarch",
    "features": {
      "preparation_time": "medium",
      "prep_time": 8,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Pork Green Chile",
    "ingredients": [
      "2 tablespoons vegetable oil",
      "1 1/2 pounds cubed pork stew meat",
      "2 tablespoons all-purpose flour",
      "1 (4.5 ounce) can diced green chile peppers, drained",
      "1/2 (3.5 ounce) can chopped jalapeno peppers",
      "1/2 medium onion, chopped",
      "5 tablespoons tomato sauce",
      "3 1/2 cups water",
      "onion salt to taste",
      "garlic salt to taste",
      "salt and black pepper to taste"
    ],
    "instructions": "Heat oil in a large cast iron skillet over medium-high heat. Stir in cubed pork, and cook until nicely browned and cooked through, about 15 minutes. Remove skillet from heat, and allow to cool briefly.\nSprinkle flour over pork. With a wooden spoon, stir pork to coat, scraping the bottom of the skillet to loosen browned bits. Add chile peppers, jalapenos, and onions. Stir in tomato sauce and water. Season to taste with onion salt, garlic salt, and salt and pepper.\nReturn skillet to medium heat. Bring to a simmer, cover, and cook 30 minutes, stirring occasionally. Remove cover, and cook 10 minutes more.\n",
    "embedding_ingredients": "vegetable oil, cubed pork stew meat, all-purpose flour, can green chile peppers, drained, can jalapeno peppers, medium onion,, tomato sauce, water, onion salt to taste, garlic salt to taste, salt and black pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 55,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Stir-Fry Broccoli With Orange Sauce",
    "ingredients": [
      "1 teaspoon sesame oil",
      "1 teaspoon canola oil",
      "1 1/2 cups broccoli florets, bite-size",
      "1/2 cup sliced or chopped water chestnuts, drained",
      "1/2 cup orange juice",
      "1 tablespoon cornstarch",
      "1 tablespoon light soy sauce"
    ],
    "instructions": "Add oils to a small skillet on medium-high heat. Add broccoli and water chestnuts; stir-fry 3 minutes. In a small bowl, combine remaining ingredients. Add to broccoli; lower heat and cook until sauce is thickened, 2 minutes.\n",
    "embedding_ingredients": "esame oil, canola oil, broccoli florets, bite-size, liced or water chestnuts, drained, orange juice, cornstarch, light soy sauce",
    "features": {
      "preparation_time": "medium",
      "prep_time": 5,
      "cuisine": "Asian",
      "complexity": "medium"
    }
  },
  {
    "title": "Olive and Feta Pasta",
    "ingredients": [
      "8 ounces uncooked whole wheat spaghetti",
      "1 tablespoon olive oil",
      "2 cloves garlic, minced",
      "8 ounces crimini mushrooms, sliced",
      "2 small zucchini, sliced",
      "dried oregano to taste",
      "salt and pepper to taste",
      "12 black olives, pitted and sliced",
      "1 ounce crumbled feta cheese"
    ],
    "instructions": "Bring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain.\nHeat the olive oil in a skillet over medium heat, and saute the garlic 2 minutes. Mix in mushrooms and zucchini. Season with oregano, salt, and pepper. Stir in olives, and cook until heated through. Place pasta in the skillet, toss to coat, and continue cooking about 2 minutes. Top with feta cheese to serve.\n",
    "embedding_ingredients": "uncooked whole wheat spaghetti, olive oil, loves garlic,, crimini mushrooms,, small zucchini,, dried oregano to taste, salt and pepper to taste, black olives, pitted and, crumbled feta cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 14,
      "cuisine": "Italian",
      "complexity": "medium"
    }
  },
  {
    "title": "Beef, Bean, and Beer Chili",
    "ingredients": [
      "1 tablespoon vegetable oil",
      "1 onion, diced",
      "2 pounds lean ground beef",
      "2 teaspoons salt, plus more to taste",
      "3 cloves garlic, minced",
      "3 tablespoons ground ancho chile powder",
      "1 tablespoon ground cumin",
      "1 teaspoon paprika",
      "1 teaspoon ground black pepper",
      "1/8 teaspoon ground cinnamon",
      "1 (12 ounce) bottle beer",
      "1 teaspoon unsweetened cocoa powder",
      "1/4 teaspoon dried oregano",
      "1/4 teaspoon ground cayenne pepper",
      "2 cups water, or as needed",
      "1 cup tomato puree",
      "2/3 cup diced poblano pepper",
      "2 (12 ounce) cans pinto beans, drained and rinsed well"
    ],
    "instructions": "Place a pot over high heat. Drizzle in vegetable oil. Add diced onion, ground beef, and salt. Break up meat with wooden spoon into small pieces as it browns. After meat browns and releases its juices, continue stirring until the released liquid evaporates, about 4 minutes. Reduce heat to medium-high. Add garlic, chile powder, cumin, paprika, black pepper, and cinnamon. Cook and stir until mixture begins to darken, 3 or 4 minutes.\nStir in beer. Add cocoa powder, oregano, cayenne, water, and tomato puree; stir well. Bring to a simmer; adjust heat to medium-low. Simmer 30 minutes.\nStir in diced green pepper and pinto beans. If mixture becomes too thick, add a bit more water. Simmer until peppers are tender and flavors have blended, about 30 more minutes.\n",
    "embedding_ingredients": "vegetable oil, onion,, lean beef, salt, plus more to taste, loves garlic,, ancho chile powder, cumin, paprika, black pepper, cinnamon, bottle beer, unsweetened cocoa powder, dried oregano, cayenne pepper, water, or as needed, tomato puree, poblano pepper, cans pinto beans, drained and rinsed well",
    "features": {
      "preparation_time": "medium",
      "prep_time": 38,
      "cuisine": "Indian",
      "complexity": "high"
    }
  },
  {
    "title": "Overnight Coconut Pecan Steel Cut Oats",
    "ingredients": [
      "1/3 cup steel cut oats",
      "1 tablespoon unsweetened shredded coconut",
      "1 tablespoon crushed pecans",
      "1/2 teaspoon brown sugar",
      "1/8 teaspoon ground cinnamon",
      "1/3 cup milk",
      "1 tablespoon milk"
    ],
    "instructions": "Mix oats, coconut, pecans, brown sugar, and cinnamon in a small container; top with 1/3 cup milk. Cover and refrigerate for 8 hours or overnight. Stir 1 tablespoon milk into oat mixture before serving.\n",
    "embedding_ingredients": "teel cut oats, unsweetened shredded coconut, pecans, brown sugar, cinnamon, milk, milk",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Hawaiian Pineapple Sweet & Sour Smoked Sausage",
    "ingredients": [
      "1 (14 ounce) package Hillshire Farm® Smoked Sausage, cut into 1/2-inch slices",
      "1 red bell pepper, seeded, chopped",
      "1/4 cup sweet chili garlic sauce*",
      "1 cup fresh pineapple, cut into 1/2-inch pieces",
      "3 cups cooked rice"
    ],
    "instructions": "Cook and stir sausage and bell peppers over medium-high heat for 5 minutes or until sausage is lightly browned and peppers are tender.\nAdd chili garlic sauce and pineapple; cook and stir for 5 minutes.\nServe over cooked rice.\n",
    "embedding_ingredients": "package hillshire farm® smoked sausage, cut into -inch slices, red bell pepper, seeded,, weet chili garlic sauce*, fresh pineapple, cut into -inch pieces, cooked rice",
    "features": {
      "preparation_time": "medium",
      "prep_time": 10,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Balsamic Glaze",
    "ingredients": [
      "2 cups balsamic vinegar",
      "1/2 cup brown sugar"
    ],
    "instructions": "Mix balsamic vinegar with brown sugar in a saucepan over medium heat, stirring constantly until sugar has dissolved. Bring to a boil, reduce heat to low, and simmer until glaze is reduced by half, about 20 minutes. Glaze should coat the back of a spoon. Let cool and pour into a jar with a lid; store in refrigerator.\n",
    "embedding_ingredients": "balsamic vinegar, brown sugar",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Chewy No Bake Granola Bars ",
    "ingredients": [
      "1 cup rolled oats",
      "1 cup steel-cut oats",
      "1 cup crispy rice cereal",
      "1/2 cup chopped mixed dried fruit",
      "1/2 cup chopped almonds",
      "1/4 cup butter",
      "1/2 cup brown sugar",
      "1/4 cup honey",
      "2 teaspoons vanilla extract",
      "1/2 cup mini chocolate chips"
    ],
    "instructions": "Grease a 9x13-inch baking dish.\nMix rolled oats, steel-cut oats, rice cereal, dried fruit, and almonds together in a large bowl.\nMelt butter in a saucepan over medium heat; add brown sugar, honey, and vanilla extract. Whisk until sugar is completely dissolved, about 2 minutes. Pour over oat mixture; stir to combine.\nSpread oat mixture into prepared baking dish. Press chocolate chips into top. Refrigerate until chilled, about 1 hour.\n",
    "embedding_ingredients": "rolled oats, teel-cut oats, crispy rice cereal, mixed dried fruit, almonds, butter, brown sugar, honey, vanilla extract, mini chocolate chips",
    "features": {
      "preparation_time": "long",
      "prep_time": 62,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Super Easy Slow Cooker Chicken Enchilada Meat",
    "ingredients": [
      "2 cups chicken broth",
      "1 (14.5 ounce) can diced tomatoes",
      "1/3 cup chili powder",
      "1/2 cup all-purpose flour",
      "1 clove garlic",
      "2 teaspoons ground cumin",
      "1 teaspoon oregano",
      "1 teaspoon salt, or to taste",
      "1 pinch cayenne pepper, or more to taste (optional)",
      "4 skinless, boneless chicken breast halves"
    ],
    "instructions": "Blend chicken broth, tomatoes, chili powder, flour, garlic, cumin, oregano, salt, and cayenne pepper in a blender until smooth.\nPut chicken breast in bottom of a slow cooker; pour blended enchilada sauce over the chicken.\nCook on Low 8 to 9 hours (or 4 to 6 hours on High). Shred the chicken with 2 large forks and stir into the sauce.\n",
    "embedding_ingredients": "chicken broth, can tomatoes, chili powder, all-purpose flour, love garlic, cumin, oregano, alt, or to taste, pinch cayenne pepper, or more to taste, skinless, boneless chicken breast halves",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Indian",
      "complexity": "medium"
    }
  },
  {
    "title": "Crunchy French Onion Chicken",
    "ingredients": [
      "1 1/3 cups French-fried onions, crushed",
      "1 egg, beaten",
      "1 pound skinless, boneless chicken breast halves"
    ],
    "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nSpread crushed onions in a shallow bowl. Pour beaten egg into a separate shallow bowl.\nDip chicken into beaten egg, then press into crushed onions. Gently tap chicken to let loose pieces fall away. Put breaded chicken to a baking sheet.\nBake chicken until no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
    "embedding_ingredients": "french-fried onions,, egg, beaten, kinless, boneless chicken breast halves",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Paleo Banana Bread",
    "ingredients": [
      "1 serving cooking spray",
      "2 cups almond flour",
      "1 tablespoon ground cinnamon",
      "1 teaspoon baking soda",
      "2 eggs",
      "1/2 cup water",
      "1 teaspoon almond extract",
      "1/4 cup agave syrup",
      "2 ripe bananas, mashed",
      "1/2 teaspoon vanilla bean paste (optional)"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray loaf pan with cooking spray.\nMix together almond flour, ground cinnamon, and baking soda in a bowl.\nBeat two eggs in a bowl. Mix in water, almond extract, agave syrup, mashed bananas, and vanilla bean paste. Add banana mixture to almond flour mixture; mix until no dry areas are visible. Pour batter into the prepared loaf pan.\nBake banana bread in the preheated oven until brown and crisp around the edges, about 45 minutes.\n",
    "embedding_ingredients": "serving cooking spray, almond flour, cinnamon, baking soda, eggs, water, almond extract, agave syrup, ripe bananas, mashed, vanilla bean paste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Slow Cooker Chicken Dinner",
    "ingredients": [
      "6 red potatoes, cut into chunks",
      "1/2 pound baby carrots, halved",
      "10 skinless, boneless chicken thighs, trimmed of excess fat",
      "1 (10.75 ounce) can condensed cream of chicken soup",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "1/8 teaspoon garlic salt",
      "2 tablespoons mashed potato flakes (optional)"
    ],
    "instructions": "Place potatoes and carrots in a slow cooker; top with chicken thighs.\nCombine cream of chicken soup, cream of mushroom soup, and garlic salt in a bowl. Pour over chicken thighs.\nCover and cook chicken mixture on High for 3 1/2 hours. Stir potato flakes into soup mixture to thicken; cook for an additional 30 minutes.\n",
    "embedding_ingredients": "red potatoes, cut into chunks, baby carrots, halved, skinless, boneless chicken thighs, trimmed of excess fat, can condensed cream of chicken soup, can condensed cream of mushroom soup, garlic salt, mashed potato flakes",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Icelandic Pepper Cookies",
    "ingredients": [
      "1 1/4 cups butter, softened",
      "1 1/4 cups white sugar",
      "3/4 cup light corn syrup",
      "2 small eggs",
      "3 cups all-purpose flour",
      "1 1/2 teaspoons baking powder",
      "1 teaspoon baking soda",
      "1/2 teaspoon salt",
      "2 teaspoons ground cinnamon",
      "2 teaspoons ground cloves",
      "1 teaspoon ground ginger",
      "1/4 teaspoon ground black pepper"
    ],
    "instructions": "In a large bowl, cream butter and sugar. Stir in corn syrup and eggs; cream well. Sift together flour, baking powder, baking soda, salt, cinnamon, cloves, ginger, and pepper. Add dry ingredients to the butter mixture, and mix until smooth. Refrigerate dough over night.\nPreheat oven to 350 degrees F (175 degrees C).\nRoll out dough to 1/4 inch thickness. Cut out cookies with a 2 inch round cookie cutter. Place at least 1 inch apart on cookie sheet and bake for 8 to 10 minutes in preheated oven.\n",
    "embedding_ingredients": "butter, softened, white sugar, light corn syrup, small eggs, all-purpose flour, baking powder, baking soda, alt, cinnamon, cloves, ginger, black pepper",
    "features": {
      "preparation_time": "medium",
      "prep_time": 10,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Eskimo Cookies",
    "ingredients": [
      "3/4 cup butter",
      "3/4 cup white sugar",
      "3 tablespoons unsweetened cocoa powder",
      "1/2 teaspoon vanilla extract",
      "1 tablespoon water",
      "2 cups rolled oats",
      "1/3 cup confectioners' sugar for decoration"
    ],
    "instructions": "Soften butter and beat well. Add sugar and mix well. Add cocoa, vanilla and water. Then add oatmeal.\nShape into 36 balls and roll in confectioners' sugar. Keep in refrigerator.\n",
    "embedding_ingredients": "butter, white sugar, unsweetened cocoa powder, vanilla extract, water, rolled oats, confectioners' sugar for decoration",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Cherry Winks",
    "ingredients": [
      "3/4 cup shortening",
      "1 cup white sugar",
      "2 eggs",
      "2 tablespoons milk",
      "1 teaspoon vanilla extract",
      "2 1/4 cups sifted all-purpose flour",
      "1 teaspoon baking powder",
      "1/2 teaspoon baking soda",
      "1/2 teaspoon salt",
      "1 cup chopped pecans",
      "1 cup dates, pitted and chopped",
      "1/3 cup maraschino cherries, chopped",
      "2 1/2 cups crushed cornflakes cereal",
      "10 maraschino cherries, quartered"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheets.\nCream the shortening with the sugar. Blend in the eggs, milk and vanilla.\nSift together the flour, baking powder, baking soda and salt. Add the flour mixture to the creamed mixture and mix well. Stir in the chopped pecans, chopped dates and 1/3 cup maraschino cherries.\nShape teaspoonful sized chunks of dough into balls. Roll each ball in the crushed corn flakes. Place balls on the prepared baking sheets and top each cookie with 1/4 maraschino cherry.\nBake at 375 degrees F (190 degrees C) for 10 to 12 minutes. Let cool completely before storing in airtight containers.\n",
    "embedding_ingredients": "hortening, white sugar, eggs, milk, vanilla extract, sifted all-purpose flour, baking powder, baking soda, alt, pecans, dates, pitted and, maraschino cherries,, cornflakes cereal, maraschino cherries, quartered",
    "features": {
      "preparation_time": "medium",
      "prep_time": 12,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Tasty Chicken",
    "ingredients": [
      "4 skinless, boneless chicken breasts",
      "1/4 cup soy sauce",
      "1 pinch garlic powder",
      "1/4 teaspoon dried sage",
      "3 green bell pepper, minced",
      "1 onion, chopped",
      "2 carrots, sliced thin",
      "2 tablespoons olive oil"
    ],
    "instructions": "Slice chicken into small cubes.\nHeat oil in a wok or frying pan over medium high heat. Brown chicken. Add carrots, and cook with chicken until slightly cooked. Add onions, bell peppers, sage, garlic powder, and soy sauce. Stir and cook continuously until chicken and vegetables are done, about five to ten minutes.\n",
    "embedding_ingredients": "skinless, boneless chicken breasts, oy sauce, pinch garlic powder, dried sage, reen bell pepper,, onion,, arrots, thin, olive oil",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Asian",
      "complexity": "medium"
    }
  },
  {
    "title": "Doubly Delicious Peanut Butter Cookies",
    "ingredients": [
      "1 cup white sugar",
      "1 cup packed brown sugar",
      "1 cup crunchy peanut butter",
      "1/2 cup butter flavored shortening",
      "2 eggs",
      "1 1/2 cups all-purpose flour",
      "1/2 teaspoon baking soda",
      "1/4 teaspoon salt",
      "2 cups peanut butter chips"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine sugars, peanut butter and shortening in large bowl. Beat at medium speed of mixer until well blended. Add eggs, one at a time, beating well afer each addition. Combine flour, baking soda and salt. Add gradually to creamed mixture at low speed. Mix just until blended. Stir in peanut butter chips with spoon. (Dough will be stiff.)\nShape into 1 1/2 inch balls. Place 2 inches apart on ungreased baking sheet. Make crisscross marks on top with floured fork tines.\nBake for 8 to 10 minutes or until edges are set and tops are moist. Cool about 8 minutes on baking sheet before removing to flat surface.\n",
    "embedding_ingredients": "white sugar, packed brown sugar, crunchy peanut butter, butter flavored shortening, eggs, all-purpose flour, baking soda, alt, peanut butter chips",
    "features": {
      "preparation_time": "medium",
      "prep_time": 18,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Michelle's Peanut Butter Dots",
    "ingredients": [
      "1 cup butter",
      "1 cup white sugar",
      "1 cup peanut butter",
      "1/4 cup milk",
      "1 teaspoon vanilla extract",
      "2 cups all-purpose flour"
    ],
    "instructions": "In large mixing bowl, combine sugar, butter, peanut butter, milk and vanilla. Mix by hand about 3 minutes or until creamy.\nThoroughly mix flour into creamy mix. Roll small balls of dough in hand, about 1 inch in diameter. Place on greased cookie sheet, approximately 3/4 inch apart. Using a fork, make criss cross pattern on cookie (this will flatten cookie partially). Be careful not to over flatten, dough should not touch each other.\nBake at 350 degrees F (175 degrees C) 18 to 25 minutes.\n",
    "embedding_ingredients": "butter, white sugar, peanut butter, milk, vanilla extract, all-purpose flour",
    "features": {
      "preparation_time": "medium",
      "prep_time": 28,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Cashew Chicken I",
    "ingredients": [
      "3 tablespoons melted butter",
      "1/2 cup unsweetened flaked coconut",
      "1/2 cup chopped cashews",
      "10 buttery round crackers",
      "4 skinless, boneless chicken breast halves",
      "salt to taste",
      "ground black pepper to taste"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace crackers, cashews, and coconut in a food processor, and process until they are coarsely chopped.\nDip chicken in melted butter and roll in cracker mixture. Place chicken in foil lined baking dish. Any extra cracker mixture can be blended with a little of the left over butter, and gently packed on to the chicken breasts.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes. Season with salt and pepper, if desired, and serve.\n",
    "embedding_ingredients": "melted butter, unsweetened flaked coconut, cashews, buttery round crackers, skinless, boneless chicken breast halves, salt to taste, black pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 35,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Chicken Tortilla Casserole",
    "ingredients": [
      "2 cups cooked, boneless and skinless chicken, cut into bite-sized pieces",
      "4 tablespoons chicken stock",
      "9 (6 inch) corn tortillas, cut into strips",
      "1 (10.75 ounce) can condensed cream of chicken soup",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "1 cup milk",
      "1 (16 ounce) jar salsa",
      "1 onion, shredded",
      "8 ounces shredded Cheddar cheese"
    ],
    "instructions": "In a bowl, mix soups, milk, salsa, and onion.\nPut 3 to 4 tablespoons of chicken stock in a 9 x 13 inch baking dish. Add a layer of tortilla strips, and then a layer of chicken. Pour soup mixture over chicken and tortillas. Continue to layer in this order until dish is full. Top with cheese. Cover and refrigerate for 24 hours.\nBake at 300 degrees F (150 degrees C) for 1 to 1 1/2 hours.\n",
    "embedding_ingredients": "cooked, boneless and skinless chicken, cut into bite-sized pieces, chicken stock, corn tortillas, cut into strips, can condensed cream of chicken soup, can condensed cream of mushroom soup, milk, jar salsa, onion, shredded, shredded cheddar cheese",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Mexican",
      "complexity": "medium"
    }
  },
  {
    "title": "Breakfast Grits",
    "ingredients": [
      "3 cups water",
      "1/2 teaspoon salt",
      "1 cup hominy grits",
      "freshly ground black pepper",
      "1 tablespoon butter",
      "1/2 cup shredded sharp Cheddar cheese"
    ],
    "instructions": "Bring the water and salt to a boil in a saucepan. Whisk in the grits and continue to whisk for 1 minute. When the mixture comes to a boil again, turn the heat to low. Stir frequently, cook for 10 to 15 minutes.\nRemove the grits from the heat and add pepper, butter and cheese; mix well. Stir until the butter and cheese are melted.\n",
    "embedding_ingredients": "water, alt, hominy grits, freshly black pepper, butter, hredded sharp cheddar cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 16,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Spinach and Pine Nuts",
    "ingredients": [
      "3 pounds spinach, rinsed",
      "2 teaspoons olive oil",
      "2 tablespoons toasted pine nuts",
      "1 teaspoon minced garlic",
      "freshly ground black pepper"
    ],
    "instructions": "Wash the spinach, but allow the water to cling to the leaves. Cook the spinach until it wilts in a skillet over medium-high heat, about 3 minutes.\nHeat the oil in a skillet over medium-high heat. Add the spinach, pine nuts, and garlic and cook for 2 minutes. Season with pepper and serve.\n",
    "embedding_ingredients": "spinach, rinsed, olive oil, toasted pine nuts, garlic, freshly black pepper",
    "features": {
      "preparation_time": "medium",
      "prep_time": 5,
      "cuisine": "Mediterranean",
      "complexity": "low"
    }
  },
  {
    "title": "Festive Onions",
    "ingredients": [
      "4 cups sliced onion",
      "5 tablespoons butter",
      "1 cup heavy whipping cream",
      "salt to taste",
      "ground black pepper to taste",
      "2/3 cup Parmesan cheese",
      "2 eggs"
    ],
    "instructions": "Saute onions in butter or margarine until transparent. Place in 2-quart baking dish.\nIn a small bowl, beat eggs well. Stir in cream, and season with salt and pepper. Pour mixture over onions, and sprinkle cheese.\nBake, uncovered, at 425 degrees F (220 degrees C) for 15 to 20 minutes.\n",
    "embedding_ingredients": "onion, butter, heavy whipping cream, salt to taste, black pepper to taste, parmesan cheese, eggs",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "Italian",
      "complexity": "medium"
    }
  },
  {
    "title": "Ginger and Spice Cookies",
    "ingredients": [
      "4 cups sifted all-purpose flour",
      "3/4 teaspoon baking soda",
      "3/4 teaspoon ground ginger",
      "1 1/2 teaspoons ground cinnamon",
      "1 1/2 teaspoons ground cloves",
      "1/2 teaspoon salt",
      "2 eggs",
      "1/2 cup unsulfured molasses",
      "1 1/4 cups white sugar",
      "1 cup unsalted butter",
      "1 teaspoon vanilla extract"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream the butter with the sugar until light and fluffy. Stir in molasses and eggs. Stir in vanilla. Sift together the flour, baking soda, ginger, cinnamon, cloves and salt. Gradually stir into the butter mixture. Lightly cover a piece of wax paper with sugar. Drop tablespoon-sized pieces of dough onto paper and coat with sugar.\nBake 14 to 15 minutes in the preheated oven, or until golden brown. Let cool on wire racks.\n",
    "embedding_ingredients": "sifted all-purpose flour, baking soda, ginger, cinnamon, cloves, alt, eggs, unsulfured molasses, white sugar, unsalted butter, vanilla extract",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Patty's Mashed Turnips",
    "ingredients": [
      "7 large turnips",
      "1 cup milk",
      "2 tablespoons butter",
      "salt to taste",
      "ground black pepper to taste"
    ],
    "instructions": "Peel, wash, and quarter turnips.\nBoil 35-45 minutes or until tender. Strain and rinse cooked turnips.\nPlace in large mixing bowl and use fork to break up turnips into smaller bits. Add milk and butter. Blend to desired consistency. Add salt and pepper to taste.\n",
    "embedding_ingredients": "large turnips, milk, butter, salt to taste, black pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Curried Meatloaf",
    "ingredients": [
      "1 1/2 pounds ground beef",
      "3/4 cup quick cooking oats",
      "1/2 cup chopped onion",
      "1/2 cup chopped, peeled apple",
      "1/3 cup raisins",
      "1/3 cup finely chopped peanuts",
      "1/3 cup ketchup",
      "1 egg",
      "2 1/2 teaspoons curry powder",
      "1 1/3 teaspoons ground cinnamon",
      "1 1/4 teaspoons salt"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large mixing bowl, mix together ground beef, oats, onion, apple, raisins, peanuts, ketchup, egg, curry powder, cinnamon, and salt. Shape to form six 4x2 inch loaves. Place in a large shallow pan.\nBake for about 25 to 30 minutes, or until done.\n",
    "embedding_ingredients": "beef, quick cooking oats, onion, , apple, raisins, finely peanuts, ketchup, egg, curry powder, cinnamon, salt",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Indian",
      "complexity": "high"
    }
  },
  {
    "title": "Pasta Milan",
    "ingredients": [
      "8 ounces penne pasta",
      "4 ounces frozen green peas",
      "4 ounces asparagus tips",
      "4 ounces Gorgonzola cheese",
      "1/3 cup heavy whipping cream",
      "salt and pepper to taste"
    ],
    "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta, peas and asparagus to boiling water. Cook for 5 minutes or until pasta is al dente. Drain.\nMeanwhile, crumble cheese with the cream and season with salt and pepper to taste.\nIn large bowl, toss pasta and vegetables with cheese mixture, stirring until the cheese has melted and the pasta is well coated with the sauce. Serve immediately.\n",
    "embedding_ingredients": "penne pasta, frozen green peas, asparagus tips, gorgonzola cheese, heavy whipping cream, salt and pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 5,
      "cuisine": "Italian",
      "complexity": "medium"
    }
  },
  {
    "title": "Easy Eggplant Pita",
    "ingredients": [
      "1 small eggplant, diced",
      "1/4 cup fresh sliced mushrooms",
      "1 green bell pepper, chopped",
      "1/2 onion, chopped",
      "1/4 teaspoon garlic powder",
      "1 tablespoon olive oil",
      "4 pitas, halved",
      "1 cup shredded mozzarella cheese",
      "1/2 cup ranch-style salad dressing (optional)"
    ],
    "instructions": "Combine eggplant, mushrooms, green bell pepper, onion, garlic powder and olive oil in a skillet and fry until vegetables are gently brown and softened.\nStuff hot vegetable mixture into pita bread pockets. Sprinkle Mozzarella cheese into the pockets. Top the entire sandwich with ranch dressing if you wish.\n",
    "embedding_ingredients": "small eggplant,, fresh mushrooms, reen bell pepper,, onion,, garlic powder, olive oil, pitas, halved, hredded mozzarella cheese, ranch-style salad dressing",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Italian",
      "complexity": "medium"
    }
  },
  {
    "title": "Grilled Orange Vinaigrette Chicken Salad",
    "ingredients": [
      "1/2 cup orange juice",
      "1/2 cup white wine vinegar",
      "1/4 cup olive oil",
      "4 tablespoons salt-free garlic and herb seasoning blend",
      "1 1/2 tablespoons white sugar",
      "1 pound skinless, boneless chicken breast halves",
      "1 head romaine lettuce- rinsed, dried and chopped",
      "1 (11 ounce) can mandarin oranges, drained",
      "1 cup chopped fresh broccoli",
      "1 cup chopped baby carrots"
    ],
    "instructions": "Preheat grill for medium-high heat.\nIn a bowl, whisk together the orange juice, vinegar, olive oil, seasoning blend, and sugar. Set aside about 1/2 cup for basting.\nLightly oil the grill grate. Grill chicken for 6 to 8 minutes on each side, basting frequently with the reserved portion of the dressing, or until juices run clear. Cool, and cut into strips. Discard basting sauce.\nIn a large bowl, toss together the lettuce, oranges, broccoli, and carrots. Top the salad with grilled chicken strips, and drizzle with remaining dressing to serve.\n",
    "embedding_ingredients": "orange juice, white wine vinegar, olive oil, salt-free garlic and herb seasoning blend, white sugar, kinless, boneless chicken breast halves, head romaine lettuce- rinsed, dried and, can mandarin oranges, drained, fresh broccoli, baby carrots",
    "features": {
      "preparation_time": "medium",
      "prep_time": 8,
      "cuisine": "Mediterranean",
      "complexity": "medium"
    }
  },
  {
    "title": "Moroccan Potato Casserole",
    "ingredients": [
      "6 cloves garlic",
      "salt to taste",
      "2 teaspoons paprika",
      "1/2 teaspoon ground cumin",
      "1/4 teaspoon ground cayenne pepper",
      "3/4 cup chopped fresh cilantro",
      "3/4 cup chopped parsley",
      "1 lemon, juiced",
      "3 tablespoons red wine vinegar",
      "3 tablespoons olive oil",
      "1 1/2 pounds red potatoes, sliced 1/2 inch thick",
      "1 large red bell pepper, cut into 1 inch pieces",
      "1 yellow bell pepper, cut into 1 1/2 inch squares",
      "1 large green bell pepper, cut into 1 1/2 inch pieces",
      "4 stalks celery, cut into 2 inch pieces",
      "1 pound tomatoes, each cut into 8 wedges",
      "2 tablespoons olive oil"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine garlic, 1/2 teaspoon salt, paprika, cumin, and cayenne in a food processor bowl. Process until mixture forms a paste. Add herbs, and pulse a few times to blend. Add lemon juice, vinegar, and 2 to 3 tablespoons olive oil; blend. Season to taste with salt.\nIn a large bowl, combine potatoes, peppers, and celery. Season with salt, and toss with herb sauce. Transfer to a large shallow baking dish. Scatter tomatoes among the potato mixture. Drizzle 1 to 2 tablespoons oil over top, and cover with foil.\nBake for 35 minutes. Remove foil. Continue baking until vegetables are tender, 20 to 30 minutes. Serve warm.\n",
    "embedding_ingredients": "loves garlic, salt to taste, paprika, cumin, cayenne pepper, fresh cilantro, parsley, lemon, juiced, red wine vinegar, olive oil, red potatoes, thick, large red bell pepper, cut into pieces, yellow bell pepper, cut into quares, large green bell pepper, cut into pieces, stalks celery, cut into pieces, tomatoes, each cut into wedges, olive oil",
    "features": {
      "preparation_time": "long",
      "prep_time": 65,
      "cuisine": "Indian",
      "complexity": "high"
    }
  },
  {
    "title": "Thanksgiving Meatloaf",
    "ingredients": [
      "2 1/2 pounds ground turkey",
      "1 1/2 cups chicken-flavor stuffing mix",
      "2 eggs",
      "1/3 cup milk"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together turkey, stuffing, eggs, and milk in a large bowl. Mixture will be lumpy. Spread mixture in 9x5 inch loaf pan.\nBake for 1 hour until temperature reads 165 degrees F in center of loaf.\n",
    "embedding_ingredients": "turkey, chicken-flavor stuffing mix, eggs, milk",
    "features": {
      "preparation_time": "medium",
      "prep_time": 60,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Sinless Mississippi Sin",
    "ingredients": [
      "1 (8 ounce) package Neufchatel cheese",
      "1 1/2 cups shredded white Cheddar cheese",
      "2 cups fat free sour cream",
      "1 (4 ounce) can green chile peppers",
      "1 teaspoon vegetarian Worcestershire sauce",
      "1 clove crushed garlic",
      "1 bunch green onions, chopped",
      "1 (6.5 ounce) jar marinated artichoke hearts, drained and chopped",
      "salt and pepper to taste",
      "1 (1 pound) loaf round sourdough bread",
      "1 cup chopped tomatoes"
    ],
    "instructions": "Preheat oven to 375 degrees F ( 190 degrees C).\nIn a medium bowl, beat the Neufchatel cheese until soft. Stir in Cheddar cheese, sour cream, green chiles, Worcestershire sauce, garlic, green onions, artichoke hearts, salt and pepper.\nSlice the top off the bread, and hollow the bread out. Spoon cheese and artichoke mixture into the bread bowl. Replace the top of the bread, and wrap entire bread bowl in aluminum foil.\nBake for 40 minutes in the preheated oven. Remove from oven, and stir in tomatoes. Serve hot.\n",
    "embedding_ingredients": "package neufchatel cheese, shredded white cheddar cheese, fat free sour cream, can green chile peppers, vegetarian worcestershire sauce, love garlic, bunch green onions,, jar marinated artichoke hearts, drained and, salt and pepper to taste, loaf round sourdough bread, tomatoes",
    "features": {
      "preparation_time": "medium",
      "prep_time": 40,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Sausage Balls",
    "ingredients": [
      "2 cups buttermilk baking mix",
      "1 pound pork sausage",
      "1 (11 ounce) can condensed cream of Cheddar cheese soup"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the baking mix, sausage and cheddar cheese soup. Mix well and shape into 1 inch balls.\nBake for 15 to 20 minutes or until a toothpick inserted in the center comes out clean and the balls are golden brown.\n",
    "embedding_ingredients": "buttermilk baking mix, pork sausage, can condensed cream of cheddar cheese soup",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Cube Steak Stew",
    "ingredients": [
      "1 1/2 pounds beef cube steak",
      "3 tablespoons all-purpose flour",
      "1 tablespoon olive oil",
      "1/2 tablespoon butter",
      "1 onion, chopped",
      "1 clove garlic, minced",
      "1 cube beef bouillon, dissolved in 1 cup water",
      "1 (15 ounce) can sliced potatoes, drained",
      "1 (8 ounce) can peas and carrots",
      "1 teaspoon browning sauce",
      "1/2 teaspoon Italian seasoning",
      "1 teaspoon salt",
      "1 teaspoon ground black pepper"
    ],
    "instructions": "Cut cube steaks into pieces about 1/2 inch in size. Sprinkle flour over a plate, and dredge meat in flour.\nIn a large skillet, heat oil and butter over medium high heat. Add steak pieces, onion, and garlic to oil in pan; saute till lightly browned. Add more butter if needed.\nStir in beef bouillon, potatoes, peas and carrots, browning sauce, Italian seasoning, salt, and black pepper. Cover, turn heat down to simmer, and cook for 25 minutes. It will thicken as it cooks. Add more water if it gets too thick.\n",
    "embedding_ingredients": "beef cube steak, all-purpose flour, olive oil, butter, onion,, love garlic,, ube beef bouillon, dissolved in water, can potatoes, drained, can peas and carrots, browning sauce, italian seasoning, alt, black pepper",
    "features": {
      "preparation_time": "medium",
      "prep_time": 25,
      "cuisine": "Mediterranean",
      "complexity": "high"
    }
  },
  {
    "title": "The Greatest Grilled Turkey",
    "ingredients": [
      "12 pounds whole turkey",
      "1 tablespoon vegetable oil",
      "1 teaspoon Italian seasoning",
      "salt and pepper to taste"
    ],
    "instructions": "Prepare an outdoor grill for indirect medium-high heat.\nRinse turkey and pat dry. Turn wings back to hold neck skin in place. Return legs to tucked position. Brush turkey with oil. Season inside and out with Italian seasonings, salt, and pepper.\nPlace turkey, breast side up, on a metal grate inside a large roasting pan. Arrange pan on the prepared grill. Grill 2 to 3 hours, to an internal thigh temperature of 180 degrees F (85 degrees C). Remove turkey from grill and let stand 15 minutes before carving.\n",
    "embedding_ingredients": "whole turkey, vegetable oil, italian seasoning, salt and pepper to taste",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Chinese Cookies",
    "ingredients": [
      "1 1/2 cups white sugar",
      "1 1/2 cups shortening",
      "1 egg",
      "1 teaspoon vanilla extract",
      "3 1/2 cups cake flour",
      "1 1/4 teaspoons baking soda",
      "3/4 teaspoon salt",
      "1/2 cup ground walnuts",
      "1 cup prepared chocolate fudge frosting"
    ],
    "instructions": "In a medium bowl, cream together the sugar and shortening. Stir in the egg and vanilla, beat until light and fluffy. Combine the cake flour, baking soda and salt, stir into the creamed mixture. Dough will be stiff, you may need to use your hands to mix. Roll dough into a log about 15 inches long, and roll in the ground nuts. Wrap and chill dough for at least an hour or until firm.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nUnwrap dough and cut into 1/2 inch slices. Place cookies 1 1/2 inches apart on the prepared cookie sheets.\nBake for 10 to 15 minutes in the preheated oven. Allow cookies to cool for a few minutes on the baking sheets before removing to cool completely on wire racks. When cool, place a dollop of fudge icing onto the center of each cookie.\n",
    "embedding_ingredients": "white sugar, shortening, egg, vanilla extract, cake flour, baking soda, alt, walnuts, prepared chocolate fudge frosting",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Simple Potato Salad",
    "ingredients": [
      "3 red potatoes",
      "2 eggs",
      "1 1/2 cups creamy salad dressing"
    ],
    "instructions": "Bring a small pot of salted water to a boil. Add potatoes; cook until tender but still firm, about 15 minutes. Drain and cool.\nPlace eggs in a saucepan, and cover completely with cold water. Bring water to a boil. Cover, remove from heat, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, and cool.\nPeel the eggs and cut around the egg white; keep the yolk whole.\nDice the egg whites and potatoes. Combine in a mixing bowl and add the salad dressing.\nToss the potatoes and egg; crumble the egg yolk on top and serve chilled.\n",
    "embedding_ingredients": "red potatoes, eggs, creamy salad dressing",
    "features": {
      "preparation_time": "medium",
      "prep_time": 27,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Marshmallow and Lime Gelatin Salad",
    "ingredients": [
      "7 fluid ounces lemon-lime flavored carbonated beverage",
      "2 cups miniature marshmallows",
      "1 (3 ounce) package lime flavored Jell-O® mix",
      "8 ounces cream cheese",
      "1 (20 ounce) can crushed pineapple with juice",
      "3/4 cup chopped pecans",
      "1 teaspoon mayonnaise",
      "1 cup frozen whipped topping, thawed"
    ],
    "instructions": "In a saucepan, combine the carbonated beverage and marshmallows. Stir over medium heat until marshmallows melt. Remove from heat and allow to cool.\nAdd the gelatin and cream cheese and mix until gelatin is dissolved.\nAdd the pineapple and juice, pecans, mayonnaise and whipped topping. Mix well and pour into a 7x11 inch dish and chill until set.\n",
    "embedding_ingredients": "fluid ounces lemon-lime flavored carbonated beverage, miniature marshmallows, package lime flavored jell-o® mix, cream cheese, can pineapple with juice, pecans, mayonnaise, frozen whipped topping, thawed",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Pizzelles I",
    "ingredients": [
      "2 cups margarine",
      "12 eggs",
      "3 cups white sugar",
      "8 teaspoons baking powder",
      "7 cups all-purpose flour",
      "4 tablespoons anise extract"
    ],
    "instructions": "Mix ingredients in order given. Should be the consistency of a drop cookie.\nHeat Pizzelle Iron. Drop about 1 heaping teaspoon on hot iron, wait approx. 40 seconds.\n",
    "embedding_ingredients": "margarine, eggs, white sugar, baking powder, all-purpose flour, anise extract",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Lasagne Verdi al Forno",
    "ingredients": [
      "PASTA",
      "5 ounces spinach - rinsed, stemmed, and dried",
      "2 eggs",
      "5/8 cup semolina flour",
      "1 teaspoon salt",
      "1 1/2 cups all-purpose flour",
      "RAGU",
      "2 tablespoons butter",
      "2 slices bacon, diced",
      "1 carrot, diced",
      "1 stalk celery, diced",
      "1 onion, diced",
      "3 1/2 ounces lean ground pork",
      "3 1/2 ounces lean ground beef",
      "3 1/2 ounces minced ham",
      "2 tablespoons tomato paste",
      "1 teaspoon dried oregano",
      "1 cup beef stock",
      "salt and pepper to taste",
      "3 1/2 ounces chicken livers, trimmed and chopped",
      "BECHAMEL",
      "2 tablespoons butter",
      "2 tablespoons all-purpose flour",
      "2 cups warm milk",
      "1 pinch salt",
      "1 pinch ground nutmeg",
      "CHEESE",
      "1 2/3 cups grated Parmesan cheese",
      "1 pint ricotta cheese",
      "3 tablespoons butter"
    ],
    "instructions": "For the pasta dough: Steam the spinach in a steamer or over boiling water until bright green, 2 minutes. Squeeze to remove excess moisture and process in a food processor to make a paste. Combine spinach with eggs, semolina, and salt and process until smooth. Stir in enough of the flour to make a smooth dough. Knead briefly, cover and set aside.\nFor the ragu: In a large skillet, melt butter over medium-high heat. Saute bacon, carrot, celery and onion until onion is translucent. Stir in ground pork, ground beef and minced ham, and cook until browned. Stir in tomato paste, oregano and beef stock. (Reserve the chicken livers for later.) Season with salt and pepper, reduce heat to low, cover and simmer 20 minutes.\nFor the bechamel: While the ragu is simmering, combine 2 tablespoons butter and 2 tablespoons flour in a medium saucepan over medium-low heat. Whisk to make a roux. Remove from heat, let rest one minute, then whisk in warm milk. Return to heat, simmer 10 minutes, stirring constantly, until thickened. Season with salt and nutmeg. Remove from heat.\nTo cook pasta: Bring a large pot of lightly salted water to a boil. On a floured surface, divide pasta dough into three portions. Roll each portion out to a thin sheet. Have ready an ice water bath. Cook each sheet 3 minutes in the boiling water; remove from the boiling water and dip in the ice water; drain and dry on a clean, dry cloth.\nTo finish the ragu: Stir the chicken livers into the simmering sauce. Cook 1 minute, remove from heat and set aside.\nPreheat oven to 400 degrees F (200 degrees C). Grease a 9x13 baking dish.\nTo assemble lasagna: Place one pasta sheet in bottom of prepared baking dish. Spread one-third of the ragu, one-quarter of the bechamel, one-third of the ricotta, and one-quarter of the parmesan over the pasta. Repeat layers twice. Top with remaining bechamel and parmesan and dot with butter.\nBake in preheated oven 30 minutes, until top is golden brown.\n",
    "embedding_ingredients": "pasta, spinach - rinsed, stemmed, and dried, eggs, emolina flour, alt, all-purpose flour, ragu, butter, slices bacon,, arrot,, stalk celery,, onion,, lean pork, lean beef, ham, tomato paste, dried oregano, beef stock, salt and pepper to taste, chicken livers, trimmed and, bechamel, butter, all-purpose flour, warm milk, pinch salt, pinch nutmeg, cheese, parmesan cheese, pint ricotta cheese, butter",
    "features": {
      "preparation_time": "long",
      "prep_time": 66,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Lemon Pepper Chicken II",
    "ingredients": [
      "2/3 cup dry lemonade mix",
      "2 teaspoons ground black pepper",
      "1 (16 ounce) bottle Italian-style salad dressing",
      "6 skinless, boneless chicken breast halves"
    ],
    "instructions": "To Marinate: In a nonporous glass dish or bowl combine the lemonade mix, pepper and salad dressing. Mix well. Add chicken and toss to coat; cover and refrigerate for 8 to 12 hours to marinate.\nPreheat oven to 350 degrees F (175 degrees C).\nRemove chicken from marinade, discarding any remaining marinade, and place in a 9x13 inch baking dish. Bake at 350 degrees F (175 degrees C) for 35 to 40 minutes, or until chicken is cooked through and juices run clear.\n",
    "embedding_ingredients": "dry lemonade mix, black pepper, bottle italian-style salad dressing, skinless, boneless chicken breast halves",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Talerine",
    "ingredients": [
      "1 pound lean ground beef",
      "1 small onion, chopped",
      "1 (6 ounce) can tomato paste",
      "1 (14.5 ounce) can Italian-style stewed tomatoes",
      "1 tablespoon salt",
      "1 1/2 teaspoons ground black pepper",
      "1 (12 ounce) package thin egg noodles",
      "1 (10 ounce) package frozen whole kernel corn",
      "1 cup shredded sharp Cheddar cheese"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a Dutch oven over medium-high heat, saute the ground beef and the onion together for about 5 minutes, or until the meat is browned and crumbly. Stir in the tomato paste, stewed tomatoes with juice, salt and ground black pepper.\nAdd the uncooked egg noodles to this mixture and pour in water to cover. Bring to a boil, reduce heat to low and let simmer until the noodles are slightly softened, about 5 minutes. Drain excess water, stir in the corn and transfer mixture to a 9x13-inch baking dish. Top with cheese.\nBake at 350 degrees F (175 degrees C) for 30 minutes.\n",
    "embedding_ingredients": "lean beef, small onion,, can tomato paste, can italian-style stewed tomatoes, alt, black pepper, package thin egg noodles, package frozen whole kernel corn, hredded sharp cheddar cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 40,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Curried Egg Sandwiches",
    "ingredients": [
      "4 hard-cooked eggs, peeled and chopped",
      "1/2 cup mayonnaise",
      "1 teaspoon curry powder",
      "salt and pepper to taste",
      "8 slices bread"
    ],
    "instructions": "Mix together mayonnaise and curry powder in a bowl. Gently stir in eggs, then season to taste with salt and pepper. Evenly divide between 4 slices of bread, top with remaining 4 slices.\n",
    "embedding_ingredients": "hard-cooked eggs, and, mayonnaise, curry powder, salt and pepper to taste, slices bread",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "Indian",
      "complexity": "low"
    }
  },
  {
    "title": "Aussie Lime Pie",
    "ingredients": [
      "2/3 cup rolled oats",
      "2/3 cup flaked coconut",
      "2/3 cup all-purpose flour",
      "1/2 cup white sugar",
      "1/2 cup butter, melted",
      "2 tablespoons light corn syrup",
      "1 teaspoon baking soda",
      "1 (14 ounce) can sweetened condensed milk",
      "1/2 cup lime juice",
      "4 egg yolks, beaten",
      "2 teaspoons grated lemon zest"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch glass pie pan.\nIn a medium bowl, mix together oats, coconut, flour, and sugar. In a separate bowl, mix together melted butter or margarine, corn syrup, and baking soda until frothy. Add corn syrup mixture to oat mixture and stir until ingredients are thoroughly combined. Press mixture evenly into bottom and sides of pie pan.\nIn a medium mixing bowl, combine condensed milk, lime juice, egg yolks, and lemon rind. Beat on medium speed 1 minute. Pour mixture into pie crust.\nBake in preheated oven for 20 minutes, until firm in center. Do not allow to brown on top. Chill before serving.\n",
    "embedding_ingredients": "rolled oats, flaked coconut, all-purpose flour, white sugar, butter, melted, light corn syrup, baking soda, can sweetened condensed milk, lime juice, egg yolks, beaten, lemon zest",
    "features": {
      "preparation_time": "medium",
      "prep_time": 21,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Puff Balls",
    "ingredients": [
      "1 (12 ounce) package refrigerated biscuit dough",
      "1 1/2 quarts oil for frying",
      "1 1/2 cups confectioners' sugar"
    ],
    "instructions": "Heat oil in a heavy bottomed saucepan or deep fryer to 375 degrees F (190 degrees C).\nCut each biscuit into 4 smaller circles using cutter or bottle cap. Fry circles 2 minutes on a side, until golden. Drain on paper towels. Roll hot biscuits in confectioners sugar.\n",
    "embedding_ingredients": "package refrigerated biscuit dough, quarts oil for frying, confectioners' sugar",
    "features": {
      "preparation_time": "medium",
      "prep_time": 2,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Potato Chip Cookies VI",
    "ingredients": [
      "1 cup shortening",
      "1 cup white sugar",
      "1 cup brown sugar",
      "2 eggs",
      "1 teaspoon vanilla extract",
      "2 cups all-purpose flour",
      "1 teaspoon baking soda",
      "1/2 teaspoon salt",
      "2 cups crushed potato chips",
      "1 cup chopped walnuts (optional)"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the shortening, white sugar, and brown sugar until light and fluffy. Add the eggs one at a time, beating well with each addition, then stir in the vanilla. Combine the flour, baking soda, and salt; gradually stir into the creamed mixture. Finally, fold in the potato chips and walnuts. Drop by rounded spoonfuls onto an unprepared cookie sheet.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
    "embedding_ingredients": "hortening, white sugar, brown sugar, eggs, vanilla extract, all-purpose flour, baking soda, alt, potato chips, walnuts",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Limeade",
    "ingredients": [
      "3 limes",
      "2/3 cup white sugar",
      "2 quarts cold water"
    ],
    "instructions": "Cut limes in half and squeeze lime juice into a 2 quart pitcher. Add sugar and stir until dissolved. Fill pitcher with cold water, stir and chill in refrigerator.\n",
    "embedding_ingredients": "limes, white sugar, quarts cold water",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Caramel Heavenlies",
    "ingredients": [
      "16 graham crackers",
      "2 cups miniature marshmallows",
      "3/4 cup butter",
      "1 teaspoon vanilla extract",
      "3/4 cup brown sugar",
      "2 cups sliced almonds",
      "2 cups flaked coconut"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 10x15 inch jellyroll pan with aluminum foil.\nArrange graham crackers to cover the bottom of the prepared pan. In a small saucepan, combine the butter and brown sugar. Cook over medium heat, stirring occasionally until smooth. remove from the heat and stir in the vanilla. Sprinkle the marshmallows over the graham cracker crust. Pour the butter mixture evenly over the graham crackers and marshmallows. Sprinkle the coconut and almonds evenly over the marshmallows.\nBake for 14 minutes in the preheated oven, until coconut and almonds are toasted. Allow the bars to cool completely before cutting into triangles. Store at room temperature in an airtight container.\n",
    "embedding_ingredients": "raham crackers, miniature marshmallows, butter, vanilla extract, brown sugar, almonds, flaked coconut",
    "features": {
      "preparation_time": "medium",
      "prep_time": 14,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Carrot Cake Bars",
    "ingredients": [
      "2 cups white sugar",
      "1 1/2 cups vegetable oil",
      "4 eggs",
      "2 cups all-purpose flour",
      "2 teaspoons baking soda",
      "2 teaspoons ground cinnamon",
      "1 teaspoon salt",
      "3 (4 ounce) jars carrot baby food"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10x15 inch jelly roll pan. Sift together the flour, baking soda, cinnamon and salt. Set aside.\nIn a large bowl, beat sugar, oil and eggs until smooth. Mix in the flour mixture. Stir in the baby food carrots.\nSpread batter into a 10x15 inch jelly roll pan. Bake in the preheated oven for 20 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
    "embedding_ingredients": "white sugar, vegetable oil, eggs, all-purpose flour, baking soda, cinnamon, alt, jars carrot baby food",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Moe's Fabulous Mashed Potatoes",
    "ingredients": [
      "1 pound Yukon Gold potatoes, peeled and quartered",
      "1/2 cup whole milk",
      "1/4 cup butter, cut into pieces",
      "1 pinch ground nutmeg",
      "kosher salt to taste",
      "ground white pepper to taste"
    ],
    "instructions": "Place the potatoes into a large pot, and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two, and place the potatoes in a large bowl.\nBring the milk to a boil in a small saucepan over low-medium heat.\nWhip the potatoes with an electric mixer until smooth; pour the boiling milk over the potatoes, and add butter, nutmeg, salt, and white pepper. Whip on Medium speed until light and fluffy.\n",
    "embedding_ingredients": "yukon gold potatoes, and quartered, whole milk, butter, cut into pieces, pinch nutmeg, kosher salt to taste, white pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Easter Lamb Cake II",
    "ingredients": [
      "2 1/4 cups cake flour",
      "2 1/2 teaspoons baking powder",
      "1/2 teaspoon salt",
      "1 1/4 cups white sugar",
      "1/2 cup butter",
      "1 cup milk",
      "1 teaspoon vanilla extract",
      "4 egg whites"
    ],
    "instructions": "First, prepare your mold. Coat with vegetable oil, let sit for a few minutes then wipe clean with a paper towel. Then grease and flour your mold, making sure to get all the little areas.\nPreheat oven to 375 degrees F (190 degrees C). Sift the cake flour, then sift again with the baking powder and salt; set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Add the flour mixture alternately with the milk. Stir the batter until smooth after each addition. Add the vanilla.\nIn a large glass or metal mixing bowl, beat egg whites until soft peaks form. Fold 1/3 of the egg whites into the batter to lighten it, then quickly fold in the remaining whites.\nFill the face side of the mold with batter. Move a wooden spoon through the batter GENTLY, to remove any air pockets. Make sure not to disturb the greased and floured surface of the mold. Put the lid on the mold, making sure it locks or ties together securely so that the steam and rising batter do not force the two sections apart.\nPut the mold on a cookie sheet in a preheated oven for about 1 hour. Test for doneness by inserting a skewer or wooden toothpick through a steam vent. Put the cake, still in the mold, on a rack for about 15 minutes. CAREFULLY, remove the top of the mold. Before you separate the cake from the bottom let it cool for about 5 more minutes so that all the steam can escape and the cake can firm up some more. After removing the rest of the mold, let the cake cool on the rack completely. DO NOT sit the cake upright until completely cooled. Frost with Seven Minute Icing or any other white icing of your choice and decorate to look like a lamb.\n",
    "embedding_ingredients": "cake flour, baking powder, alt, white sugar, butter, milk, vanilla extract, egg whites",
    "features": {
      "preparation_time": "long",
      "prep_time": 75,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Empire Biscuits",
    "ingredients": [
      "2 cups butter, softened",
      "1 cup white sugar",
      "4 cups sifted all-purpose flour",
      "1 cup raspberry preserves",
      "24 maraschino cherries",
      "8 cups confectioners' sugar",
      "1/2 cup milk"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the butter and sugar until smooth. Gradually stir in the flour until well blended. On a lightly floured surface, roll the dough out to 1/4 inch thickness. Cut into rounds using a cookie cutter.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely. Sandwich one teaspoon of jam between two cookies. Repeat with remaining cookies. In a medium bowl, gradually stir the milk into the confectioners' sugar until the icing is of a spreadable consistency. Spread on top of the sandwiched cookies. Top each cookie with half of a cherry while the icing is still wet.\n",
    "embedding_ingredients": "butter, softened, white sugar, sifted all-purpose flour, raspberry preserves, maraschino cherries, confectioners' sugar, milk",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Vanishing Oatmeal Cookies",
    "ingredients": [
      "1 cup margarine, softened",
      "1 cup packed brown sugar",
      "1/2 cup white sugar",
      "2 eggs",
      "1 teaspoon vanilla extract",
      "1 cup raisins",
      "1 cup black walnuts, coarsely ground",
      "1 1/2 cups all-purpose flour",
      "1/2 teaspoon salt",
      "1 teaspoon baking soda",
      "1 teaspoon pumpkin pie spice",
      "3 cups rolled oats"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat margarine and sugars, until creamy. Add eggs and vanilla; beat well. Combine flour, baking soda, salt, and spices. Sift and add to the egg mixture. Stir well.\nGrind the raisins up with 1 teaspoon of sugar until they are in small pieces--not mush! Stir in oats, nuts, raisins and mix well, drop by tablespoonful onto ungreased cookie sheet. Bake 10 to 12 minutes or until light brown. Cool 1 minute and remove to wire rack. When cool store in airtight container. NOTE: You can add butterscotch or chocolate pieces in place of the raisins.\n",
    "embedding_ingredients": "margarine, softened, packed brown sugar, white sugar, eggs, vanilla extract, raisins, black walnuts, coarsely, all-purpose flour, alt, baking soda, pumpkin pie spice, rolled oats",
    "features": {
      "preparation_time": "medium",
      "prep_time": 13,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Peanut Butter Choco Chip Cookies",
    "ingredients": [
      "2 cups peanut butter",
      "2 cups white sugar",
      "4 eggs",
      "2 cups semisweet chocolate chips",
      "1 cup chopped walnuts"
    ],
    "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nIn a medium bowl, combine peanut butter, sugar and eggs. Mix well with wooden spoon till smooth and well-blended. Stir in chocolate chips and nuts.\nDrop by rounded tablespoonfuls on ungreased cookie sheets two inches apart. Bake 10 to 12 minutes or till lightly browned. Cool on cookie sheets for a few minutes than transfer to wire rack. Cool completely. Store in airtight containers up to a week\n",
    "embedding_ingredients": "peanut butter, white sugar, eggs, semisweet chocolate chips, walnuts",
    "features": {
      "preparation_time": "medium",
      "prep_time": 12,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Alfajores Argentinean Style",
    "ingredients": [
      "1 2/3 cups unbleached all-purpose flour",
      "2 1/2 cups cornstarch",
      "1/2 teaspoon baking soda",
      "2 teaspoons baking powder",
      "1 cup unsalted butter, softened",
      "3/4 cup white sugar",
      "3 egg yolks",
      "1 teaspoon vanilla rum",
      "1/2 teaspoon vanilla extract",
      "1/2 teaspoon lemon extract",
      "2 teaspoons lemon zest",
      "1 (11.5 ounce) jar dulce de leche",
      "1/2 cup unsweetened shredded coconut"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper. Whisk together the flour, cornstarch, baking soda, and baking powder; set aside.\nBeat the butter and sugar with an electric mixer in a large bowl until light and fluffy. Add the egg yolks one at a time, allowing each yolk to blend into the butter mixture before adding the next. Beat in the vanilla rum, vanilla extract, lemon extract, and lemon zest with the last egg. Gently fold in the flour mixture with a spoon, making a crumbly dough. When the dough becomes cohesive enough, press it together into a ball with your hands. Wrap with plastic wrap and chill for 30 minutes to 1 hour.\nRoll out the dough, using as little flour as possible, about 1/4 inch thick. The dough will have an unusual consistency. Cut with a small round cookie cutter. Continue pressing the dough together, rolling it out, and cutting until you have used it all. Place cookies 1/2 inch apart on the prepared cookie sheets.\nBake in the preheated oven until set but not browned, 7 to 10 minutes. Remove the cookies immediately to cool on a wire rack.\nSpread the underside of a cooled cookie with a teaspoon of dulce de leche, then sandwich together with another cookie until the caramel oozes out the sides. Roll the sides in the shredded coconut.\n",
    "embedding_ingredients": "unbleached all-purpose flour, cornstarch, baking soda, baking powder, unsalted butter, softened, white sugar, egg yolks, vanilla rum, vanilla extract, lemon extract, lemon zest, jar dulce de leche, unsweetened shredded coconut",
    "features": {
      "preparation_time": "long",
      "prep_time": 100,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Cauliflower and Tofu Masala",
    "ingredients": [
      "1 (16 ounce) package tofu",
      "1/2 cup plain yogurt",
      "2 tablespoons lemon juice",
      "2 teaspoons ground cumin",
      "1/2 teaspoon cayenne pepper",
      "1 teaspoon paprika",
      "1 teaspoon garam masala",
      "1 tablespoon minced fresh ginger root",
      "2 tablespoons unsalted butter",
      "4 cloves garlic, minced",
      "3 serrano peppers, seeded and minced",
      "4 teaspoons ground coriander",
      "2 teaspoons ground cumin",
      "2 teaspoons garam masala",
      "1/2 teaspoon salt",
      "1 (16 ounce) can tomato sauce",
      "1 small head cauliflower, cut into florets",
      "2 cups half-and-half cream",
      "1 cup frozen peas",
      "1/4 cup chopped fresh cilantro"
    ],
    "instructions": "Place the block of tofu onto a plate and place another plate on top. Set a 3 to 5 pound weight on top (a container filled with water works well). Press the tofu for 20 to 30 minutes, then drain off and discard the accumulated liquid.\nPreheat an oven to 375 degrees F (190 degrees C). Grease a baking sheet.\nWhisk the yogurt, lemon juice, 2 teaspoons cumin, cayenne pepper, paprika, 1 teaspoon garam masala, and minced ginger together in a bowl. Cut the tofu into 1/2-inch cubes, and gently stir into the yogurt mixture. Arrange the tofu cubes onto the prepared baking sheet so they do not touch each other.\nBake the tofu in the preheated oven until the tofu has firmed and the sauce is no longer sticky, 45 minutes to 1 hour. Gently turn the tofu every 15 minutes during baking.\nMeanwhile, melt the butter in a large skillet over medium heat. Cook the garlic and serrano peppers in the hot butter until softened, about 3 minutes. Stir in the coriander, 2 teaspoons cumin, 2 teaspoons garam masala, and salt. Cook another minute to release the fragrance of the spices. Add the tomato sauce and cauliflower florets; cover and cook, stirring frequently until the cauliflower is tender, about 15 minutes.\nOnce the cauliflower is tender, stir in the half-and-half, peas, cilantro, and baked tofu cubes. Bring to a simmer, and cook 5 minutes, or until your desired thickness is attained.\n",
    "embedding_ingredients": "package tofu, plain yogurt, lemon juice, cumin, cayenne pepper, paprika, garam masala, fresh ginger root, unsalted butter, loves garlic,, serrano peppers, seeded and, coriander, cumin, garam masala, alt, can tomato sauce, small head cauliflower, cut into florets, half-and-half cream, frozen peas, fresh cilantro",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Carolyn's Oh-So-Easy Cherry Cobbler",
    "ingredients": [
      "1 (15 ounce) can pitted tart red cherries, drained with liquid reserved",
      "1/2 cup white sugar",
      "1 cup buttermilk baking mix",
      "1/2 cup white sugar",
      "1/2 cup milk"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 9x9-inch baking dish with cooking spray.\nStir the liquid from the cherries and 1/2 cup sugar together in a small glass bowl; heat in the microwave until the sugar is dissolved, 1 to 2 minutes. Set aside.\nStir the baking mix, 1/2 cup sugar, and milk together in a separate small bowl; mix until you get a moist batter. Spread the mixture in an even layer in the bottom of the prepared baking dish. Spread the cherries evenly over the batter. Slowly pour the cherry juice over the cherries.\nBake in the preheated oven until lightly browned, 25 to 30 minutes.\n",
    "embedding_ingredients": "can pitted tart red cherries, drained with liquid reserved, white sugar, buttermilk baking mix, white sugar, milk",
    "features": {
      "preparation_time": "medium",
      "prep_time": 32,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Creamy Zucchini and Spinach Rigatoni",
    "ingredients": [
      "8 ounces rigatoni pasta, uncooked",
      "1 teaspoon oil",
      "1 zucchini, sliced",
      "1/2 pound sliced fresh mushrooms",
      "2 cloves garlic, minced",
      "1 tablespoon flour",
      "1/4 teaspoon dried basil leaves",
      "1/4 teaspoon dried oregano leaves",
      "1/4 teaspoon crushed red pepper",
      "1 cup fat-free reduced-sodium chicken broth",
      "1/2 (8 ounce) container PHILADELPHIA Neufchatel Cheese, cubed",
      "1 (6 ounce) package baby spinach leaves",
      "1 1/2 cups KRAFT Grated Parmesan Cheese",
      "1 1/2 cups KRAFT Shredded Mozzarella Cheese with a Touch of PHILADELPHIA, divided"
    ],
    "instructions": "Heat oven to 375 degrees F.\nCook pasta in large saucepan as directed on package, omitting salt.\nMeanwhile, heat oil in large skillet on medium heat. Add zucchini, mushrooms and garlic; cook and stir 3 to 4 min. or until zucchini is crisp-tender. Add flour and seasonings; cook and stir 1 min. Stir in broth; cook and stir 2 to 3 min. or until thickened. Add Neufchatel; cook and stir 2 to 3 min. or until melted.\nDrain pasta; return to pan. Add zucchini mixture, spinach, Parmesan and 1/2 cup mozzarella; mix lightly. Spoon into 2 quart casserole sprayed with cooking spray; top with remaining mozzarella.\nBake 10 min. or until mozzarella is melted.\n",
    "embedding_ingredients": "rigatoni pasta, uncooked, oil, zucchini,, liced fresh mushrooms, loves garlic,, flour, dried basil leaves, dried oregano leaves, red pepper, fat-free reduced-sodium chicken broth, container philadelphia neufchatel cheese, cubed, package baby spinach leaves, kraft parmesan cheese, kraft shredded mozzarella cheese with a touch of philadelphia, divided",
    "features": {
      "preparation_time": "medium",
      "prep_time": 21,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Mexican Venison Skillet",
    "ingredients": [
      "2 tablespoons butter or margarine",
      "1 pound ground venison",
      "2 teaspoons minced garlic",
      "1 onion, chopped",
      "2 tablespoons butter or margarine",
      "1 (7 ounce) box Spanish rice mix",
      "3 cups water",
      "1 (14.5 ounce) can stewed tomatoes, cut up",
      "1/2 cup salsa",
      "1 (15.5 ounce) can kidney beans, rinsed and drained",
      "1 (15.5 ounce) can sweet corn, drained"
    ],
    "instructions": "Melt butter in a large skillet over medium-high heat. Add venison and cook until no longer pink, stirring to break up. Stir in garlic and onion, and continue cooking until the onion has softened and turned translucent, about 2 minutes.\nMeanwhile, melt remaining 2 tablespoons butter in a saucepan over medium heat. Stir in Spanish rice mix, and cook until lightly golden, about 5 minutes. Stir in cooked venison, water, tomatoes, salsa, and kidney beans; bring to a boil, then reduce heat to medium-low and simmer for 15 minutes. Stir in corn, and continue cooking until the rice is tender, about 5 minutes.\n",
    "embedding_ingredients": "butter or margarine, venison, garlic, onion,, butter or margarine, box spanish rice mix, water, can stewed tomatoes, cut up, alsa, can kidney beans, rinsed and drained, can sweet corn, drained",
    "features": {
      "preparation_time": "medium",
      "prep_time": 27,
      "cuisine": "Mexican",
      "complexity": "high"
    }
  },
  {
    "title": "Sausage and Apple Breakfast Casserole",
    "ingredients": [
      "2 large Golden Delicious apples, peeled, chopped",
      "2 tablespoons sugar",
      "1 teaspoon ground cinnamon",
      "8 eggs",
      "3 cups milk",
      "1 teaspoon vanilla",
      "8 cups French bread cubes (3/4-inch pieces)",
      "1 (9.6 ounce) package Jimmy Dean® Original Hearty Pork Sausage Crumbles",
      "2 cups shredded Cheddar cheese, divided"
    ],
    "instructions": "Preheat oven to 325 degrees F. Toss apples with sugar and cinnamon; set aside.\nBeat eggs, milk and vanilla in large bowl with wire whisk until well blended. Add bread cubes, sausage and 1 1/2 cups cheese and apple mixture; stir gently until evenly coated.\nSpoon into lightly greased 13x9-inch baking dish; top with remaining 1/2 cup cheese.\nBake 40-45 minutes or until knife inserted in center comes out clean. Let stand 10 minutes before cutting into 12 squares to serve.\nServe with warm maple syrup.\n",
    "embedding_ingredients": "large golden delicious apples, ,, sugar, cinnamon, eggs, milk, vanilla, french bread cubes, package jimmy dean® original hearty pork sausage crumbles, shredded cheddar cheese, divided",
    "features": {
      "preparation_time": "medium",
      "prep_time": 55,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Sicilian Homemade Ricotta Cheese",
    "ingredients": [
      "1 gallon whole milk",
      "1 quart buttermilk",
      "1 pint heavy cream",
      "1 tablespoon kosher salt",
      "18-inch squares cheesecloth"
    ],
    "instructions": "Line a large colander or sieve with 4 layers of cheesecloth. Set aside.\nHeat milk, buttermilk, heavy cream, and salt in a large, heavy, nonreactive saucepan over medium-low heat, stirring occasionally for the first 10 minutes. Continue heating, without stirring, until the temperature reaches 190 degrees F. Remove from heat and let stand for 1 hour. The mixture will be separated into white curds and clear whey.\nUsing a slotted spoon, ladle approximately 1/4 of the curds into the cheesecloth-lined colander. Gather up the corners of the top cheesecloth and secure closed with a zip tie. Repeat with the rest of the curds, cheesecloth, and zip ties. Use the last zip tie to thread all of the cheeses together. Suspend the cheeses over a large wooden spoon over a large bowl, and let drain for 2 hours.\nPlace the four cheeses, still in cloth, in a bowl in the refrigerator overnight. In the morning, cut zip ties, and transfer cheese to an airtight container.\n",
    "embedding_ingredients": "allon whole milk, quart buttermilk, pint heavy cream, kosher salt, -inch squares cheesecloth",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Mushroom Chicken in Sour Cream Sauce",
    "ingredients": [
      "1 1/2 teaspoons salt",
      "1/4 teaspoon pepper",
      "1/2 teaspoon paprika",
      "1/4 teaspoon lemon pepper",
      "1 teaspoon garlic powder",
      "6 skinless, boneless chicken breasts",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "1 (8 ounce) container sour cream",
      "1/2 cup dry white wine",
      "1 (8 ounce) package sliced fresh mushrooms"
    ],
    "instructions": "Mix the salt, pepper, paprika, lemon pepper, and garlic powder together in a bowl; rub evenly onto all sides of the chicken breasts. Place the seasoned chicken into the bottom of a slow cooker. Add the cream of mushroom soup, sour cream, white wine, and mushrooms to the slow cooker.\nSecure the cover onto the slow cooker and cook on Low for 8 hours.\n",
    "embedding_ingredients": "salt, pepper, paprika, lemon pepper, garlic powder, skinless, boneless chicken breasts, can condensed cream of mushroom soup, container sour cream, dry white wine, package fresh mushrooms",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Turkey Lasagna with Butternut Squash, Zucchini, and Spinach",
    "ingredients": [
      "2 tablespoons vegetable oil",
      "1 onion, diced",
      "4 cloves garlic, chopped",
      "1 (20 ounce) package ground turkey",
      "1 (28 ounce) can crushed tomatoes",
      "3 (6 ounce) cans tomato paste",
      "1 1/2 cups water",
      "1 1/2 teaspoons dried basil",
      "1 teaspoon fennel seeds",
      "1 teaspoon Italian seasoning",
      "1/4 teaspoon ground black pepper",
      "1/4 cup chopped fresh parsley",
      "3 1/2 cups peeled and cubed butternut squash",
      "1 (10 ounce) package fresh spinach",
      "1 (15 ounce) container fat-free ricotta cheese",
      "1 egg",
      "2 tablespoons chopped fresh parsley",
      "1/4 teaspoon ground black pepper",
      "1 (6 ounce) package shredded part-skim mozzarella cheese, divided",
      "9 no-boil lasagna noodles",
      "2 zucchini, sliced lengthwise"
    ],
    "instructions": "Heat the vegetable oil in a large skillet over medium heat; cook the onion and garlic in the hot oil until fragrant, 5 to 7 minutes. Break the turkey into small pieces into the skillet; cook and stir until completely browned, 7 to 10 minutes. Stir the crushed tomatoes, tomato paste, water, basil, fennel seeds, Italian seasoning, 1/4 teaspoon black pepper, and 1/4 cup parsley into the turkey mixture. Reduce heat to medium-low and simmer, stirring occasionally, until the sauce reaches a desired consistency, 60 to 90 minutes.\nWhile the sauce simmers, place the butternut squash in a large, microwave-safe bowl; cover with plastic wrap and cook in microwave on High until tender, about 5 minutes. Set aside.\nCook and stir the spinach in a large skillet over medium heat until wilted, about 5 minutes. Set aside.\nStir the ricotta cheese, egg, 2 tablespoons parsley, 1/4 teaspoon black pepper, and about 2/3 of the mozzarella cheese together in a bowl. Set aside.\nPreheat an oven to 375 degrees F (190 degrees C).\nPour 1 1/2 cups of the sauce into the bottom of a 9x13-inch baking dish. Arrange 3 of the lasagna noodles in a layer over the sauce. Spread 1 cup of the ricotta cheese mixture over the noodles. Sprinkle about half of the butternut squash over the ricotta cheese mixture. Layer about half the wilted spinach over the butternut squash. Lay about half the zucchini slices over the spinach in a layer. Repeat the layering. Top with the 3 remaining lasagna noodles. Spread any remaining ricotta cheese mixture over the top of the lasagna. Finish by topping with any remaining sauce mixture. Cover with aluminum foil.\nBake in the preheated oven for 30 minutes. Remove the aluminum foil and sprinkle the remaining mozzarella over the top of the lasagna. Return to oven and bake uncovered until the top is golden brown, about 30 minutes more. Remove and allow the lasagna to rest 15 minutes before cutting to serve.\n",
    "embedding_ingredients": "vegetable oil, onion,, loves garlic,, package turkey, can tomatoes, cans tomato paste, water, dried basil, fennel seeds, italian seasoning, black pepper, fresh parsley, and cubed butternut squash, package fresh spinach, container fat-free ricotta cheese, egg, fresh parsley, black pepper, package shredded part-skim mozzarella cheese, divided, no-boil lasagna noodles, zucchini, lengthwise",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Lucky and Rippy's Favorite Dog Food",
    "ingredients": [
      "3 pounds minced chicken meat",
      "2 1/2 cups frozen vegetable blend (no garlic or onions), minced",
      "4 cups rice",
      "6 1/2 cups water"
    ],
    "instructions": "Place chicken, vegetables, and rice into a large saucepan or Dutch oven. Stir in water until the mixture is smooth. Place over medium-high heat and bring to a boil, stirring constantly.\nReduce heat to medium-low, cover, and simmer until the rice is tender and all of the liquid has been absorbed, about 25 minutes. Cool completely before serving; store covered in the refrigerator.\n",
    "embedding_ingredients": "chicken meat, frozen vegetable blend ,, rice, water",
    "features": {
      "preparation_time": "medium",
      "prep_time": 25,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Fruity Sweet and Sour Sauce",
    "ingredients": [
      "1/2 cup white sugar, or to taste",
      "1/2 cup white vinegar, or more to taste",
      "1/2 cup maraschino cherry juice",
      "1/2 cup pineapple juice",
      "1 1/2 tablespoons cornstarch",
      "1/4 cup cold water"
    ],
    "instructions": "Mix the sugar, vinegar, maraschino cherry juice, and pineapple juice in a saucepan over medium-low heat, stirring to dissolve the sugar.\nPlace the cornstarch in a small bowl, and stir the water into it to make a smooth paste. Stir the cornstarch paste into the juice mixture, and bring to a simmer. Stir constantly until the mixture thickens, about 1 minute.\n",
    "embedding_ingredients": "white sugar, or to taste, white vinegar, or more to taste, maraschino cherry juice, pineapple juice, cornstarch, cold water",
    "features": {
      "preparation_time": "medium",
      "prep_time": 1,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Perfect Chicken",
    "ingredients": [
      "2 cups chicken broth",
      "1/2 cup chopped onion",
      "2 cloves garlic, minced",
      "1 cup white wine",
      "1/2 cup sliced fresh mushrooms, or more to taste",
      "1 teaspoon dried rosemary",
      "1 teaspoon dried sage",
      "1 cup heavy cream",
      "2 tablespoons butter",
      "1/2 lemon, juiced",
      "1 tablespoon capers, drained",
      "1/2 cup cornstarch, or as needed",
      "4 skinless, boneless chicken thighs",
      "2 tablespoons olive oil"
    ],
    "instructions": "Pour the chicken broth into a saucepan with the onion and garlic; bring to a boil and cook at a boil until the liquid reduces by half, about 10 minutes. Pour in the white wine, return to a boil, and reduce the liquid by half again, about 10 minutes. Stir in mushrooms, rosemary, and sage; simmer until the mushrooms are tender and have given up their juice, about 15 more minutes. Stir in cream, butter, lemon, and capers; reduce heat and simmer the sauce until thickened, about 10 minutes (45 minutes in all).\nPreheat oven to 350 degrees F (175 degrees C).\nPlace the cornstarch into a shallow bowl and press the chicken thighs into the cornstarch on all sides until thoroughly coated. Shake off excess cornstarch. Heat the olive oil in a skillet over medium heat; pan-fry the chicken thighs until they develop a golden brown crust, about 8 minutes per side. Place the chicken thighs into a 9x9-inch baking dish and pour the sauce over the chicken.\nBake in the preheated oven until the sauce is bubbling and the chicken is no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center of a chicken thigh should read at least 165 degrees F (74 degrees C).\n",
    "embedding_ingredients": "chicken broth, onion, loves garlic,, white wine, liced fresh mushrooms, or more to taste, dried rosemary, dried sage, heavy cream, butter, lemon, juiced, capers, drained, cornstarch, or as needed, skinless, boneless chicken thighs, olive oil",
    "features": {
      "preparation_time": "long",
      "prep_time": 98,
      "cuisine": "Mediterranean",
      "complexity": "high"
    }
  },
  {
    "title": "Butternut Squash-Sweet Potato Ginger Bisque",
    "ingredients": [
      "1 (2 pound) butternut squash - peeled, seeded, and cut into large chunks",
      "4 sweet potatoes, peeled and cut into chunks",
      "1 onion, peeled and chopped",
      "1 (2 inch) piece fresh ginger, peeled and finely chopped",
      "3 cloves garlic, peeled and chopped",
      "1 1/2 quarts water, or amount to cover",
      "1 cup plain yogurt, or amount desired (optional)",
      "salt and ground black pepper to taste"
    ],
    "instructions": "Place the squash, sweet potatoes, onion, ginger, and garlic in a large pot. Pour in enough water to cover the vegetables. Bring to simmer over medium heat, and cook until vegetables are tender and can be easily pierced with a fork, 30 to 45 minutes.\nRemove pot from heat. Place soup in batches into a blender or the bowl of a food process. Pulse until smooth. Return soup to pot, and whisk in yogurt. Season with salt and pepper to taste. If necessary, reheat soup over low heat, but do not allow to boil.\n",
    "embedding_ingredients": "butternut squash - , seeded, and cut into large chunks, sweet potatoes, and cut into chunks, onion, and, piece fresh ginger, and finely, loves garlic, and, quarts water, or amount to cover, plain yogurt, or amount desired, salt and black pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "Asian",
      "complexity": "medium"
    }
  },
  {
    "title": "Wilted Spinach with Cherries and Goat Cheese",
    "ingredients": [
      "1 tablespoon olive oil",
      "2 cloves garlic, minced",
      "1 small onion, chopped",
      "1/4 cup dried cherries",
      "1 cup sliced fresh mushrooms",
      "1 (10 ounce) bag fresh baby spinach",
      "2 tablespoons crumbled goat cheese"
    ],
    "instructions": "Heat olive oil in a large skillet over very low heat. Add garlic, onion, cherries, and mushrooms; cook and stir, without browning garlic, until onion is tender, about 5 minutes. Toss in spinach, and cook and stir until spinach is just wilted, about 3 minutes.\nRemove from heat. Top with crumbled goat cheese just before serving.\n",
    "embedding_ingredients": "olive oil, loves garlic,, small onion,, dried cherries, liced fresh mushrooms, bag fresh baby spinach, crumbled goat cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 8,
      "cuisine": "Mediterranean",
      "complexity": "medium"
    }
  },
  {
    "title": "Sean's Mommy's Roasted Root Vegetables",
    "ingredients": [
      "1 butternut squash - peeled, seeded and cut into 1-inch dice",
      "3 carrots, cut into 1 inch pieces",
      "1 large sweet potato, cut into 1-inch cubes",
      "1 rutabaga, peeled and cut into 1-inch pieces",
      "3 parsnips, peeled and cubed",
      "3 turnips, peeled and cut into 1-inch dice",
      "1/4 cup extra virgin olive oil",
      "kosher salt and pepper to taste"
    ],
    "instructions": "Preheat an oven to 450 degrees F (230 degrees C).\nPlace the butternut squash, carrots, sweet potato, rutabaga, parsnips, and turnips into a large mixing bowl. Drizzle with olive oil, and toss to coat. Season to taste with kosher salt and pepper, and place the vegetables into a deep roasting pan.\nRoast in the preheated oven until the vegetables have lightly browned around the edges and are tender, about 45 minutes. Stir once as the vegetables roast to ensure even cooking.\n",
    "embedding_ingredients": "butternut squash - , seeded and cut into -inch dice, arrots, cut into pieces, large sweet potato, cut into -inch cubes, rutabaga, and cut into -inch pieces, parsnips, and cubed, turnips, and cut into -inch dice, extra virgin olive oil, kosher salt and pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "Mediterranean",
      "complexity": "medium"
    }
  },
  {
    "title": "Chicken Wilson",
    "ingredients": [
      "6 eggs, lightly beaten",
      "3 pounds skinless, boneless chicken breast halves - cut into cubes",
      "6 tablespoons butter",
      "1 pound mushrooms, sliced",
      "1 cup seasoned bread crumbs",
      "Vegetable oil",
      "6 fluid ounces dry white wine",
      "1/2 pound sliced Muenster cheese"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLightly beat eggs in a small bowl. Soak the chicken pieces in the egg for at least 30 minutes. Meanwhile, melt the butter in a large skillet and add the mushrooms. Cook and stir the sliced mushrooms until softened.\nRemove the chicken from the egg mixture. Roll the chicken pieces in bread crumbs and set aside. Heat a small amount of oil in a large skillet over medium-high. Place the chicken pieces in the pan and brown on all sides. Brown the pieces in batches if necessary.\nPlace the browned chicken pieces in a 9x13 inch glass baking dish. Cover the chicken with the sauteed mushrooms. Pour the wine into the baking dish, then cover the mixture with the sliced cheese.\nBake in preheated oven for 30 to 40 minutes, or until the chicken is cooked through.\n",
    "embedding_ingredients": "eggs, lightly beaten, skinless, boneless chicken breast halves - cut into cubes, butter, mushrooms,, easoned bread crumbs, vegetable oil, fluid ounces dry white wine, liced muenster cheese",
    "features": {
      "preparation_time": "long",
      "prep_time": 70,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Black Bean and Chickpea Chili",
    "ingredients": [
      "1 1/2 tablespoons olive oil",
      "1 pound ground turkey (optional)",
      "1 onion, chopped",
      "2 green bell peppers, seeded and chopped",
      "5 carrots, peeled and sliced into rounds",
      "1 tablespoon chili powder",
      "1 1/2 teaspoons ground cumin",
      "1 teaspoon ground black pepper",
      "2 (14.5 ounce) cans canned diced tomatoes with their juice",
      "1 cup frozen corn",
      "1 (15 ounce) can black beans, drained and rinsed",
      "1 (15 ounce) can garbanzo beans, drained and rinsed",
      "1 1/2 cups chicken broth"
    ],
    "instructions": "If using turkey, heat oil in a large saucepan over medium-high heat, and cook and stir the ground turkey for about 10 minutes, breaking it up with a spoon as it cooks, until the meat is no longer pink. Remove the turkey meat and set aside, leaving oil in the pan.\nPlace the onion, green peppers, and carrots into the saucepan, and cook and stir for about 10 minutes, until the onion is translucent and the vegetables are tender. Stir in the chili powder, cumin, and black pepper, and pour in the diced tomatoes, frozen corn, black beans, garbanzo beans, and chicken broth. Bring the mixture to a boil.\nPlace about 1 1/2 cups of the chili mixture into a food processor, and puree for about 1 minute until smooth. Pour the puree back into the rest of the chili to thicken. Add the cooked turkey meat, and bring the chili back to a simmer over medium-low heat.\n",
    "embedding_ingredients": "olive oil, turkey, onion,, reen bell peppers, seeded and, arrots, and into rounds, chili powder, cumin, black pepper, cans canned tomatoes with their juice, frozen corn, can black beans, drained and rinsed, can garbanzo beans, drained and rinsed, chicken broth",
    "features": {
      "preparation_time": "medium",
      "prep_time": 21,
      "cuisine": "Indian",
      "complexity": "high"
    }
  },
  {
    "title": "Tropical Grilled Chicken Breast",
    "ingredients": [
      "1/2 cup orange juice",
      "1/2 lime, juiced",
      "1 tablespoon honey",
      "1 teaspoon crushed red pepper flakes",
      "4 (6 ounce) skinless, boneless chicken breast halves",
      "1 tablespoon chopped fresh cilantro"
    ],
    "instructions": "Whisk together the orange juice, lime juice, honey, and red pepper flakes in a bowl, and pour into a resealable plastic bag. Add the chicken, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 30 minutes.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nRemove the chicken from the marinade, and shake off excess. Discard the remaining marinade. Place the chicken on the grill and cook the chicken breasts until no longer pink in the center and the juices run clear, about 6 to 8 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Top with cilantro and serve.\n",
    "embedding_ingredients": "orange juice, lime, juiced, honey, red pepper flakes, skinless, boneless chicken breast halves, fresh cilantro",
    "features": {
      "preparation_time": "medium",
      "prep_time": 38,
      "cuisine": "Mexican",
      "complexity": "medium"
    }
  },
  {
    "title": "Summer Feta Burger with Gourmet Cheese Spread",
    "ingredients": [
      "1 (8 ounce) package cream cheese, softened",
      "1 clove garlic, minced",
      "2 tablespoons chopped fresh basil",
      "1 tablespoon chopped fresh dill",
      "2 tablespoons extra virgin olive oil",
      "1 clove garlic, minced",
      "1 red onion, minced",
      "1 3/4 pounds ground beef",
      "1/4 pound ground pork sausage",
      "1 1/2 cups crumbled feta",
      "1/4 cup red wine",
      "1 egg",
      "1 teaspoon salt",
      "1 teaspoon fresh-ground black pepper",
      "1 large heirloom tomato, sliced",
      "1 medium red onion, sliced",
      "8 leaves green leaf lettuce leaves",
      "8 Kaiser rolls, split"
    ],
    "instructions": "In a medium bowl, combine cream cheese, 1 clove minced garlic, basil, and dill. Cover and set aside.\nHeat the olive oil in a medium skillet over medium heat and cook 1 clove minced garlic and onion for 4 to 6 minutes, or until translucent. Remove from heat and allow to cool.\nPreheat an outdoor grill for high heat and lightly oil grate.\nWhile the grill is heating, gently mix together the cooked garlic and onion, ground beef, pork sausage, feta cheese, red wine, egg, salt, and pepper in a large bowl. Do not over work the meat mixture. Divide into 8 equal parts and form into patties.\nGrill patties on preheated grill for 5 to 10 minutes per side, until well done. Toast the split buns on the grill for 1 to 2 minutes. Assemble the burgers by spreading 1 1/2 tablespoon of the cheese and herb spread to both the top and bottom of each roll. Place patties on the bottom half of the rolls and stack a slice of tomato, sliced red onion, and a leaf of lettuce on each burger. Add the roll tops and serve.\n",
    "embedding_ingredients": "package cream cheese, softened, love garlic,, fresh basil, fresh dill, extra virgin olive oil, love garlic,, red onion,, beef, pork sausage, crumbled feta, red wine, egg, alt, fresh- black pepper, large heirloom tomato,, medium red onion,, leaves green leaf lettuce leaves, kaiser rolls, split",
    "features": {
      "preparation_time": "medium",
      "prep_time": 18,
      "cuisine": "Mediterranean",
      "complexity": "high"
    }
  },
  {
    "title": "Sausage Cheese Grits",
    "ingredients": [
      "1 pound bulk spicy pork sausage",
      "4 cups water",
      "1 cup quick-cooking grits",
      "4 ounces shredded Gouda cheese",
      "3 tablespoons butter",
      "1/4 teaspoon hot pepper sauce",
      "3 eggs, beaten"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCook the sausage in a large skillet over medium-high heat, stirring until the sausage is crumbly and lightly browned. Drain off the grease and place the sausage in a bowl. Meanwhile, bring the water to a boil in a large saucepan over high heat. Stir in the grits, and reduce heat to medium-low. Cook and stir constantly for 5 minutes until the grits are tender, or follow package directions.\nStir together the sausage, cheese, butter, hot pepper sauce, and eggs. Fold in the grits until combined, then spread into an ungreased, small casserole dish. Bake in the preheated oven until golden brown on top, 30 to 40 minutes.\n",
    "embedding_ingredients": "bulk spicy pork sausage, water, quick-cooking grits, shredded gouda cheese, butter, hot pepper sauce, eggs, beaten",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Chocolate Balls",
    "ingredients": [
      "1 cup peanut butter",
      "3/4 cup confectioners' sugar",
      "1 cup graham cracker crumbs",
      "2 cups semisweet chocolate chips",
      "3 (1 ounce) squares semisweet chocolate, chopped",
      "1 tablespoon shortening"
    ],
    "instructions": "In a medium bowl, mix together the peanut butter and confectioners' sugar until smooth. Stir in graham cracker crumbs until well blended. Form the dough into 1 inch balls by rolling in your hands, or by using a cookie scoop.\nMelt the semisweet chocolate chips, semisweet chocolate squares, and the shortening in the top half of a double boiler. Use a fork to dip the balls into the melted chocolate, and place on wax paper to cool until set.\n",
    "embedding_ingredients": "peanut butter, confectioners' sugar, graham cracker crumbs, semisweet chocolate chips, squares semisweet chocolate,, hortening",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Chocolate Chip Kiss Cookies",
    "ingredients": [
      "48 milk chocolate candy kisses, unwrapped",
      "1 cup butter, softened",
      "1/3 cup white sugar",
      "1/3 cup packed brown sugar",
      "1 teaspoon vanilla extract",
      "2 cups all-purpose flour",
      "1 cup mini semi-sweet chocolate chips"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn large mixing bowl, beat butter or margarine, sugar, brown sugar and vanilla until well blended. Add flour, blend until smooth. Stir in small chocolate chips.\nUnwrap chocolate kiss candies. Mold scant tablespoons of dough around each chocolate piece, covering completely. Shape into balls; place on ungreased cookie sheet.\nShape into balls; place on ungreased cookie sheet. Bake 10 to 12 minutes or until set. Cool slightly; remove from cookie sheet to wire rack. Cool completely. NOTE: I buy chocolate dessert topping and drizzle over cooled cookies.\n",
    "embedding_ingredients": "milk chocolate candy kisses, unwrapped, butter, softened, white sugar, packed brown sugar, vanilla extract, all-purpose flour, mini semi-sweet chocolate chips",
    "features": {
      "preparation_time": "medium",
      "prep_time": 12,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Daniel's Favorite Cheesecake",
    "ingredients": [
      "2 (8 ounce) packages cream cheese, softened",
      "3/4 cup white sugar",
      "1 1/2 tablespoons vanilla extract",
      "1 egg",
      "1/4 cup all-purpose flour",
      "1/2 cup milk",
      "1 (9 inch) graham cracker crust"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together cream cheese, sugar, and egg by hand. Gradually mix in flour. Stir in vanilla. Blend in milk until smooth; add more liquid if batter is too thick to pour. Pour into graham or pastry shell.\nBake for 40 minutes, or until top is golden brown. Refrigerate overnight.\n",
    "embedding_ingredients": "packages cream cheese, softened, white sugar, vanilla extract, egg, all-purpose flour, milk, graham cracker crust",
    "features": {
      "preparation_time": "medium",
      "prep_time": 40,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Carrot Cake IV",
    "ingredients": [
      "1 (18.5 ounce) package carrot cake mix",
      "1/2 cup water",
      "1/2 cup vegetable oil",
      "3 eggs",
      "1/2 cup finely chopped walnuts",
      "1 (8 ounce) can crushed pineapple with juice"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 8 inch round pans.\nIn large bowl, blend cake mix, oil, water, undrained pineapple, eggs, and nuts. Beat for 2 minutes with an electric mixer at medium speed. Spread batter into prepared pans.\nBake for 35 to 40 minutes, or until a toothpick inserted in the center comes out clean. Cool. Frost with cream cheese frosting.\n",
    "embedding_ingredients": "package carrot cake mix, water, vegetable oil, eggs, finely walnuts, can pineapple with juice",
    "features": {
      "preparation_time": "medium",
      "prep_time": 42,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Busia's Cutout Cookies",
    "ingredients": [
      "2/3 cup butter",
      "1 cup white sugar",
      "1/4 cup milk",
      "2 eggs",
      "1 teaspoon vanilla extract",
      "1/4 teaspoon salt",
      "1 teaspoon baking soda",
      "4 cups all-purpose flour"
    ],
    "instructions": "Cream butter and sugar. Beat in eggs.\nDissolve the baking soda in the milk, then add to mixture. Add the vanilla and mix well\nPlace salt in with flour and slowly stir into mixture. The dough should not be too sticky and should pull away from the sides of the bowl easily. If the dough is sticky, add a little more flour.\nForm the dough into a roll about a foot long and 2-3 inches in diameter. Roll up in wax paper and put in the refrigerator for 1 hour.\nRemove from refrigerator and let dough come to room temperature. Roll out dough a chunk at a time (one dough log makes about 4 chunks).\nPreheat oven to 350 degrees F (180 degrees C).\nCut your cookies and decorate or bake plain for 8-10 minutes. Enjoy!\n",
    "embedding_ingredients": "butter, white sugar, milk, eggs, vanilla extract, alt, baking soda, all-purpose flour",
    "features": {
      "preparation_time": "long",
      "prep_time": 70,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Spicy Pear Cookies",
    "ingredients": [
      "1/2 cup butter, softened",
      "1 1/2 cups packed brown sugar",
      "1 egg",
      "1 teaspoon vanilla extract",
      "2 cups all-purpose flour",
      "1 1/2 teaspoons baking powder",
      "1 teaspoon ground cinnamon",
      "1 teaspoon ground ginger",
      "1 pear - peeled, cored and diced",
      "1/2 cup raisins",
      "1/2 cup chopped walnuts",
      "1 1/2 cups confectioners' sugar",
      "2 1/2 tablespoons lemon juice"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn large bowl, beat margarine and sugar untill smooth. Beat in egg and vanilla. Combine flour, baking powder, cinnamon, and ginger; mix into batter. Stir in chopped pears, chopped nuts and raisins.\nDrop about two inches apart by rounded tablespoonfuls onto baking sheets and bake 15 minutes or until edges are golden brown and center springs back when lightly touched. Remove to wire racks to cool.\nCombine confectioners' sugar and lemon juice and mix until smooth. Spoon icing over coookies.\n",
    "embedding_ingredients": "butter, softened, packed brown sugar, egg, vanilla extract, all-purpose flour, baking powder, cinnamon, ginger, pear - , cored and, raisins, walnuts, confectioners' sugar, lemon juice",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Johnny Cake",
    "ingredients": [
      "1 cup cornmeal",
      "1/2 cup milk",
      "1/2 cup shortening",
      "1/2 cup white sugar",
      "1 1/3 cups cake flour",
      "2 1/2 teaspoons baking powder",
      "1 teaspoon salt",
      "1 egg",
      "1 cup milk"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease thoroughly an 8 inch square cake pan.\nCombine cornmeal and milk. Sift flour, baking powder, and salt. Stir together the egg and milk.\nCream shortening, and blend in sugar. Stir flour mixture and egg mixture alternately into creamed mixture alternately. Blend in cornmeal mixture.\nBake for 40 to 45 minutes. Serve hot, with maple syrup.\n",
    "embedding_ingredients": "cornmeal, milk, hortening, white sugar, cake flour, baking powder, alt, egg, milk",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Cannoli",
    "ingredients": [
      "1 cup confectioners' sugar",
      "1 pint part-skim ricotta cheese",
      "1/2 cup blanched slivered almonds",
      "1/3 cup mini semi-sweet chocolate chips",
      "1 tablespoon amaretto liqueur",
      "12 cannoli shells",
      "1 tablespoon confectioners' sugar",
      "1 tablespoon unsweetened cocoa powder",
      "12 maraschino cherries"
    ],
    "instructions": "In a large bowl, stir ricotta cheese with 1 cup confectioners sugar until combined. Add almonds, chocolate chips and almond liqueur.\nCarefully spoon into cannoli shells (or pipe from a pastry bag), filling from the center out.\nSprinkle individual serving plates with powdered sugar and cocoa, or sprinkle on cannoli. Garnish plates with cherries.\nNote: 1/8 teaspoon almond extract mixed with 1 tablespoon water can be substituted for the almond liqueur.\n",
    "embedding_ingredients": "confectioners' sugar, pint part-skim ricotta cheese, blanched slivered almonds, mini semi-sweet chocolate chips, amaretto liqueur, annoli shells, confectioners' sugar, unsweetened cocoa powder, maraschino cherries",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Eggless Milkless Butterless Cake",
    "ingredients": [
      "1 cup white sugar",
      "2 tablespoons shortening",
      "1/2 teaspoon ground cinnamon",
      "1/2 teaspoon ground nutmeg",
      "1/2 teaspoon ground allspice",
      "1/2 teaspoon salt",
      "1 cup raisins",
      "1 1/2 cups water",
      "1 teaspoon baking soda",
      "2 cups all-purpose flour",
      "1 teaspoon baking powder"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 8 or 9 inch square cake pan.\nIn a saucepan over medium high heat combine; the sugar, shortening, ground cinnamon, ground nutmeg, ground allspice, salt, raisins, and water bring to a boil and continue boiling for 5 minutes. Remove from heat and let cool.\nSift the flour, baking powder and baking soda together. Add the flour mixture to the cooled raisin mixture. Stir until just combined. Pour batter into prepared pan.\nBake at 350 degrees F (175 degrees C) for 20 minutes.\n",
    "embedding_ingredients": "white sugar, shortening, cinnamon, nutmeg, allspice, alt, raisins, water, baking soda, all-purpose flour, baking powder",
    "features": {
      "preparation_time": "medium",
      "prep_time": 25,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Paska Bread",
    "ingredients": [
      "For the Sponge:",
      "2 (.25 ounce) packages active dry yeast",
      "1/2 cup warm water (110 degrees F/45 degrees C)",
      "1/2 cup white sugar",
      "3 cups warm milk",
      "4 cups all-purpose flour",
      "For the Dough:",
      "6 eggs, beaten",
      "1/2 cup white sugar",
      "1 cup butter, softened",
      "1/4 teaspoon salt",
      "1/4 teaspoon lemon zest",
      "12 cups all-purpose flour",
      "1 egg",
      "1 tablespoon water",
      "2 tablespoons butter, melted"
    ],
    "instructions": "Proof the yeast in 1/2 cup warm water in a large bowl until slightly frothy.\nIn the meantime, dissolve 1/2 cup sugar in the warm milk; allow to cool to lukewarm. Once cooled, add the milk mixture to the yeast mixture along with 4 cups of flour. Mix well with a wooden spoon. Cover and put in a dark, warm place until the mixture is bubbly and doubled in size, about 2 hours.\nStir in the beaten eggs, 1/2 cup sugar, 1 cup butter, salt, and lemon peel. Stir well to blend. Begin adding the remaining flour a cup at a time to form a very soft dough.\nKnead the dough on a floured board until soft and elastic, about 10 minutes. Place the dough in a greased bowl, turning to coat all sides. Cover bowl with plastic wrap and allow to rise in a warm place until doubled, about 2 hours. Punch dough down, and allow to rise again for 30 minutes.\nDivide dough into three parts (see Cook's Note). Shape into slightly rounded loaves, and place on greased baking sheets. Let rise until doubled, about 45 minutes to 1 hour. Beat 1 egg with 1 tablespoon water; brush onto loaves.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until loaves are deep brown, 45 to 50 minutes. Once they are done, brush the tops with melted butter for a soft crust.\n",
    "embedding_ingredients": "for the sponge:, packages active dry yeast, warm water, white sugar, warm milk, all-purpose flour, for the dough:, eggs, beaten, white sugar, butter, softened, alt, lemon zest, all-purpose flour, egg, water, butter, melted",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Overnight Pork Roast With Cabbage",
    "ingredients": [
      "4 teaspoons caraway seeds, crushed and divided",
      "2 cloves garlic, minced",
      "2 teaspoons salt",
      "1 teaspoon ground black pepper",
      "3 pounds boneless pork loin roast",
      "3 tablespoons olive oil, divided",
      "1 onion, thinly sliced",
      "4 carrots",
      "2 bay leaves",
      "2 1/2 pounds shredded fresh cabbage",
      "1 (12 fluid ounce) can or bottle beer",
      "2 tablespoons molasses",
      "1 cup beef broth",
      "4 potatoes, cooked and mashed",
      "salt and pepper to taste"
    ],
    "instructions": "In a small bowl, combine 2 teaspoons of the crushed caraway seeds, garlic, salt and ground black pepper. Rub the pork with the dry rub mixture, cover and refrigerate for 24 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat 1 tablespoon of the oil in a large skillet over medium high heat. Add the onion, carrots, bay leaves, 1 teaspoon of the crushed caraway seeds and salt and pepper to taste. Saute for 8 minutes, or until vegetables are tender. Transfer this to a 10x15 inch roasting pan.\nIn the same skillet over high heat, combine 1/2 tablespoon of the olive oil, half (1 1/4 pounds) of the cabbage, and 1/2 teaspoon crushed caraway seeds. Saute, stirring often, until this cooks down, about 5 to 10 minutes. Transfer this to the roasting pan and repeat with another 1/2 tablespoon of oil, the remaining half (1 1/4 pounds) of the cabbage, and the remaining crushed caraway seeds. Once cooked down, transfer this to the roasting pan.\nHeat the remaining olive oil in the same skillet over medium high heat. Place the pork loin in the heated oil and brown well on all sides. Set the roast on top of all the vegetables in the roasting pan. Add the beer and molasses to the skillet and bring to a boil, scraping up all the browned bits on the bottom of the skillet. Pour this and the broth over the pork roast and vegetables. Season with salt and pepper to taste.\nBake at 350 degrees F (175 degrees C) for 45 minutes. Turn pork over and bake until the internal temperature of the pork reaches 145 degrees F (63 degrees C). At this point, remove the pan from the oven and let the pork sit on a cutting board for 5 minutes. Then slice the pork into serving size pieces. Discard the bay leaves. Return the sliced pork to the pan resting over the vegetables. Top off with the mashed potatoes.\nBake at 350 degrees F (175 degrees C) for 10 to 15 minutes, or until potatoes are lightly browned.\n",
    "embedding_ingredients": "caraway seeds, and divided, loves garlic,, salt, black pepper, boneless pork loin roast, olive oil, divided, onion, thinly, arrots, bay leaves, shredded fresh cabbage, can or bottle beer, molasses, beef broth, potatoes, cooked and mashed, salt and pepper to taste",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Mediterranean",
      "complexity": "high"
    }
  },
  {
    "title": "Fluffy Boiled Icing",
    "ingredients": [
      "1 cup white sugar",
      "1/3 cup water",
      "1 tablespoon light corn syrup",
      "1/8 teaspoon salt",
      "2 egg whites",
      "1 teaspoon vanilla extract",
      "3 tablespoons confectioners' sugar"
    ],
    "instructions": "Combine sugar, water, corn syrup, and salt in a saucepan; stir until well blended. Boil slowly without stirring until mixture will spin a long thread when a little is dropped from a spoon (hold the spoon high above saucepan), or reaches 238 - 242 degrees F (114 - 117 degrees C).\nIn a large bowl, beat egg whites with a mixer until they are stiff, but still moist. Pour hot syrup slowly over egg whites while beating. Continue until mixture is very fluffy, and will hold its shape. Add vanilla, and beat until blended. If icing does not seem stiff enough, beat in 2 or 3 tablespoons confectioners sugar 1 tablespoon at a time until stiff enough to hold its shape. Spread on cake.\n",
    "embedding_ingredients": "white sugar, water, light corn syrup, alt, egg whites, vanilla extract, confectioners' sugar",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Liz's Astounding Chocolate Chip Cookies",
    "ingredients": [
      "1/2 cup shortening",
      "1/4 cup packed brown sugar",
      "1/2 cup white sugar",
      "1 egg",
      "1 teaspoon vanilla extract",
      "1 1/8 cups all-purpose flour",
      "1/4 teaspoon salt",
      "1/4 teaspoon baking soda",
      "1 1/4 cups semisweet chocolate chips"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, cream shortening and sugars. Add beaten egg and vanilla, mix well. Sift flour, baking soda and salt together. Stir into creamed mixture; blend thoroughly. Fold in chocolate chips.\nDrop by teaspoon onto cookie sheets. Bake in oven for 6-9 minutes, depending on size. Do not overbake. Cookies should be a little brown around the edges when taken out. Let cookies cool for a few minutes before removing from baking sheet. Finish cooling on rack. NOTE: If you use miniature chocolate chips, you can decrease the amount needed in recipe from 11/4 cups to 1 cup and not affect the quality of the cookies.\n",
    "embedding_ingredients": "hortening, packed brown sugar, white sugar, egg, vanilla extract, all-purpose flour, alt, baking soda, semisweet chocolate chips",
    "features": {
      "preparation_time": "medium",
      "prep_time": 9,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Chocolate Cream Frosting",
    "ingredients": [
      "2 (1 ounce) squares unsweetened chocolate, melted and cooled",
      "1 (14 ounce) can sweetened condensed milk",
      "1/2 cup water",
      "1/2 teaspoon vanilla extract",
      "1 (3.9 ounce) package instant chocolate pudding mix",
      "1 cup heavy cream, whipped"
    ],
    "instructions": "Blend the melted chocolate and milk. Gradually mix in the water, vanilla, and pudding mix, and whisk until smooth. Fold in the heavy cream. Frost the cake immediately, and chill at least 30 minutes before serving.\n",
    "embedding_ingredients": "squares unsweetened chocolate, melted and cooled, can sweetened condensed milk, water, vanilla extract, package instant chocolate pudding mix, heavy cream, whipped",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Pink Princess Cake",
    "ingredients": [
      "1 (18.25 ounce) package white cake mix",
      "1 (3 ounce) package strawberry flavored Jell-O®",
      "2 tablespoons all-purpose flour",
      "1 (10 ounce) package frozen strawberries, thawed and drained",
      "1/2 cup vegetable oil",
      "4 eggs"
    ],
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease one 9 or 10 inch bundt or tube pan.\nCombine the cake mix, gelatin, flour, eggs and thawed strawberries. Beat at medium speed of an electric mixer for 3 minutes. Add the oil and beat for one more minute. Pour batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 35 to 40 minutes. Let cake cool before frosting or serving.\n",
    "embedding_ingredients": "package white cake mix, package strawberry flavored jell-o®, all-purpose flour, package frozen strawberries, thawed and drained, vegetable oil, eggs",
    "features": {
      "preparation_time": "medium",
      "prep_time": 43,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Carrot Cake VIII",
    "ingredients": [
      "1 pound carrots",
      "2 cups white sugar",
      "1 (8 ounce) can crushed pineapple with juice",
      "3/4 cup vegetable oil",
      "1/2 cup unsweetened applesauce",
      "4 eggs",
      "1 tablespoon vanilla extract",
      "1/2 cup flaked coconut",
      "1/2 cup chopped walnuts",
      "1/2 cup raisins",
      "1 1/2 tablespoons pumpkin pie spice",
      "2 teaspoons baking soda",
      "1 teaspoon salt",
      "3 cups all-purpose flour",
      "1 (8 ounce) package cream cheese",
      "3 tablespoons unsalted butter, softened",
      "1 1/2 cups confectioners' sugar",
      "1 1/2 teaspoons orange zest",
      "1 tablespoon fresh orange juice"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat Bundt pan with vegetable oil spray. Flour pan and tap out excess flour.\nIn a medium bowl, sift together flour, salt, soda and pumpkin pie spice. Set aside. In a separate bowl, combine coconut, walnuts and raisins. Set aside.\nGrate carrots (to make 3 cups). Set aside.\nIn a large bowl, combine sugar, pineapple with juice, oil and applesauce. Beat on high speed for 3 minutes. Beat in eggs one at a time. Add vanilla and carrots.\nAdd flour mixture and beat on low speed until combined. Add coconut, walnuts and raisins and combine.\nPut batter into 10 inch Bundt pan. Bake at 350 degrees F (175 degrees C) for 60 to 70 minutes, or until toothpick inserted into center of cake comes out clean. Cool in pan on wire rack. Invert onto serving plate. Frost, and refrigerate one hour.\nTo make the frosting: In a large bowl, combine cream cheese, butter, confectioners sugar, orange zest and juice. Beat until smooth.\n",
    "embedding_ingredients": "carrots, white sugar, can pineapple with juice, vegetable oil, unsweetened applesauce, eggs, vanilla extract, flaked coconut, walnuts, raisins, pumpkin pie spice, baking soda, alt, all-purpose flour, package cream cheese, unsalted butter, softened, confectioners' sugar, orange zest, fresh orange juice",
    "features": {
      "preparation_time": "long",
      "prep_time": 73,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Faux-reos",
    "ingredients": [
      "2 (18.25 ounce) packages devil's food cake mix",
      "1 1/2 cups shortening",
      "4 eggs",
      "1 teaspoon vanilla extract"
    ],
    "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nCombine all ingredients and mix well. Batter will be thick.\nRoll dough into balls the size of nickels. Place on greased cookie sheets about 2 inches apart. Bake for 8 to 10 minutes.\nWhen cookies are cool, frost the bottoms of half of the cookies with Faux-reo filling(see footnote) and stick bottom-to-bottom with another unfrosted cookie.\n",
    "embedding_ingredients": "packages devil's food cake mix, shortening, eggs, vanilla extract",
    "features": {
      "preparation_time": "medium",
      "prep_time": 10,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Microwave Cake",
    "ingredients": [
      "1 (18.25 ounce) package yellow cake mix",
      "3 eggs",
      "1 (21 ounce) can apple pie filling",
      "1/2 cup applesauce"
    ],
    "instructions": "Mix the box of cake mix, eggs, pie filling and applesauce till moist. Use a microwave safe bundt pan or substitute a microwave safe bowl that has a microwave safe cup or cone placed in the middle of it (to mimic a bundt pan). Pour mixture into the bowl around the cup.\nBake on high for 6 minutes 30 seconds, turn and bake for another 6 minutes 30 seconds on high. Remove from oven and cover bowl with a dish and let stand for 5 minutes (this finishes the cooking process).\nTurn cake over onto dish and remove cone (cup) for a delicious quick dessert. Good hot with vanilla ice cream or whipped topping.\n",
    "embedding_ingredients": "package yellow cake mix, eggs, can apple pie filling, applesauce",
    "features": {
      "preparation_time": "medium",
      "prep_time": 17,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Raspberry Squares II",
    "ingredients": [
      "6 ounces raspberry jam",
      "1 cup chopped walnuts",
      "2 1/4 cups all-purpose flour",
      "1 cup white sugar",
      "1 egg",
      "1 cup butter"
    ],
    "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nLet butter soften, then mix all ingredients together except raspberry jam.\nReserve 1 1/2 cups of mixture.\nPress pastry mixture into 8-inch square pan then place raspberry jam over it making sure there is 1/2 inch border on all sides.\nSprinkle reserved mixture of top.\nBake for 40-50 minutes or until light brown. Let cool on wire rack before cutting into bars.\n",
    "embedding_ingredients": "raspberry jam, walnuts, all-purpose flour, white sugar, egg, butter",
    "features": {
      "preparation_time": "medium",
      "prep_time": 50,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "No Bake Peanut Butter Cookies I",
    "ingredients": [
      "2 cups white sugar",
      "1/2 cup milk",
      "1/4 cup butter",
      "2 tablespoons unsweetened cocoa powder",
      "3 cups quick cooking oats",
      "1/2 cup peanut butter",
      "1 teaspoon vanilla extract",
      "1 cup chopped walnuts (optional)"
    ],
    "instructions": "Combine sugar, milk, butter and cocoa in a saucepan and bring to a boil, cooking 1 minute.\nRemove from heat and add remaining ingredients. Stir and mix well.\nDrop by teaspoons onto wax paper, letting stand 30 minutes or when dry and cool. Store in well-sealed container.\n",
    "embedding_ingredients": "white sugar, milk, butter, unsweetened cocoa powder, quick cooking oats, peanut butter, vanilla extract, walnuts",
    "features": {
      "preparation_time": "medium",
      "prep_time": 31,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Spool Sugar Cookies",
    "ingredients": [
      "1 cup margarine",
      "1 cup vegetable oil",
      "1 cup white sugar",
      "1 cup confectioners' sugar",
      "2 eggs",
      "1 teaspoon vanilla extract",
      "4 cups all-purpose flour",
      "1 teaspoon baking soda",
      "1 teaspoon cream of tartar",
      "1 teaspoon salt",
      "1 cup white sugar for decoration"
    ],
    "instructions": "In a large bowl, cream together the margarine, oil, white sugar and confectioners' sugar until smooth. Beat in the eggs, one at a time then stir in the vanilla. Combine the flour, baking soda, cream of tartar and salt; stir into the sugar mixture until just blended. Cover and chill dough for at least 3 hours or overnight.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. Roll the chilled dough into walnut sized balls and roll the balls in the remaining sugar. Place them 2 inches apart onto the cookie sheets. Press into each ball with the open end of a plastic thread spool. Dip the spool into the sugar between each cookie to prevent sticking problems.\nBake for 8 to 10 minutes in the preheated oven. Do not over bake or you will lose the delicate taste. Enjoy!\n",
    "embedding_ingredients": "margarine, vegetable oil, white sugar, confectioners' sugar, eggs, vanilla extract, all-purpose flour, baking soda, cream of tartar, alt, white sugar for decoration",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Stove Top Tofu Chili",
    "ingredients": [
      "1/2 (12 ounce) package extra firm tofu",
      "1 teaspoon chili powder",
      "1 clove garlic, minced",
      "2 tablespoons vegetable oil",
      "1/2 cup onion, chopped",
      "2 stalks celery, chopped",
      "1/2 cup whole kernel corn, undrained",
      "1 (15.25 ounce) can kidney beans, undrained",
      "1 (14.5 ounce) can stewed tomatoes, undrained",
      "1 quart water"
    ],
    "instructions": "In a medium bowl, crumble the tofu and toss with the chili powder and garlic.\nHeat the oil in a large saucepan over medium heat, and saute the onion and celery until tender. Stir in the tofu mixture. Continue cooking about 5 minutes over low heat.\nMix in the corn, kidney beans, and stewed tomatoes. Add water and bring to a boil. Reduce heat to low and simmer about 50 minutes.\n",
    "embedding_ingredients": "package extra firm tofu, chili powder, love garlic,, vegetable oil, onion,, stalks celery,, whole kernel corn, undrained, can kidney beans, undrained, can stewed tomatoes, undrained, quart water",
    "features": {
      "preparation_time": "medium",
      "prep_time": 55,
      "cuisine": "Asian",
      "complexity": "medium"
    }
  },
  {
    "title": "Layered Seafood Dip",
    "ingredients": [
      "1 (8 ounce) package cream cheese, softened",
      "1/2 cup sour cream",
      "1/4 cup mayonnaise",
      "1 cup cocktail sauce",
      "1/2 cup chopped green bell pepper",
      "3 green onions, chopped",
      "1 tomato, seeded and chopped",
      "1 cup cooked crabmeat",
      "1 cup cooked baby shrimp",
      "1 cup finely shredded mozzarella cheese"
    ],
    "instructions": "In a medium bowl, blend cream cheese, sour cream and mayonnaise.\nIn the bottom of an approximately 12 inch round serving dish, spread the cream cheese mixture. Pour cocktail sauce evenly over the mixture. Layer with green bell pepper, green onions and tomato. Top with crabmeat and shrimp. Sprinkle with mozzarella.\nCover and chill in the refrigerator at least 2 hours before serving.\n",
    "embedding_ingredients": "package cream cheese, softened, our cream, mayonnaise, cocktail sauce, green bell pepper, reen onions,, tomato, seeded and, cooked crabmeat, cooked baby shrimp, finely shredded mozzarella cheese",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Italian",
      "complexity": "medium"
    }
  },
  {
    "title": "Ali's Green Sauce",
    "ingredients": [
      "3 avocados, peeled and pitted",
      "3 green tomatoes",
      "4 fresh tomatillos, husks removed",
      "3 cloves garlic, peeled",
      "2 jalapeno peppers, seeded and halved",
      "5 sprigs fresh cilantro",
      "1 1/2 cups sour cream",
      "salt to taste"
    ],
    "instructions": "Place tomatoes, tomatillos, garlic, and jalapenos in a saucepan, and add enough water to cover. Bring to a boil, and cook for 15 minutes, or until vegetables are tender. Remove from heat, drain, and allow to cool.\nPlace avocados, the cooked vegetables, sour cream, and cilantro in a blender or food processor, and blend until smooth. Season to taste with salt. Cover, and refrigerate until ready to serve.\n",
    "embedding_ingredients": "avocados, and pitted, reen tomatoes, fresh tomatillos, husks removed, loves garlic,, jalapeno peppers, seeded and halved, sprigs fresh cilantro, sour cream, salt to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "Mexican",
      "complexity": "medium"
    }
  },
  {
    "title": "Easy Chicken and Dumplings",
    "ingredients": [
      "2 tablespoons butter",
      "1 large yellow onion, chopped",
      "2 cloves garlic, minced",
      "1 pound boneless chicken thighs",
      "1 cup low-sodium chicken broth",
      "1 (10 ounce) package frozen mixed vegetables",
      "1/2 teaspoon dried sage",
      "1/2 teaspoon dried thyme",
      "1 1/2 cups self-rising flour",
      "3 tablespoons chopped fresh parsley",
      "3 tablespoons shortening",
      "2/3 cup buttermilk"
    ],
    "instructions": "Melt butter in a large saucepan or pot over medium heat. Saute onion and garlic for 5 minutes, then stir in chicken and saute until browned, about 7 to 10 minutes. Stir in broth, vegetables, sage and thyme; mix all together and let simmer over medium heat while preparing the dumplings.\nIn a medium bowl, mix flour and parsley together. Add shortening and stir mixture into a coarse, mealy dough. Stir in buttermilk, a little bit at a time, until dough holds together and is soft but firm. (If needed, add up to 2 tablespoons more buttermilk).\nBring chicken mixture to a boil over medium high heat and drop round spoonfuls of dumpling mixture on top (do not let dumplings touch each other). Reduce heat to low, cover pot and let simmer for 10 to 12 minutes.\n",
    "embedding_ingredients": "butter, large yellow onion,, loves garlic,, boneless chicken thighs, low-sodium chicken broth, package frozen mixed vegetables, dried sage, dried thyme, self-rising flour, fresh parsley, shortening, buttermilk",
    "features": {
      "preparation_time": "medium",
      "prep_time": 27,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Bratwurst, Sauerkraut and Bean Casserole",
    "ingredients": [
      "1 pound fresh bratwurst sausages",
      "1 (32 ounce) package sauerkraut",
      "1 pinch celery salt",
      "1 tablespoon brown sugar",
      "1 (15 ounce) can baked beans"
    ],
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Cook bratwurst in a skillet over medium-high heat just until nicely browned on the outside.\nSpread sauerkraut in the bottom of a 9x11 casserole dish, leaving a 2 inch margin at the edges. Sprinkle celery salt and brown sugar over the sauerkraut. Place the sausages on top. Pour the beans around the outer edge of the sauerkraut. Cover the dish with a lid or aluminum foil.\nBake for about 45 minutes in the preheated oven, until bratwurst links are cooked through.\n",
    "embedding_ingredients": "fresh bratwurst sausages, package sauerkraut, pinch celery salt, brown sugar, can baked beans",
    "features": {
      "preparation_time": "medium",
      "prep_time": 45,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Prosciutto Cups",
    "ingredients": [
      "3 cloves garlic, minced",
      "1 cup frozen chopped spinach, thawed and squeezed dry",
      "1/2 pound thinly sliced prosciutto",
      "1 cup ricotta cheese"
    ],
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together the garlic, spinach and ricotta cheese until well blended. Set aside. Place strips of prosciutto into mini muffin cups so that they line the bottom, but there is some meat hanging out over the sides, and it kind of looks like a flower. Fill each cup with about 1 1/2 tablespoons of the cheese mixture, or so the cup is full and rounded on the top. The filling should look like the center of the flower.\nBake for 10 to 15 minutes, until the prosciutto is browned and stiff to the touch. The cups should be able to retain their shape after removing from the pan. Serve warm, but not hot.\n",
    "embedding_ingredients": "loves garlic,, frozen spinach, thawed and squeezed dry, thinly prosciutto, ricotta cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "Italian",
      "complexity": "low"
    }
  },
  {
    "title": "Crabless Chicken Cakes",
    "ingredients": [
      "2 1/2 cups shredded cooked chicken meat",
      "1/2 cup cracker crumbs",
      "1/4 cup minced onion",
      "1/4 cup mayonnaise",
      "1/4 cup tartar sauce",
      "1 teaspoon dried parsley",
      "1/4 teaspoon salt",
      "1/4 teaspoon black pepper",
      "2 dashes hot sauce",
      "1 cup seasoned bread crumbs",
      "1/4 cup olive oil for frying"
    ],
    "instructions": "In a bowl, mix the chicken, cracker crumbs, onion, mayonnaise, tartar sauce, parsley, salt, pepper, and hot sauce. Form the mixture into 6 cakes. Place the bread crumbs in a bowl. Dip the cakes into the bread crumbs to evenly coat.\nHeat the olive oil in a skillet over medium heat, and cook the cakes until evenly browned, about 5 minutes on each side. Drain on paper towels before serving.\n",
    "embedding_ingredients": "shredded cooked chicken meat, cracker crumbs, onion, mayonnaise, tartar sauce, dried parsley, alt, black pepper, dashes hot sauce, easoned bread crumbs, olive oil for frying",
    "features": {
      "preparation_time": "medium",
      "prep_time": 5,
      "cuisine": "Mediterranean",
      "complexity": "high"
    }
  },
  {
    "title": "Sweet Pea Mockamole",
    "ingredients": [
      "1 cup frozen green peas, thawed and drained",
      "1 teaspoon ground cumin",
      "3 tablespoons chopped onion",
      "1 large clove garlic, chopped",
      "1 tablespoon lemon juice",
      "1 tablespoon olive oil",
      "1/2 teaspoon red pepper flakes, or to taste",
      "salt and ground black pepper to taste"
    ],
    "instructions": "Combine the peas, cumin, onion, and garlic in the container of a food processor or blender. Process until smooth. Add lemon juice and olive oil, and process just to blend. Taste and season with red pepper flakes, salt and pepper. Blend for just a few more seconds, and transfer to a serving bowl. Serve with chips, crackers, or fresh veggies.\n",
    "embedding_ingredients": "frozen green peas, thawed and drained, cumin, onion, large clove garlic,, lemon juice, olive oil, red pepper flakes, or to taste, salt and black pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Indian",
      "complexity": "medium"
    }
  },
  {
    "title": "Turkey Loaf",
    "ingredients": [
      "1 1/2 pounds ground turkey",
      "1 egg, lightly beaten",
      "1 onion, chopped",
      "1 1/2 cups bread crumbs, or as needed",
      "2 teaspoons salt",
      "ground black pepper to taste",
      "1 tablespoon poultry seasoning"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix the turkey, egg, onion, and bread crumbs. Adjust the amount of bread crumbs as needed to make a stiff mixture. Season with salt and pepper. Transfer the mixture to a 9x5 inch loaf pan, and sprinkle with poultry seasoning.\nBake 1 1/2 hour in the preheated oven, or until meat is cooked through and the internal temperature is at least 170 degrees F (70 degrees C) when taken with a meat thermometer.\n",
    "embedding_ingredients": "turkey, egg, lightly beaten, onion,, bread crumbs, or as needed, salt, black pepper to taste, poultry seasoning",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Texas Rice",
    "ingredients": [
      "3 cups water",
      "2 cups uncooked long grain white rice",
      "6 slices bacon",
      "1 1/2 pounds ground beef",
      "1 onion, chopped",
      "1/2 green bell pepper, seeded and chopped",
      "1 (28 ounce) can peeled and diced tomatoes",
      "1 1/2 teaspoons salt",
      "1/4 teaspoon ground black pepper",
      "1 1/2 cups shredded Cheddar cheese"
    ],
    "instructions": "Combine rice and water in a saucepan, and bring to a boil. Reduce heat, cover and simmer for 20 minutes.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, reserving 2 tablespoons of drippings, crumble and set aside. Add ground beef, green pepper, and onion to the skillet; cook over medium-high heat until the beef is evenly browned. Drain excess grease, and season with salt and pepper.\nPreheat the oven to 400 degrees F (200 degrees C).\nPlace beef and cooked rice into a 9x13 inch baking dish. Stir in the tomatoes, bacon and reserved drippings, mixing until everything is well blended. Spread the shredded cheese over the top.\nBake for 30 minutes in the preheated oven, until cheese is bubbly, and the center is heated through.\n",
    "embedding_ingredients": "water, uncooked long grain white rice, slices bacon, beef, onion,, reen bell pepper, seeded and, can and tomatoes, salt, black pepper, shredded cheddar cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 50,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Cheddar Crackers",
    "ingredients": [
      "2 cups all-purpose flour",
      "1 teaspoon salt",
      "1/4 teaspoon ground white pepper",
      "1/4 teaspoon dry mustard",
      "3/4 cup butter, chilled",
      "1/2 cup shredded Cheddar cheese",
      "6 tablespoons cold water, or as needed"
    ],
    "instructions": "In a medium bowl, stir together the flour, salt, white pepper and mustard. Cut in butter with a fork until the mixture resembles coarse crumbs. Stir in Cheddar cheese. Stir in water one tablespoon at a time, until the dough is able to hold together. Press the mixture into a ball, wrap and refrigerate for at least 30 minutes.\nPreheat the oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nOn a lightly floured surface, roll the dough out to a rectangle that is 16x12 inches. The dough should be about 1/8 inch thick. Cut into 1x3 inch strips. Place the strips onto the prepared baking sheets spaced about 1 inch apart.\nBake for 10 to 12 minutes in the preheated oven, or until golden and crispy. Cool completely before storing.\n",
    "embedding_ingredients": "all-purpose flour, alt, white pepper, dry mustard, butter, chilled, hredded cheddar cheese, cold water, or as needed",
    "features": {
      "preparation_time": "medium",
      "prep_time": 42,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Sweet Maple Pork Chops",
    "ingredients": [
      "1 egg, lightly beaten",
      "1 quart heavy cream, divided",
      "salt to taste",
      "ground black pepper to taste",
      "6 boneless pork chops",
      "1/2 cup quick cooking oats",
      "1 quart vegetable oil for frying",
      "1 tablespoon butter",
      "1 large onion, cut into 1 inch chunks",
      "1 clove garlic, diced",
      "3/4 cup maple syrup",
      "6 ounces sliced fresh mushrooms",
      "2 tablespoons chopped fresh basil leaves"
    ],
    "instructions": "Mix the egg, 3 cups heavy cream, salt, and pepper in a shallow bowl. Season the pork chops with salt and pepper, and dip in the cream mixture. Then dredge in the oats to coat. Repeat to coat chops completely.\nHeat the oil in a skillet over medium-high heat. Use tongs to place the coated chops in the hot oil, and fry until browned on both sides. Remove from heat, and set aside.\nMelt the butter in a skillet over medium heat (you may use the same skillet if the oil has been drained), and cook the pork chops, onion, and garlic until onion is tender. Pour in the maple syrup, and mix in mushrooms and basil. Season with salt and pepper. Cover, reduce heat to low, and cook 10 minutes, or until pork chops are done. Remove chops from skillet, reserving sauce.\nMix the remaining cream into the skillet with reserved sauce. Bring to a boil. Cook and stir until thickened. Serve over the pork chops.\n",
    "embedding_ingredients": "egg, lightly beaten, quart heavy cream, divided, salt to taste, black pepper to taste, boneless pork chops, quick cooking oats, quart vegetable oil for frying, butter, large onion, cut into chunks, love garlic,, maple syrup, fresh mushrooms, fresh basil leaves",
    "features": {
      "preparation_time": "medium",
      "prep_time": 10,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Menudo Rojo (Red Menudo)",
    "ingredients": [
      "3 gallons water, divided",
      "2 1/2 pounds beef tripe, cut into 1-inch pieces",
      "6 cloves garlic, finely chopped",
      "1 large white onion, finely chopped",
      "1 1/2 tablespoons salt",
      "1 tablespoon ground black pepper",
      "1 1/2 tablespoons dried oregano",
      "2 tablespoons ground red pepper",
      "5 de arbol chile peppers",
      "6 japones chile peppers, seeds removed",
      "6 cups canned white or yellow hominy, drained",
      "1/2 white onion, chopped",
      "1/4 cup chopped fresh cilantro",
      "2 limes, juiced"
    ],
    "instructions": "In a large pot, bring 1 gallon water to a boil. Place tripe in the pot, reduce heat, and simmer 2 hours. Periodically skim off fat with a spoon. Drain water, reduce heat, and pour in a fresh gallon of water. Continue to simmer tripe for 2 hours; drain.\nPour remaining 1 gallon water into the pot with tripe, and bring to a boil. Stir in garlic and 1 white onion. Season with salt, pepper, oregano, and red pepper. Reduce heat, and simmer 1 hour.\nPreheat the broiler.\nArrange the de arbol chile peppers on a baking sheet, and broil about 2 minutes, just until they begin to scorch. Remove from heat, slit lengthwise, and remove seeds. In a blender or food processor, blend the de arbol chile peppers and japones chile peppers until very finely chopped. Mix into the pot, and continue cooking 2 hours over low heat.\nMix the hominy into the pot. Continue cooking 1 hour. Serve with remaining onion, cilantro, and lime juice.\n",
    "embedding_ingredients": "allons water, divided, beef tripe, cut into -inch pieces, loves garlic, finely, large white onion, finely, salt, black pepper, dried oregano, red pepper, de arbol chile peppers, japones chile peppers, seeds removed, canned white or yellow hominy, drained, white onion,, fresh cilantro, limes, juiced",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "Mexican",
      "complexity": "high"
    }
  },
  {
    "title": "Stephanie's Best Casserole",
    "ingredients": [
      "1 (16 ounce) package rigatoni pasta",
      "1 tablespoon olive oil",
      "3 boneless skinless chicken breast halves, chopped",
      "salt and pepper to taste",
      "1 (26 ounce) jar spaghetti sauce with mushrooms",
      "2 cups broccoli rabe, trimmed and chopped",
      "1 (8 ounce) package shredded mozzarella cheese",
      "1 cup shredded Cheddar cheese"
    ],
    "instructions": "Bring a large pot of lightly salted water to a boil, and cook rigatoni pasta for 8 to 10 minutes, until al dente. Drain, and set aside.\nHeat the olive oil in a skillet over medium heat. Season the chicken with salt and pepper, and cook in the skillet 20 minutes, or until no longer pink and juices run clear.\nPreheat oven to 350 degrees F (175 degrees C). Lightly butter a 10 inch casserole dish.\nIn the prepared casserole dish, mix the cooked pasta, cooked chicken, spaghetti sauce, broccoli rabe, and mozzarella cheese. Top with Cheddar cheese.\nBake 25 minutes in the preheated oven, until bubbly and lightly brown.\n",
    "embedding_ingredients": "package rigatoni pasta, olive oil, boneless skinless chicken breast halves,, salt and pepper to taste, jar spaghetti sauce with mushrooms, broccoli rabe, trimmed and, package shredded mozzarella cheese, hredded cheddar cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 55,
      "cuisine": "Italian",
      "complexity": "medium"
    }
  },
  {
    "title": "Avocado Green Goddess Dressing",
    "ingredients": [
      "1 avocado, peeled and pitted",
      "1 cup mayonnaise",
      "5 anchovy filets, rinsed and chopped",
      "2 tablespoons chopped green onion",
      "1 tablespoon lemon juice",
      "1 clove garlic, chopped",
      "salt and pepper to taste"
    ],
    "instructions": "In a blender combine the avocado, mayonnaise, anchovies, green onion, lemon juice, garlic, and salt and pepper. Process until smooth, then chill for 24 hours before serving.\n",
    "embedding_ingredients": "avocado, and pitted, mayonnaise, anchovy filets, rinsed and, green onion, lemon juice, love garlic,, salt and pepper to taste",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Caribbean Crabmeat Salad",
    "ingredients": [
      "3 cups uncooked rotini pasta",
      "1 (8 ounce) package imitation crabmeat, flaked",
      "1 red bell pepper, julienned",
      "1 mango - peeled, seeded, and cubed",
      "2 tablespoons chopped fresh cilantro",
      "1 jalapeno pepper, seeded and minced",
      "1 teaspoon lime zest",
      "3 tablespoons fresh lime juice",
      "2 tablespoons olive oil",
      "1 tablespoon honey",
      "1/2 teaspoon ground cumin",
      "1/2 teaspoon ground ginger",
      "1/4 teaspoon salt"
    ],
    "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and rinse under cold water.\nPlace pasta, crabmeat, red pepper, mango, cilantro and jalapeno in a large bowl and set aside.\nIn a small bowl, whisk together the lime zest, lime juice, olive oil, honey, cumin, ginger and salt. Pour over salad, toss to coat and let sit in refrigerator for at least one hour before serving.\n",
    "embedding_ingredients": "uncooked rotini pasta, package imitation crabmeat, flaked, red bell pepper, julienned, mango - , seeded, and cubed, fresh cilantro, jalapeno pepper, seeded and, lime zest, fresh lime juice, olive oil, honey, cumin, ginger, alt",
    "features": {
      "preparation_time": "medium",
      "prep_time": 10,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Cherry Chocolate Cobbler",
    "ingredients": [
      "1 1/2 cups all-purpose flour",
      "1/2 cup white sugar",
      "2 teaspoons baking powder",
      "1/2 teaspoon salt",
      "1/4 cup butter",
      "1 cup chocolate chips",
      "1 egg",
      "1/4 cup milk",
      "1 (21 ounce) can cherry pie filling"
    ],
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Coat a 2 quart casserole dish with vegetable cooking spray. Melt chocolate chips in a measuring cup in the microwave, stirring every 20 seconds until smooth. Let stand for 5 minutes to cool slightly.\nIn a medium bowl, stir together the flour, sugar, baking powder, and salt. Cut in butter until the dough is a uniform crumbly texture. Beat the egg into the melted chocolate chips, then stir the milk in. Pour the chocolate mixture into the dry ingredients, and stir until well blended.\nPour the cherry pie filling in an even layer in the bottom of the greased casserole dish. Drop spoonfuls of the chocolate batter over the cherries in a random pattern.\nBake for 40 to 45 minutes in the preheated oven, until top crust is not doughy when lifted. Serve warm.\n",
    "embedding_ingredients": "all-purpose flour, white sugar, baking powder, alt, butter, chocolate chips, egg, milk, can cherry pie filling",
    "features": {
      "preparation_time": "medium",
      "prep_time": 50,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Cheesiest Tomato Soup",
    "ingredients": [
      "2 (28 ounce) cans whole peeled tomatoes",
      "5 cups chicken broth",
      "3 cups shredded sharp Cheddar cheese",
      "1 (6 ounce) can tomato paste",
      "1 teaspoon dried parsley",
      "1 teaspoon dried basil leaves",
      "1/2 teaspoon dried tarragon",
      "1 pinch dried thyme",
      "salt and pepper to taste"
    ],
    "instructions": "In a blender or food processor, puree tomatoes with liquid until smooth. Pour into a medium saucepan over medium-low heat. Stir in broth, cheese and tomato paste. Season with parsley, basil, tarragon, thyme, salt and pepper. Simmer 30 minutes, stirring frequently, until cheese is melted and smooth and flavors are well blended.\n",
    "embedding_ingredients": "cans whole tomatoes, chicken broth, shredded sharp cheddar cheese, can tomato paste, dried parsley, dried basil leaves, dried tarragon, pinch dried thyme, salt and pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Nonalco Punch",
    "ingredients": [
      "4 cups cranberry juice",
      "4 cups pineapple juice",
      "1 1/2 cups white sugar",
      "1 teaspoon almond extract",
      "1 liter ginger ale soda"
    ],
    "instructions": "In a large punch bowl, combine cranberry juice, pineapple juice and sugar. Stir until sugar is dissolved. Add almond extract and pour in the ginger ale.\n",
    "embedding_ingredients": "cranberry juice, pineapple juice, white sugar, almond extract, liter ginger ale soda",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "Asian",
      "complexity": "low"
    }
  },
  {
    "title": "Homemade Ginger Ale",
    "ingredients": [
      "1 1/2 tablespoons grated fresh ginger root",
      "1 cup sugar",
      "1/4 teaspoon active dry yeast",
      "1 lemon, juiced",
      "water"
    ],
    "instructions": "Into an empty 2-liter soda bottle, put the ginger root, sugar, yeast, and lemon juice. Fill the rest of the way with water. Screw the cap onto the bottle as tight as possible. Shake the bottle well, then leave at room temperature until the bottle is too hard to squeeze, about 2 days. Refrigerate. To serve, pour through a tea strainer.\n",
    "embedding_ingredients": "fresh ginger root, ugar, active dry yeast, lemon, juiced, water",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Asian",
      "complexity": "low"
    }
  },
  {
    "title": "Teri's Dinner in a Pumpkin",
    "ingredients": [
      "1 1/2 pounds ground beef",
      "1 pound ground pork sausage",
      "salt and pepper to taste",
      "2 tablespoons pumpkin pie spice",
      "2 tablespoons brown sugar",
      "2 (14.5 ounce) cans chicken stock",
      "1 1/2 cups long grain and wild rice mix",
      "1 sugar pumpkin",
      "1 (10.75 ounce) can condensed cream of celery soup",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "2 (4 ounce) cans mushroom stems and pieces, drained",
      "2 (14.5 ounce) cans French cut green beans"
    ],
    "instructions": "In a large skillet over medium heat, mix ground beef and sausage. Cook and stir until evenly browned. Mix in salt and pepper, pumpkin pie spice, and brown sugar.\nDrain meats, and mix in chicken stock and rice. Cover, and cook 25 to 30 minutes, until rice is tender.\nPreheat oven to 400 degrees F (200 degrees C). Remove and reserve top of pumpkin. Scoop out seeds and stringy pulp.\nMix cream of celery soup, cream of mushroom soup, mushroom stems and pieces, and green beans into the beef and sausage mixture. Spoon mixture into the pumpkin, and replace pumpkin top.\nPlace pumpkin on a large baking sheet, and bake 1 hour in the preheated oven, or until pumpkin is tender. Scoop out portions of filling and parts of the cooked pulp to serve.\n",
    "embedding_ingredients": "beef, pork sausage, salt and pepper to taste, pumpkin pie spice, brown sugar, cans chicken stock, long grain and wild rice mix, sugar pumpkin, can condensed cream of celery soup, can condensed cream of mushroom soup, cans mushroom stems and pieces, drained, cans french cut green beans",
    "features": {
      "preparation_time": "long",
      "prep_time": 90,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Brussels Sprouts Bake",
    "ingredients": [
      "1 cup water",
      "2 (10 ounce) packages frozen brussels sprouts",
      "2 tablespoons butter",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "2 eggs, beaten",
      "1/2 cup shredded Cheddar cheese",
      "1/2 cup dry bread crumbs"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring water to boil in a medium saucepan. Place frozen brussels sprouts in the water, and return to boil. Reduce heat, and simmer 6 to 7 minutes, until tender; drain.\nIn a medium bowl, mix brussels sprouts with butter, cream of mushroom soup, eggs, Cheddar cheese, and 1/3 cup bread crumbs. Transfer to a medium baking dish, and top with remaining bread crumbs.\nCover, and bake 25 minutes in the preheated oven, until bubbly. Uncover, and continue baking 5 minutes, until lightly browned.\n",
    "embedding_ingredients": "water, packages frozen brussels sprouts, butter, can condensed cream of mushroom soup, eggs, beaten, hredded cheddar cheese, dry bread crumbs",
    "features": {
      "preparation_time": "medium",
      "prep_time": 37,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Brown Sugar Biscuits",
    "ingredients": [
      "2 cups all-purpose flour",
      "1/4 cup brown sugar",
      "1 tablespoon baking powder",
      "1/4 teaspoon salt",
      "1/4 teaspoon cream of tartar",
      "1/2 cup butter flavored shortening",
      "2/3 cup milk",
      "1 teaspoon vanilla extract",
      "1/4 cup butter, softened",
      "1/4 cup brown sugar",
      "5 1/2 teaspoons ground cinnamon"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a baking sheet, or use parchment paper.\nIn a large bowl, combine flour, brown sugar, baking powder, salt and cream of tartar. Cut in shortening until mixture resembles coarse crumbs. Mix in milk and vanilla. Knead briefly on a floured surface. Roll out into a large rectangle, 1/2 inch thick. Spread softened butter onto surface of dough. Mix together brown sugar and cinnamon; sprinkle evenly over butter. Roll tightly, and cut into 12 equal slices. Place on prepared baking sheet.\nBake in preheated oven for 15 to 20 minutes, or until golden brown.\n",
    "embedding_ingredients": "all-purpose flour, brown sugar, baking powder, alt, cream of tartar, butter flavored shortening, milk, vanilla extract, butter, softened, brown sugar, cinnamon",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Country Rib Delight",
    "ingredients": [
      "3 pounds pork spareribs",
      "1 cup applesauce",
      "1 cup pure maple syrup",
      "6 tablespoons lemon juice",
      "1/2 cup ketchup",
      "1/4 teaspoon paprika",
      "1/4 teaspoon ground cinnamon",
      "1/4 teaspoon garlic powder",
      "1/4 teaspoon salt",
      "1/4 teaspoon ground black pepper"
    ],
    "instructions": "Place ribs in a large pot with enough water to cover, and bring to a boil. Reduce heat to low, and simmer 10 minutes.\nPreheat oven to 325 degrees F (165 degrees C). Grease a baking dish.\nIn a bowl, mix the applesauce, syrup, lemon juice, ketchup, paprika, cinnamon, garlic powder, salt, and pepper.\nPlace ribs in the prepared baking dish, and brush with 1/2 the sauce. Bake uncovered, basting frequently with remaining sauce, for 1 1/2 hours, until done.\n",
    "embedding_ingredients": "pork spareribs, applesauce, pure maple syrup, lemon juice, ketchup, paprika, cinnamon, garlic powder, alt, black pepper",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Twenty Minute Chicken",
    "ingredients": [
      "3 boneless, skinless chicken breast halves",
      "1/2 large onion, chopped",
      "2 (10 ounce) packages sliced fresh button mushrooms",
      "1/4 cup olive oil",
      "salt and freshly ground black pepper to taste",
      "1 clove garlic, chopped (optional)",
      "1 cup shredded mozzarella cheese"
    ],
    "instructions": "Preheat oven to 400 degrees F (200 degrees C). Wash chicken breasts, pat dry with paper towels, and cut each breast in half.\nHeat 2 tablespoons oil in a large skillet over medium-high heat. Sear chicken briefly, turning until no longer pink, about 5 minutes.\nMeanwhile, in another large skillet, heat 2 tablespoons oil over medium-high heat. Stir in mushrooms, onions, and garlic, if using; cook until they are nice and soft, about 5 minutes.\nPour contents of both skillets into a baking dish, sprinkle cheese over the top, and bake about 5 minutes.\n",
    "embedding_ingredients": "boneless, skinless chicken breast halves, large onion,, packages fresh button mushrooms, olive oil, salt and freshly black pepper to taste, love garlic,, hredded mozzarella cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "Italian",
      "complexity": "medium"
    }
  },
  {
    "title": "Easy Raspberry Chicken with Coconut Rice",
    "ingredients": [
      "2 cups water",
      "1 (14 ounce) can reduced-fat coconut milk",
      "2 teaspoons minced fresh ginger root",
      "1 cup Basmati rice",
      "1/3 cup all-purpose flour",
      "1 tablespoon lemon pepper",
      "4 (6 ounce) skinless, boneless chicken breast half - cut into bite-size pieces",
      "2 tablespoons vegetable oil",
      "2 teaspoons dried rosemary",
      "1/2 cup raspberry vinegar"
    ],
    "instructions": "In a large pot, bring to a boil the water, coconut milk, ginger, and rice; cover, and simmer, stirring occasionally, until all liquid is absorbed.\nMeanwhile, in a resealable plastic bag, combine the flour, lemon pepper, and chicken; shake to coat.\nHeat oil in a large skillet over medium heat. Fry chicken strips and rosemary, turning occasionally, until golden brown. Remove chicken pieces from pan, and set aside. Pour raspberry vinegar into skillet, and simmer until reduced by half. Return chicken to skillet, and cook until all liquid is absorbed. Serve with coconut rice.\n",
    "embedding_ingredients": "water, can reduced-fat coconut milk, fresh ginger root, basmati rice, all-purpose flour, lemon pepper, skinless, boneless chicken breast half - cut into bite-size pieces, vegetable oil, dried rosemary, raspberry vinegar",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Asian",
      "complexity": "medium"
    }
  },
  {
    "title": "Japanese Potsticker Dip",
    "ingredients": [
      "1 tablespoon soy sauce",
      "1 tablespoon rice vinegar",
      "1/4 teaspoon chili oil, or to taste"
    ],
    "instructions": "In a small bowl or ramekin, stir together the soy sauce and rice vinegar. Drip in the chili oil to taste. Stir with chopsticks, and dip away!\n",
    "embedding_ingredients": "oy sauce, rice vinegar, chili oil, or to taste",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "Asian",
      "complexity": "low"
    }
  },
  {
    "title": "Cuban Goulash",
    "ingredients": [
      "1 tablespoon vegetable oil",
      "1 pound boneless pork roast, cubed",
      "1 pound onions, diced",
      "1 pound bananas, peeled and diced",
      "1 (16 ounce) can diced tomatoes with juice",
      "cayenne pepper to taste",
      "salt and ground black pepper to taste"
    ],
    "instructions": "Heat the oil in a large skillet over medium heat, and brown the pork on all sides. Mix in the onions, and cook and stir until tender.\nMix the bananas and tomatoes with juice into the skillet. Bring to a boil, reduce heat to medium low, and simmer 30 minutes, stirring occasionally, until pork is very tender. Season with cayenne pepper, salt, and pepper.\n",
    "embedding_ingredients": "vegetable oil, boneless pork roast, cubed, onions,, bananas, and, can tomatoes with juice, cayenne pepper to taste, salt and black pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Mom's Potato Puffs",
    "ingredients": [
      "1/2 cup all-purpose flour",
      "1 1/2 teaspoons baking powder",
      "1/2 teaspoon salt",
      "1 cup mashed potatoes",
      "1 egg, beaten",
      "1 quart vegetable oil for deep frying"
    ],
    "instructions": "In a medium bowl, stir together the flour, baking powder, and salt. Mix in the mashed potatoes and egg until well blended.\nHeat oil in a deep-fryer or heavy deep skillet to 365 degrees F (180 degrees C). Carefully drop the potato mixture by spoonfuls into the hot oil, and fry until golden brown, about 5 minutes. Remove from oil to drain on paper towels.\n",
    "embedding_ingredients": "all-purpose flour, baking powder, alt, mashed potatoes, egg, beaten, quart vegetable oil for deep frying",
    "features": {
      "preparation_time": "medium",
      "prep_time": 5,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Cran-Broccoli Salad",
    "ingredients": [
      "2 tablespoons balsamic vinegar",
      "1 teaspoon Dijon mustard",
      "1 teaspoon maple syrup",
      "1 clove garlic, minced",
      "1/2 teaspoon grated lemon zest",
      "salt and pepper to taste",
      "1/2 cup canola oil",
      "1 (16 ounce) package broccoli coleslaw mix",
      "1/2 cup dried cranberries",
      "1/4 cup chopped green onions",
      "1/4 cup chopped pecans"
    ],
    "instructions": "In a medium bowl, whisk together the vinegar, mustard, maple syrup, garlic, and lemon zest. Gradually whisk in the canola oil while drizzling in a fine stream.\nIn a serving bowl, combine the broccoli slaw, dried cranberries, and onion. Pour the dressing over, and toss to coat evenly. Chill for at least 15 minutes before serving. Sprinkle pecans over the top just before serving.\n",
    "embedding_ingredients": "balsamic vinegar, dijon mustard, maple syrup, love garlic,, lemon zest, salt and pepper to taste, canola oil, package broccoli coleslaw mix, dried cranberries, green onions, pecans",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "high"
    }
  }
]